{
	"chapters": [
		[
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنِ ابْنِ مُسْكَانَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اتَّقُوا الْحُكُومَةَ فَإِنَّ الْحُكُومَةَ إِنَّمَا هِيَ لِلْإِمَامِ الْعَالِمِ بِالْقَضَاءِ الْعَادِلِ فِي الْمُسْلِمِينَ لِنَبِيٍّ أَوْ وَصِيِّ نَبِيٍّ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Abu Abdullah Al Momin, from Ibn Muskan, from Suleyman Bin Khalid, <br>Abu Abdullah (asws) has said: ‘Fear the governance, for the governance, but rather it is for the Imam (asws), the knowledgeable one with the just judgements regarding the Muslims. It is either for a Prophet (as) or a successor (as) of a Prophet (as)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ أَبِي جَمِيلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِشُرَيْحٍ يَا شُرَيْحُ قَدْ جَلَسْتَ مَجْلِساً لَا يَجْلِسُهُ إِلَّا نَبِيٌّ أَوْ وَصِيُّ نَبِيٍّ أَوْ شَقِيٌّ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Abu Jameela, from Is’haq Bin Ammar, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Amir Al-Momineen (asws) said to Shurayh (the judge): ‘O Shurayh! You are sitting in a seat none sits upon except for a Prophet (as), or a successor (as) (of a Prophet (as)) or a wretch (oppressor)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا وَلَّى أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) شُرَيْحاً الْقَضَاءَ اشْتَرَطَ عَلَيْهِ أَنْ لَا يُنْفِذَ الْقَضَاءَ حَتَّى يَعْرِضَهُ عَلَيْهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, <br>Abu Abdullah (asws) having said: ‘When Amir Al-Momineen (asws) appointed Shurayh as the judge, stipulated upon him that he would not enforce the judgement without presenting it to him (asws) (first)’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْقُضَاةُ أَرْبَعَةٌ ثَلَاثَةٌ فِي النَّارِ وَ وَاحِدٌ فِي الْجَنَّةِ رَجُلٌ قَضَى بِجَوْرٍ وَ هُوَ يَعْلَمُ فَهُوَ فِي النَّارِ وَ رَجُلٌ قَضَى بِجَوْرٍ وَ هُوَ لَا يَعْلَمُ فَهُوَ فِي النَّارِ وَ رَجُلٌ قَضَى بِالْحَقِّ وَ هُوَ لَا يَعْلَمُ فَهُوَ فِي النَّارِ وَ رَجُلٌ قَضَى بِالْحَقِّ وَ هُوَ يَعْلَمُ فَهُوَ فِي الْجَنَّةِ<br>وَ قَالَ ( عليه السلام ) الْحُكْمُ حُكْمَانِ حُكْمُ اللَّهِ وَ حُكْمُ الْجَاهِلِيَّةِ فَمَنْ أَخْطَأَ حُكْمَ اللَّهِ حَكَمَ بِحُكْمِ الْجَاهِلِيَّةِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, <br>(It has been) narrated from Abu Abdullah (asws): ‘The judges are four, three are in the Fire, and one in the Paradise – a man who judges with inequity and he knows, so he is in the Fire; and a man judges with inequity and he does not know, so he is in the Fire; and a man who judges with the truth and he does not know, so he is in the Fire; and a man who judges with the truth and he does know, so he is in the Paradise’.<br>And he (asws) said: ‘The judgements are two judgements – a judgement of Allah (azwj), and a judgement of the ignorance. So the one who errs in the Judgements of Allah (azwj), has judged by the judgement of the ignorance (disbelief)’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْحُكْمُ حُكْمَانِ حُكْمُ اللَّهِ وَ حُكْمُ الْجَاهِلِيَّةِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مَنْ أَحْسَنُ مِنَ اللَّهِ حُكْماً لِقَوْمٍ يُوقِنُونَ وَ اشْهَدُوا عَلَى زَيْدِ بْنِ ثَابِتٍ لَقَدْ حَكَمَ فِي الْفَرَائِضِ بِحُكْمِ الْجَاهِلِيَّةِ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Abu Baseer, <br>Abu Ja’far (asws) has said: ‘The judgements are two judgements – a Judgement of Allah (azwj) and a judgement of the ignorance, and Allah (azwj) Mighty and Majestic has Said [5:50] And who is better than Allah to Judge for a people who are certain?, and (I (asws)) bear witness that Zayd Bin Sabit had judged with regards to the Obligations by the judgement of the ignorance’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ عَنْ صَبَّاحٍ الْأَزْرَقِ عَنْ حَكَمٍ الْحَنَّاطِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) وَ حَكَمٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا مَنْ حَكَمَ فِي دِرْهَمَيْنِ بِغَيْرِ مَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ مِمَّنْ لَهُ سَوْطٌ أَوْ عَصًا فَهُوَ كَافِرٌ بِمَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Sa’alba, from Sabbah Al Azraq, from Hakam, from Abu Baseer, <br>(It has been narrated) from Abu Ja’far (asws);<br>and Hakam Bin Yafour, from Abu Yafour, <br>from Abu Abdullah (asws); both (asws) having said: ‘The one who judges with regards to (even) two Dirhams by other than what Allah (azwj) Mighty and Majestic Revealed, is from the ones for whom is a whip or a stick (ruling authority), so he is a disbeliever with what Allah (azwj) Mighty and Majestic Revealed upon Muhammad (saww)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ حَكَمَ فِي دِرْهَمَيْنِ بِغَيْرِ مَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فَهُوَ كَافِرٌ بِاللَّهِ الْعَظِيمِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Humran, from Abu Baseer who said, <br>‘I heard Abu Abdullah (asws) saying: ‘The one who judges regarding two Dirhams by other than what Allah (azwj) Mighty and Majestic Revealed, so he is a disbeliever with Allah (azwj) the Magnificent’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ رَفَعَهُ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ حَكَمَ فِي دِرْهَمَيْنِ بِحُكْمِ جَوْرٍ ثُمَّ جَبَرَ عَلَيْهِ كَانَ مِنْ أَهْلِ هَذِهِ الْآيَةِ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الْكافِرُونَ فَقُلْتُ وَ كَيْفَ يَجْبُرُ عَلَيْهِ فَقَالَ يَكُونُ لَهُ سَوْطٌ وَ سِجْنٌ فَيَحْكُمُ عَلَيْهِ فَإِذَا رَضِيَ بِحُكُومَتِهِ وَ إِلَّا ضَرَبَهُ بِسَوْطِهِ وَ حَبَسَهُ فِي سِجْنِهِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from one of our companions, from Abdullah Bin Kaseer, from Abdullah Bin Muskan, raising it, <br>He (asws) said: ‘Rasool-Allah (saww) said: ‘The one who judges regarding (even) two Dirhams with an inequitable judgement, then is compulsive over it, would be from the deserving ones of this Verse [5:44] and whoever did not judge by what Allah Revealed, those are they that are the unbelievers’. So I said, ‘And how is he compulsive over it?’ So he (asws) said: ‘There happens to be for him a whip, and a prison, so he judges over it. So when they are happy with his judgement (fine), or else he whips them with his whip, and imprisons him in his prison’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ أَيُّ قَاضٍ قَضَى بَيْنَ اثْنَيْنِ فَأَخْطَأَ سَقَطَ أَبْعَدَ مِنَ السَّمَاءِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Abu Abdullah Al Momin, from Muawiya Bin Wahab who said, <br>‘I heard Abu Abdullah (asws) saying: ‘Whichever judge who judges between two, so he errs, falls from further than the sky’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ حَدَّثَنِي رَجُلٌ عَنْ سَعِيدِ بْنِ أَبِي الْخَضِيبِ الْبَجَلِيِّ قَالَ كُنْتُ مَعَ ابْنِ أَبِي لَيْلَى مُزَامِلَهُ حَتَّى جِئْنَا إِلَى الْمَدِينَةِ فَبَيْنَا نَحْنُ فِي مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) إِذْ دَخَلَ جَعْفَرُ بْنُ مُحَمَّدٍ ( عليه السلام ) فَقُلْتُ لِابْنِ أَبِي لَيْلَى تَقُومُ بِنَا إِلَيْهِ فَقَالَ وَ مَا نَصْنَعُ عِنْدَهُ فَقُلْتُ نُسَائِلُهُ وَ نُحَدِّثُهُ<br>فَقَالَ قُمْ فَقُمْنَا إِلَيْهِ فَسَاءَلَنِي عَنْ نَفْسِي وَ أَهْلِي ثُمَّ قَالَ مَنْ هَذَا مَعَكَ فَقُلْتُ ابْنُ أَبِي لَيْلَى قَاضِي الْمُسْلِمِينَ فَقَالَ لَهُ أَنْتَ ابْنُ أَبِي لَيْلَى قَاضِي الْمُسْلِمِينَ قَالَ نَعَمْ قَالَ تَأْخُذُ مَالَ هَذَا فَتُعْطِيهِ هَذَا وَ تَقْتُلُ وَ تُفَرِّقُ بَيْنَ الْمَرْءِ وَ زَوْجِهِ لَا تَخَافُ فِي ذَلِكَ أَحَداً<br>قَالَ نَعَمْ قَالَ فَبِأَيِّ شَيْ‏ءٍ تَقْضِي قَالَ بِمَا بَلَغَنِي عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَنْ عَلِيٍّ ( عليه السلام ) وَ عَنْ أَبِي بَكْرٍ وَ عُمَرَ<br>قَالَ فَبَلَغَكَ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنَّهُ قَالَ إِنَّ عَلِيّاً ( عليه السلام ) أَقْضَاكُمْ قَالَ نَعَمْ قَالَ فَكَيْفَ تَقْضِي بِغَيْرِ قَضَاءِ عَلِيٍّ ( عليه السلام ) وَ قَدْ بَلَغَكَ هَذَا فَمَا تَقُولُ إِذَا جِي‏ءَ بِأَرْضٍ مِنْ فِضَّةٍ وَ سَمَاءٍ مِنْ فِضَّةٍ ثُمَّ أَخَذَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِيَدِكَ فَأَوْقَفَكَ بَيْنَ يَدَيْ رَبِّكَ فَقَالَ يَا رَبِّ إِنَّ هَذَا قَضَى بِغَيْرِ مَا قَضَيْتَ<br>قَالَ فَاصْفَرَّ وَجْهُ ابْنِ أَبِي لَيْلَى حَتَّى عَادَ مِثْلَ الزَّعْفَرَانِ ثُمَّ قَالَ لِي الْتَمِسْ لِنَفْسِكَ زَمِيلًا وَ اللَّهِ لَا أُكَلِّمُكَ مِنْ رَأْسِي كَلِمَةً أَبَداً.",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Dawood Bin Farqad, from a man, from Saeed Bin Abu Al Khazeyb Al Bajaly who said, <br>‘I was with Ibn Abu Layli (a judge) accompanying him until we came to Al-Medina. So while we were at the Masjid of the Rasool (saww), when Jafar (asws) Bin Muhammad (asws) entered. So I said to Ibn Abu Layli, ‘Arise with us to go to him (asws)’. So he said, ‘And what shall we do in his (asws) presence?’ So I said, ‘We would ask him (asws) and discuss with him (asws)’. So he said, ‘Arise’. <br>So he (the narrator) said, ‘So we arose to go to him (asws). So he (asws) asked me about myself and my family, then said: ‘Who is this one with you?’ So I said, ‘Ibn Abu Layli, the judge of the Muslims’. So he (asws) said to him: ‘Are you Ibn Abu Layli, the judge of the Muslims?’ He said, ‘Yes’. He (asws) said: ‘You take the wealth of this one and give it to this one, and you kill, and effect separation between the man and his spouse, not fearing anyone in that?’<br>He said, ‘Yes’. He (asws) said: ‘So by which thing do you judge by?’ He said, ‘With what has reached me from Rasool-Allah (saww), and from Ali (asws), and from Abu Bakr and Umar’.<br>He (asws) said: ‘So has it reached you from Rasool-Allah (saww) having said that: ‘Ali (asws) is your judge?’ He said, ‘Yes’. So how do you judge with other than the judgement of Ali (asws), and this has reached you? So what are you saying when they come with a land of silver and a sky of silver, then Rasool-Allah (saww) seizes your hand, so he (saww) would pause you in front of your Lord (azwj), so he (saww) would say: ‘O Lord (azwj)! This one judged with other than what I (saww) judged!’<br>He (the narrator) said, ‘So the face of Ibn Abu Layli paled until it was like the saffron. He said to me, ‘Seek for yourself (another) travelling companion. By Allah (azwj), I shall not speak a word from my head, ever’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَاعِداً فِي حَلْقَةِ رَبِيعَةِ الرَّأْيِ فَجَاءَ أَعْرَابِيٌّ فَسَأَلَ رَبِيعَةَ الرَّأْيِ عَنْ مَسْأَلَةٍ فَأَجَابَهُ فَلَمَّا سَكَتَ قَالَ لَهُ الْأَعْرَابِيُّ أَ هُوَ فِي عُنُقِكَ فَسَكَتَ عَنْهُ رَبِيعَةُ وَ لَمْ يَرُدَّ عَلَيْهِ شَيْئاً فَأَعَادَ عَلَيْهِ الْمَسْأَلَةَ فَأَجَابَهُ بِمِثْلِ ذَلِكَ فَقَالَ لَهُ الْأَعْرَابِيُّ أَ هُوَ فِي عُنُقِكَ فَسَكَتَ رَبِيعَةُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هُوَ فِي عُنُقِهِ قَالَ أَوْ لَمْ يَقُلْ وَ كُلُّ مُفْتٍ ضَامِنٌ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, <br>‘Abu Abdullah (asws) was seated in a circle of Rabi’e Al-Raie, so a Bedouin came over. So he asked Rabi’e Al-Raie a question. So he answered him. So when he was silent, the Bedouin said to him, ‘It is upon your neck’. So Rabi’e was silent from it and did not respond anything over it. So he repeated the question to him. So he answered with similar to that (previously). So the Bedouin said to him, ‘Is it upon your neck?’ So Rabi’e was silent. So Abu Abdullah (asws) said to him: ‘It is upon his neck, or he should not be saying it; and every Mufti (Fatwa issuer) is responsible’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ أَفْتَى النَّاسَ بِغَيْرِ عِلْمٍ وَ لَا هُدًى مِنَ اللَّهِ لَعَنَتْهُ مَلَائِكَةُ الرَّحْمَةِ وَ مَلَائِكَةُ الْعَذَابِ وَ لَحِقَهُ وِزْرُ مَنْ عَمِلَ بِفُتْيَاهُ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda who said, <br>‘Abu Ja’far (asws) said: ‘The one who issues Fatwas to the people without knowledge, and without Guidance from Allah (azwj), the Angels of the Mercy, and the Angels of the Punishment curse him, and attach the burden to him of the ones who acted by his Fatwa’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَاضٍ بَيْنَ قَرْيَتَيْنِ يَأْخُذُ مِنَ السُّلْطَانِ عَلَى الْقَضَاءِ الرِّزْقَ فَقَالَ ذَلِكَ السُّحْتُ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan who said, <br>‘Abu Abdullah (asws) was asked about a judge between two towns taking the livelihood from the ruling authorities upon the judgements. So he (asws) said: ‘That is the ill-gotten (forbidden)’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَخِيهِ الْحَسَنِ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الرِّشَا فِي الْحُكْمِ هُوَ الْكُفْرُ بِاللَّهِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from his brother Al Hassan, from Zurara, from sama’at, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The briber regarding the judgement, he is the disbeliever in Allah (azwj)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ يَزِيدَ بْنِ فَرْقَدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ السُّحْتِ فَقَالَ هُوَ الرِّشَا فِي الْحُكْمِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskam, from Yazeed Bin Farqad who said, <br>‘I asked Abu Abdullah (asws) about ‘السُّحْتِ’ (forbidden earnings). So he (asws) said: ‘The bribery in the judgement’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَدُ اللَّهِ فَوْقَ رَأْسِ الْحَاكِمِ تُرَفْرِفُ بِالرَّحْمَةِ فَإِذَا حَافَ وَكَلَهُ اللَّهُ إِلَى نَفْسِهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Amir Al-Momineen (asws) said: ‘The Hand of Allah (azwj) is above the head of the ruler fluttering with the Mercy. So when he is unjust, Allah (azwj) Leaves him upon himself’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ فِي بَنِي إِسْرَائِيلَ قَاضٍ كَانَ يَقْضِي بِالْحَقِّ فِيهِمْ فَلَمَّا حَضَرَهُ الْمَوْتُ قَالَ لِامْرَأَتِهِ إِذَا أَنَا مِتُّ فَاغْسِلِينِي وَ كَفِّنِينِي وَ ضَعِينِي عَلَى سَرِيرِي وَ غَطِّي وَجْهِي فَإِنَّكِ لَا تَرَيْنَ سُوءاً<br>فَلَمَّا مَاتَ فَعَلَتْ ذَلِكَ ثُمَّ مَكَثَتْ بِذَلِكَ حِيناً ثُمَّ إِنَّهَا كَشَفَتْ عَنْ وَجْهِهِ لِتَنْظُرَ إِلَيْهِ فَإِذَا هِيَ بِدُودَةٍ تَقْرِضُ مَنْخِرَهُ فَفَزِعَتْ مِنْ ذَلِكَ فَلَمَّا كَانَ اللَّيْلُ أَتَاهَا فِي مَنَامِهَا فَقَالَ لَهَا أَفْزَعَكِ مَا رَأَيْتِ قَالَتْ أَجَلْ لَقَدْ فَزِعْتُ فَقَالَ لَهَا أَمَا لَئِنْ كُنْتِ فَزِعْتِ مَا كَانَ الَّذِي رَأَيْتِ إِلَّا فِي أَخِيكِ فُلَانٍ أَتَانِي وَ مَعَهُ خَصْمٌ لَهُ فَلَمَّا جَلَسَا إِلَيَّ قُلْتُ اللَّهُمَّ اجْعَلِ الْحَقَّ لَهُ وَ وَجِّهِ الْقَضَاءَ عَلَى صَاحِبِهِ<br>فَلَمَّا اخْتَصَمَا إِلَيَّ كَانَ الْحَقُّ لَهُ وَ رَأَيْتُ ذَلِكَ بَيِّناً فِي الْقَضَاءِ فَوَجَّهْتُ الْقَضَاءَ لَهُ عَلَى صَاحِبِهِ فَأَصَابَنِي مَا رَأَيْتِ لِمَوْضِعِ هَوَايَ كَانَ مَعَ مُوَافَقَةِ الْحَقِّ .",
					"english": "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Abu Hamza Al Sumaly, <br>Abu Ja’far (asws) has said: ‘There used to be among the Children of Israel, a judge who used to judge with the truth. So when the death presented itself, he said to his wife, ‘When I die, so wash me and shroud me, and place me upon my bed and cover up my face, so that you cannot see evil’.<br>So when he died, she did that. Then she remained with that for a while, then she uncovered from his face in order to look at him. So there was an insect in his nostril. So she panicked from that. So when it was the night, he came in her dream, so he said to her, ‘What did you see (which) terrified you?’ She said, ‘Yes, I had panicked’. So he said to her, ‘That which you panicked from what you saw was nothing except with regards to your brother. So and so came to me and with him was an adversary of his. So when they were seated to me, I said, ‘O Allah (azwj)! Make the truth be for him and the aspect of the judgement to be against his companion’.<br>So when they had disputed to me, and the truth was for him, and I saw that proof in the judgement, so I turned the judgement for him against his companion. Thus, what you saw, hit me, for the placing of my whim although it was in accordance with the truth’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ مَرَّ بِي أَبُو جَعْفَرٍ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا جَالِسٌ عِنْدَ قَاضٍ بِالْمَدِينَةِ فَدَخَلْتُ عَلَيْهِ مِنَ الْغَدِ فَقَالَ لِي مَا مَجْلِسٌ رَأَيْتُكَ فِيهِ أَمْسِ قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ هَذَا الْقَاضِيَ لِي مُكْرِمٌ فَرُبَّمَا جَلَسْتُ إِلَيْهِ فَقَالَ لِي وَ مَا يُؤْمِنُكَ أَنْ تَنْزِلَ اللَّعْنَةُ فَتَعُمَّ مَنْ فِي الْمَجْلِسِ .",
					"english": "Ali Bin Ibrahim, from his father, from one of our companions, from Muhammad Bin Muslim who said, <br>‘Abu Ja’far (asws) and Abu Abdullah (asws) passed by me, and I was seated in the presence of the judge of Al-Medina. So I went over to him (asws) in the morning, so he (asws) said to me: ‘What sitting did I (asws) see you to be in, yesterday?’ I said, ‘May I be sacrificed for you (asws)! This judge is honourable to me, so sometimes I sit with him’. So he (asws) said to me: ‘And what would secure you if the Curse were to descend, so it would embrace (grip all) the ones in the gathering’"
				}
			],
			[
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَيُّمَا مُؤْمِنٍ قَدَّمَ مُؤْمِناً فِي خُصُومَةٍ إِلَى قَاضٍ أَوْ سُلْطَانٍ جَائِرٍ فَقَضَى عَلَيْهِ بِغَيْرِ حُكْمِ اللَّهِ فَقَدْ شَرِكَهُ فِي الْإِثْمِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Whichever Believer proceeds with a Believer regarding a dispute, to a judge or a tyrannous Sultan (ruling authority), so he judges against him with other than the Judgement of Allah (azwj), so he would be his partner in the sin’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَزِيدَ بْنِ إِسْحَاقَ عَنْ هَارُونَ بْنِ حَمْزَةَ الْغَنَوِيِّ عَنْ حَرِيزٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَيُّمَا رَجُلٍ كَانَ بَيْنَهُ وَ بَيْنَ أَخٍ لَهُ مُمَارَاةٌ فِي حَقٍّ فَدَعَاهُ إِلَى رَجُلٍ مِنْ إِخْوَانِهِ لِيَحْكُمَ بَيْنَهُ وَ بَيْنَهُ فَأَبَى إِلَّا أَنْ يُرَافِعَهُ إِلَى هَؤُلَاءِ كَانَ بِمَنْزِلَةِ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ أَ لَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِما أُنْزِلَ إِلَيْكَ وَ ما أُنْزِلَ مِنْ قَبْلِكَ يُرِيدُونَ أَنْ يَتَحاكَمُوا إِلَى الطَّاغُوتِ وَ قَدْ أُمِرُوا أَنْ يَكْفُرُوا بِهِ الْآيَةَ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Yazeed Bin Is’haq, from Haroun Bin Hamza Al Ganawy, from Hareyz, from Abu Baseer, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Whichever man who had a an argument with regards to a right between him and a (Believing) brother of his, so he summons him to a man from his brethren in order to judge between himself and him, but he refuses, except that he wishes to have it raised to those who are at the status of those for whom Allah (azwj) Mighty and Majestic Says [4:60] Have you not seen those who are alleging that they believe in what has been Revealed to you and what was Revealed before you? They desire to summon one another to the judgement of the tyrant, though they were Commanded to deny him – the Verse’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ فِي كِتَابِهِ وَ لا تَأْكُلُوا أَمْوالَكُمْ بَيْنَكُمْ بِالْباطِلِ وَ تُدْلُوا بِها إِلَى الْحُكَّامِ فَقَالَ يَا أَبَا بَصِيرٍ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ عَلِمَ أَنَّ فِي الْأُمَّةِ حُكَّاماً يَجُورُونَ أَمَا إِنَّهُ لَمْ يَعْنِ حُكَّامَ أَهْلِ الْعَدْلِ وَ لَكِنَّهُ عَنَى حُكَّامَ أَهْلِ الْجَوْرِ<br>يَا أَبَا مُحَمَّدٍ إِنَّهُ لَوْ كَانَ لَكَ عَلَى رَجُلٍ حَقٌّ فَدَعَوْتَهُ إِلَى حُكَّامِ أَهْلِ الْعَدْلِ فَأَبَى عَلَيْكَ إِلَّا أَنْ يُرَافِعَكَ إِلَى حُكَّامِ أَهْلِ الْجَوْرِ لِيَقْضُوا لَهُ لَكَانَ مِمَّنْ حَاكَمَ إِلَى الطَّاغُوتِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ أَ لَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِما أُنْزِلَ إِلَيْكَ وَ ما أُنْزِلَ مِنْ قَبْلِكَ يُرِيدُونَ أَنْ يَتَحاكَمُوا إِلَى الطَّاغُوتِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Al Husayn Bin Saeed, from Abdullah Bin Bahr, from Abdullah Bin Muskan, from Abu Baseer who said, <br>‘I said to Abu Abdullah (asws), ‘The Words of Allah (azwj) Mighty and Majestic in His (azwj) book [2:188] And do not swallow up your property among yourselves by false means, neither seek to gain access thereby to the judges’. So he (asws) said: ‘O Abu Baseer! Allah (azwj) Mighty and Majestic Knows that in the community are rulers who are tyrannous. But, He (azwj) does not Mean the just rulers, but He (azwj) Means the unjust rulers.<br>O Abu Muhammad! If there was a right for you against a man, so you summon him to the just ruler, but he refuses except that you raise the matter to an unjust ruler in order to judge for you, would be from the ones who had gone for a ruling to the tyrant; and these are the Words of Allah (azwj) Mighty and Majestic [4:60] Have you not seen those who are alleging that they believe in what has been Revealed to you and what was Revealed before you? They desire to summon one another to the judgement of the tyrant’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِي خَدِيجَةَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِيَّاكُمْ أَنْ يُحَاكِمَ بَعْضُكُمْ بَعْضاً إِلَى أَهْلِ الْجَوْرِ وَ لَكِنِ انْظُرُوا إِلَى رَجُلٍ مِنْكُمْ يَعْلَمُ شَيْئاً مِنْ قَضَائِنَا فَاجْعَلُوهُ بَيْنَكُمْ فَإِنِّي قَدْ جَعَلْتُهُ قَاضِياً فَتَحَاكَمُوا إِلَيْهِ .",
					"english": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Abu Khadeeja who said, <br>‘Abu Abdullah (asws) said to me: ‘Beware of taking each other for judgement to the tyrannous people. But, look around for a man among you who knows something from our (asws) judgements, so make him to be between you (as a judge), for I (asws) have made him (asws) as a judge, so go to him for a judgement’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلَيْنِ مِنْ أَصْحَابِنَا يَكُونُ بَيْنَهُمَا مُنَازَعَةٌ فِي دَيْنٍ أَوْ مِيرَاثٍ فَتَحَاكَمَا إِلَى السُّلْطَانِ أَوْ إِلَى الْقُضَاةِ أَ يَحِلُّ ذَلِكَ فَقَالَ مَنْ تَحَاكَمَ إِلَى الطَّاغُوتِ فَحَكَمَ لَهُ فَإِنَّمَا يَأْخُذُ سُحْتاً وَ إِنْ كَانَ حَقُّهُ ثَابِتاً لِأَنَّهُ أَخَذَ بِحُكْمِ الطَّاغُوتِ وَ قَدْ أَمَرَ اللَّهُ أَنْ يُكْفَرَ بِهِ<br>قُلْتُ كَيْفَ يَصْنَعَانِ قَالَ انْظُرُوا إِلَى مَنْ كَانَ مِنْكُمْ قَدْ رَوَى حَدِيثَنَا وَ نَظَرَ فِي حَلَالِنَا وَ حَرَامِنَا وَ عَرَفَ أَحْكَامَنَا فَارْضَوْا بِهِ حَكَماً فَإِنِّي قَدْ جَعَلْتُهُ عَلَيْكُمْ حَاكِماً فَإِذَا حَكَمَ بِحُكْمِنَا فَلَمْ يَقْبَلْهُ مِنْهُ فَإِنَّمَا بِحُكْمِ اللَّهِ قَدِ اسْتَخَفَّ وَ عَلَيْنَا رَدَّ وَ الرَّادُّ عَلَيْنَا الرَّادُّ عَلَى اللَّهِ وَ هُوَ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Isa, from Safwan, from Dawood Bin Al Husayn, from Umar Bin Hanzala who said, <br>‘I asked Abu Abdullah (asws) about two men from our companions who happened to have a dispute between them regarding a debt, or inheritance. So they went to the Sultan (ruling authority) for judgement, or to the judge. Is that permissible?’ So he (asws) said: ‘The one who goes for a judgement to the tyrant, so he judges for him, so he has rather taken ill-gotten gains, even if it was his right, proved, because he has taken it by a judgement of the tyrant. And Allah (azwj) has Commanded that [4:60] though they were Commanded to deny him’.<br>I said, ‘How should they both deal with it?’ He (asws) said: ‘They should look around to the one who was among them who has reported our (asws) Hadeeth, and has looked into our (asws) Permissibles, and our (asws) Prohibition, and recognises our (asws) judgements. So they should present to him for the judgement, for I (asws) have made him to be a judge over you. So when he judges by our (asws) judgements, and it is not accepted from him, so rather it is the Judgement of Allah (azwj) which has been taken lightly, and against us (asws) is the rejection, and the rejection against us (asws) is the rejection against Allah (azwj), and he (the rejecter) would be upon a legal penalty (Hadd) of the association with Allah (azwj)’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ أَبِيهِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ عَلِيّاً ( صلوات الله عليه ) يَقُولُ لِشُرَيْحٍ انْظُرْ إِلَى أَهْلِ الْمَعْكِ وَ الْمَطْلِ وَ دَفْعِ حُقُوقِ النَّاسِ مِنْ أَهْلِ الْمَقْدُرَةِ وَ الْيَسَارِ مِمَّنْ يُدْلِي بِأَمْوَالِ الْمُسْلِمِينَ إِلَى الْحُكَّامِ فَخُذْ لِلنَّاسِ بِحُقُوقِهِمْ مِنْهُمْ وَ بِعْ فِيهَا الْعَقَارَ وَ الدِّيَارَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ مَطْلُ الْمُسْلِمِ الْمُوسِرِ ظُلْمٌ لِلْمُسْلِمِ وَ مَنْ لَمْ يَكُنْ لَهُ عَقَارٌ وَ لَا دَارٌ وَ لَا مَالٌ فَلَا سَبِيلَ عَلَيْهِ وَ اعْلَمْ أَنَّهُ لَا يَحْمِلُ النَّاسَ عَلَى الْحَقِّ إِلَّا مَنْ وَرَّعَهُمْ عَنِ الْبَاطِلِ<br>ثُمَّ وَاسِ بَيْنَ الْمُسْلِمِينَ بِوَجْهِكَ وَ مَنْطِقِكَ وَ مَجْلِسِكَ حَتَّى لَا يَطْمَعَ قَرِيبُكَ فِي حَيْفِكَ وَ لَا يَيْأَسَ عَدُوُّكَ مِنْ عَدْلِكَ وَ رُدَّ الْيَمِينَ عَلَى الْمُدَّعِي مَعَ بَيِّنَةٍ فَإِنَّ ذَلِكَ أَجْلَى لِلْعَمَى وَ أَثْبَتُ فِي الْقَضَاءِ وَ اعْلَمْ أَنَّ الْمُسْلِمِينَ عُدُولٌ بَعْضُهُمْ عَلَى بَعْضٍ إِلَّا مَجْلُوداً فِي حَدٍّ لَمْ يَتُبْ مِنْهُ أَوْ مَعْرُوفٌ بِشَهَادَةِ زُورٍ أَوْ ظَنِينٌ<br>وَ إِيَّاكَ وَ التَّضَجُّرَ وَ التَّأَذِّيَ فِي مَجْلِسِ الْقَضَاءِ الَّذِي أَوْجَبَ اللَّهُ فِيهِ الْأَجْرَ وَ يُحْسِنُ فِيهِ الذُّخْرَ لِمَنْ قَضَى بِالْحَقِّ وَ اعْلَمْ أَنَّ الصُّلْحَ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحاً حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَاماً<br>وَ اجْعَلْ لِمَنِ ادَّعَى شُهُوداً غُيَّباً أَمَداً بَيْنَهُمَا فَإِنْ أَحْضَرَهُمْ أَخَذْتَ لَهُ بِحَقِّهِ وَ إِنْ لَمْ يُحْضِرْهُمْ أَوْجَبْتَ عَلَيْهِ الْقَضِيَّةَ<br>فَإِيَّاكَ أَنْ تُنَفِّذَ فِيهِ قَضِيَّةً فِي قِصَاصٍ أَوْ حَدٍّ مِنْ حُدُودِ اللَّهِ أَوْ حَقٍّ مِنْ حُقُوقِ الْمُسْلِمِينَ حَتَّى تَعْرِضَ ذَلِكَ عَلَيَّ إِنْ شَاءَ اللَّهُ وَ لَا تَقْعُدَنَّ فِي مَجْلِسِ الْقَضَاءِ حَتَّى تَطْعَمَ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Amro Bin Abu Al Miqdam, from his father, from Salma Bin Kuheyl who said, <br>‘I heard Ali (asws) saying to Shurayh (the judge): ‘Look at the people of the spaciousness and delayers (of payments), and hand over the rights of the people from the able ones and the affluent, from the ones who are delaying the (payment) of the Muslims to the judges, so seize for the people with their rights from them, and sell with regards to it, the real estates and the houses, for I (asws) heard Rasool-Allah (saww) saying: ‘The delayer affluent Muslim is unjust to the Muslim’. And the one who does not have any real estate for him, nor a house, nor wealth, so there is no way upon him. And know that he does not carry the people upon the truth, the one who scares them from the falsehood.<br>Then be comforting with your face and your talk, and your seating, until the one close to you does not covet (desire) your injustice, and your enemy does not despair from your justice. And return the oath to be upon the claimant along with his proof, for in that is the expulsion of the blindness and affirmation in the judgement. And know that the Muslims are equal to each other, except for the whipped-one in a legal penalty (Hadd) which he has not repented upon, or one well-known for bearing false testimonies, or is a suspicious (character).<br>And beware of being angry and hurting in the judicial council in which Allah (azwj) has Obligated the Recompense with regards to it and good treasures for the one who judges with the truth. And know that the reconciliation is allowed between the Muslims, except for a reconciliation which prohibits a Permissible, or permits a Prohibition.<br>And make a time limit upon the claimant to present absent witnesses between the two, so if he presents them, take his right for him, and if he does not present them, obligate the judgement against him.<br>Therefore, beware of implementing a judgement regarding retaliation, or a legal penalty (Hadd) from the Limits of Allah (azwj), or a right from the rights of the Muslims, until you present that to me (asws), Allah (azwj) Willing. And do not sit in the judicial council until you feed (serve food for everyone present)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنِ ابْتُلِيَ بِالْقَضَاءِ فَلَا يَقْضِي وَ هُوَ غَضْبَانُ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘The one who is involved with the judging, so he should not judge while he is angry’."
				},
				{
					"arabic": "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) مَنِ ابْتُلِيَ بِالْقَضَاءِ فَلْيُوَاسِ بَيْنَهُمْ فِي الْإِشَارَةِ وَ فِي النَّظَرِ وَ فِي الْمَجْلِسِ .",
					"english": "And by this chain, <br>He (asws) (The Imam (asws)) said: ‘Amir Al-Momineen (asws) said: ‘The one who is involved with the judging, so let him be comforting between them in his gestures, and in the looking, and in the sitting’."
				},
				{
					"arabic": "وَ بِهَذَا الْإِسْنَادِ أَنَّ رَجُلًا نَزَلَ بِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَمَكَثَ عِنْدَهُ أَيَّاماً ثُمَّ تَقَدَّمَ إِلَيْهِ فِي خُصُومَةٍ لَمْ يَذْكُرْهَا لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ أَ خَصْمٌ أَنْتَ قَالَ نَعَمْ قَالَ تَحَوَّلْ عَنَّا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى أَنْ يُضَافَ الْخَصْمُ إِلَّا وَ مَعَهُ خَصْمُهُ .",
					"english": "And by this chain that, <br>‘A man lodged with Amir Al-Momineen (asws), so he remained with him (asws) for days. Then he came to him (asws) with a dispute which he had not mentioned it to Amir Al-Momineen (asws) beforehand. So he (asws) said to him: ‘Are you the claimant?’ He said, ‘Yes’. He (asws) said: ‘You should transfer out (move out) from us (asws), as Rasool-Allah (saww) has forbidden to entertain the claimant as a guest, unless the defendant is with him’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِشُرَيْحٍ لَا تُسَارَّ أَحَداً فِي مَجْلِسِكَ وَ إِنْ غَضِبْتَ فَقُمْ فَلَا تَقْضِيَنَّ فَأَنْتَ غَضْبَانُ<br>قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( صلوات الله عليه ) لِسَانُ الْقَاضِي وَرَاءَ قَلْبِهِ فَإِنْ كَانَ لَهُ قَالَ وَ إِنْ كَانَ عَلَيْهِ أَمْسَكَ .",
					"english": "A number of our companions, from Ahmad Bin Abu Abdullah, raising it, said, <br>‘Amir Al-Momineen (asws) said to Shurayh (the judge): ‘Do not whisper to anyone in your gathering, and if you are angry, so arise and do not issue a judgement while you are angry’.<br>He (the narrator) said, ‘And Abu Abdullah (asws) said: ‘The tongue of a judge is behind his heart. So if it was for him he speaks, and if it was against him, he remains silent’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ عَمَّنْ سَمِعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَ الْحَاكِمُ يَقُولُ لِمَنْ عَنْ يَمِينِهِ وَ لِمَنْ عَنْ يَسَارِهِ مَا تَرَى مَا تَقُولُ فَعَلَى ذَلِكَ لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ أَلَّا يَقُومُ مِنْ مَجْلِسِهِ وَ تُجْلِسُهُمْ مَكَانَهُ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Dawood Bin Abu Yazeed, from the one who heard it, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘When the judge is saying to the one on his right, and to the one on his left, ‘What is your view, what are you saying?’, so upon that is the Curse of Allah (azwj), and the Angels, and the people altogether. Indeed, why does he not arise from his seat and makes them to sit in his own seat?’"
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعْدِ بْنِ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا أَقْضِي بَيْنَكُمْ بِالْبَيِّنَاتِ وَ الْأَيْمَانِ وَ بَعْضُكُمْ أَلْحَنُ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَيُّمَا رَجُلٍ قَطَعْتُ لَهُ مِنْ مَالِ أَخِيهِ شَيْئاً فَإِنَّمَا قَطَعْتُ لَهُ بِهِ قِطْعَةً مِنَ النَّارِ .",
					"english": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, both together from Ibn Abu Umeyr, from Sa’ad Bin Hisham Bin Al Hakam, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘But rather I (saww) judge among you with the proofs and the oath, and some of you are more mistaken in their arguments than the others. So whichever man I (saww) cut off for him, anything from the wealth of his brother, so rather I (asws) have cut-off for him, by it, a piece from the Fire’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ كَيْفَ أَقْضِي فِي أُمُورٍ لَمْ أُخْبَرْ بِبَيَانِهَا قَالَ فَقَالَ لَهُ رُدَّهُمْ إِلَيَّ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ .",
					"english": "Ali, from his father, from one of his companions, from Asim Bin Humey, from Muhammad Bin Qays, <br>(It has been narrated) from Abu Ja’far (asws) having said: ‘A Prophet (as) from the Prophets (as) complained to his (as) Lord (azwj): ‘How can I (as) judge in the matters and I (as) am not informed of its proofs?’ So He (azwj) Said to him (as): “Refer them to Me (azwj), and add them to My (azwj) Name to swear by”."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي كِتَابِ عَلِيٍّ ( صلوات الله عليه ) أَنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ الْقَضَاءَ فَقَالَ كَيْفَ أَقْضِي بِمَا لَمْ تَرَ عَيْنِي وَ لَمْ تَسْمَعْ أُذُنِي فَقَالَ اقْضِ بَيْنَهُمْ بِالْبَيِّنَاتِ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ<br>وَ قَالَ إِنَّ دَاوُدَ ( عليه السلام ) قَالَ يَا رَبِّ أَرِنِي الْحَقَّ كَمَا هُوَ عِنْدَكَ حَتَّى أَقْضِيَ بِهِ فَقَالَ إِنَّكَ لَا تُطِيقُ ذَلِكَ فَأَلَحَّ عَلَى رَبِّهِ حَتَّى فَعَلَ<br>فَجَاءَهُ رَجُلٌ يَسْتَعْدِي عَلَى رَجُلٍ فَقَالَ إِنَّ هَذَا أَخَذَ مَالِي فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) أَنَّ هَذَا الْمُسْتَعْدِيَ قَتَلَ أَبَا هَذَا وَ أَخَذَ مَالَهُ فَأَمَرَ دَاوُدُ ( عليه السلام ) بِالْمُسْتَعْدِي فَقُتِلَ وَ أَخَذَ مَالَهُ فَدَفَعَهُ إِلَى الْمُسْتَعْدَى عَلَيْهِ<br>قَالَ فَعَجِبَ النَّاسُ وَ تَحَدَّثُوا حَتَّى بَلَغَ دَاوُدَ ( عليه السلام ) وَ دَخَلَ عَلَيْهِ مِنْ ذَلِكَ مَا كَرِهَ فَدَعَا رَبَّهُ أَنْ يَرْفَعَ ذَلِكَ فَفَعَلَ ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ احْكُمْ بَيْنَهُمْ بِالْبَيِّنَاتِ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ .",
					"english": "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Aban Bin Usman, from the one who informed him, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘In the book of Ali (asws), a Prophet (as) from the Prophets (as) complained to his (as) Lord (azwj) about the adjudication. So he (as) said: ‘How can I (as) judge with I (as) did not see with my (as) own eyes, and did not hear with my (as) own ears?’ So He (azwj) Said: “Judge between them by the proofs, and add them to My (azwj) Name to swear by”.<br>And he (asws) said: ‘Dawood (as) said: ‘O Lord (azwj)! Show me (as) the truth, just as it is with You (azwj), until I (as) judge by it’. So He (azwj) Said: “You (as) will not be able to tolerate that”. But he (as) kept insisting to his (as) Lord (azwj) until He (azwj) did it.<br>So a man came claiming upon a man, and he said, ‘This one took my wealth’. So Allah (azwj) Mighty and Majestic Revealed unto Dawood (as) that this one, the claimant, killed the father of this one and took his wealth”. So Dawood (as) ordered for the claimant to be killed, and he (as) took his wealth and handed it over to the defendant.<br>He (asws) said: ‘So the people wondered and they discussed it until (their discussion) reached Dawood (as), and there entered into him (as) what he (as) disliked. So he (as) supplicated to his (as) Lord (azwj) that He (azwj) should Lift that (from him (as)). So He (azwj) did it. Then Allah (azwj) Mighty and Majestic Revealed unto him (as) that “Judge between them by the proofs, and add them to My (azwj) Name to swear by”."
				},
				{
					"arabic": "وَ عَنْهُ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) أَنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ فَقَالَ يَا رَبِّ كَيْفَ أَقْضِي فِيمَا لَمْ أَشْهَدْ وَ لَمْ أَرَ قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ احْكُمْ بَيْنَهُمْ بِكِتَابِي وَ أَضِفْهُمْ إِلَى اسْمِي فَحَلِّفْهُمْ بِهِ<br>وَ قَالَ هَذَا لِمَنْ لَمْ تَقُمْ لَهُ بَيِّنَةٌ .",
					"english": "And from him, from Al Nazar Bin Suweyd, from Hisham Bin Salim, from Suleyman, Bin Khalid, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘In the Book of Ali (asws), a Prophet (as) from the Prophets (as) complained to his (as) Lord (azwj), so he (as) said: ‘O Lord (azwj)! How can I (as) judge with regards to what I (as) did not witness and did not see?’ So Allah (azwj) Mighty and Majestic Revealed unto him (as): “Judge between them by My (azwj) Book, and add them to My (azwj) Name, so get them to swear by it’.<br>And he (asws) said: ‘This is for the one for him the proof cannot be established’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ جَمِيلٍ وَ هِشَامٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْبَيِّنَةُ عَلَى مَنِ ادَّعَى وَ الْيَمِينُ عَلَى مَنِ ادُّعِيَ عَلَيْهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, from Jameel and Hisham, <br>Abu Abdullah (asws) has said: ‘Rasool-Allah (saww) said: ‘The (burden of) proof is upon the one who claims, and the (swearing of) the oath is upon the one who is claimed against (defendant)’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ حَكَمَ فِي دِمَائِكُمْ بِغَيْرِ مَا حَكَمَ بِهِ فِي أَمْوَالِكُمْ حَكَمَ فِي أَمْوَالِكُمْ أَنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ وَ حَكَمَ فِي دِمَائِكُمْ أَنَّ الْبَيِّنَةَ عَلَى مَنِ ادُّعِيَ عَلَيْهِ وَ الْيَمِينَ عَلَى مَنِ ادَّعَى لِكَيْلَا يَبْطُلَ دَمُ امْرِئٍ مُسْلِمٍ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdullah Bin Bukeyr, from Abu Baseer, <br>Abu Abdullah (asws) has said: ‘Allah (azwj) Judged regarding your blood with other than what He (azwj) Judged by regarding your wealth. A judgement regarding your wealth is that the (burden of) the proof is upon the claimant, and the (swearing of) the oath is upon the defendant; and a Judgement regarding your blood is that the (burden of) the proof is upon the defendant, and the (swearing of) the oath is upon the one who claims, lest the blood of a Muslim person be invalidated’."
				}
			],
			[
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يَاسِينَ الضَّرِيرِ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ قَالَ قُلْتُ لِلشَّيْخِ ( عليه السلام ) خَبِّرْنِي عَنِ الرَّجُلِ يَدَّعِي قِبَلَ الرَّجُلِ الْحَقَّ فَلَا يَكُونُ لَهُ بَيِّنَةٌ بِمَا لَهُ قَالَ فَيَمِينُ الْمُدَّعَى عَلَيْهِ فَإِنْ حَلَفَ فَلَا حَقَّ لَهُ وَ إِنْ لَمْ يَحْلِفْ فَعَلَيْهِ<br>وَ إِنْ كَانَ الْمَطْلُوبُ بِالْحَقِّ قَدْ مَاتَ فَأُقِيمَتْ عَلَيْهِ الْبَيِّنَةُ فَعَلَى الْمُدَّعِي الْيَمِينُ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَقَدْ مَاتَ فُلَانٌ وَ إِنَّ حَقَّهُ لَعَلَيْهِ فَإِنْ حَلَفَ وَ إِلَّا فَلَا حَقَّ لَهُ لِأَنَّا لَا نَدْرِي لَعَلَّهُ قَدْ أَوْفَاهُ بِبَيِّنَةٍ لَا نَعْلَمُ مَوْضِعَهَا أَوْ بِغَيْرِ بَيِّنَةٍ قَبْلَ الْمَوْتِ<br>فَمِنْ ثَمَّ صَارَتْ عَلَيْهِ الْيَمِينُ مَعَ الْبَيِّنَةِ فَإِنِ ادَّعَى بِلَا بَيِّنَةٍ فَلَا حَقَّ لَهُ لِأَنَّ الْمُدَّعَى عَلَيْهِ لَيْسَ بِحَيٍّ وَ لَوْ كَانَ حَيّاً لَأُلْزِمَ الْيَمِينَ أَوِ الْحَقَّ أَوْ يَرُدُّ الْيَمِينَ عَلَيْهِ فَمِنْ ثَمَّ لَمْ يَثْبُتْ لَهُ الْحَقُّ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa Bin Ubeyd, from Yaseen Al Zareyr, from Abdul Rahman Bin Abu Abdullah who said, <br>‘I said to the Sheykh (asws), ‘Inform me about the man who claims upon a man for the right, but there does not happen to a proof for him with what is for him’. He (asws) said: ‘The defendant would swear an oath. So if he were to swear then there is no right for him (the claimant), and if he does not swear, so it is upon him (to pay). <br>And if the one sought with the right (defendant) had died, so the proof would be established against him, therefore it would be upon the claimant to swear an oath by Allah (azwj), the One, besides Whom there is no god except for Him (azwj), that so and so has died and that the right is for him (his right is due on him). So if he were to swear, (fine) or else there is no right for him, because we do not know that perhaps he (the deceased) has fulfilled it (the debt) with the proof which is not known, nor do we know its place, or with other proof before the (occurrence) death.<br>Thus, from then the (swearing of) the oath came to be upon him (the claimant), along with the (burden of) the proof. So if he were to claim without proof, so there is no right for him, because the defendant is not alive, and had he been alive, the (swearing of) the oath would be necessitated, or the (payment of the) right, or turning of the (swearing of the) oath upon him (the claimant). Thus, from then, his right is not proved’."
				}
			],
			[
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يَدَّعِي وَ لَا بَيِّنَةَ لَهُ قَالَ يَسْتَحْلِفُهُ فَإِنْ رَدَّ الْيَمِينَ عَلَى صَاحِبِ الْحَقِّ فَلَمْ يَحْلِفْ فَلَا حَقَّ لَهُ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala, from Muhammad Bin Muslim, <br>(It has been narrated) from one of the two (5 (th) or 6 (th) Imam (asws)) regarding the man who claimed and there was no proof for him. He (asws) said: ‘He (defendant) would have to swear an oath, so if he were to turn the oath upon the owner of the right, and he does not swear, so there is no right for him’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُدَّعَى عَلَيْهِ الْحَقُّ وَ لَا بَيِّنَةَ لِلْمُدَّعِي قَالَ يُسْتَحْلَفُ أَوْ يَرُدَّ الْيَمِينَ عَلَى صَاحِبِ الْحَقِّ فَإِنْ لَمْ يَفْعَلْ فَلَا حَقَّ لَهُ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Ubeyd Bin Zurara, <br>(It has been narrated) from Abu Abdullah (asws) regarding the man who is claimed against (defendant), and there is no proof for the claimant. He (asws) said: ‘Either he swears an oath or he turns the oath to be upon the owner of the right. So if he does not do it, so there is no right for him’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَمَّنْ رَوَاهُ قَالَ اسْتِخْرَاجُ الْحُقُوقِ بِأَرْبَعَةِ وُجُوهٍ بِشَهَادَةِ رَجُلَيْنِ عَدْلَيْنِ فَإِنْ لَمْ يَكُنْ رَجُلَيْنِ عَدْلَيْنِ فَرَجُلٌ وَ امْرَأَتَانِ فَإِنْ لَمْ تَكُنِ امْرَأَتَانِ فَرَجُلٌ وَ يَمِينُ الْمُدَّعِي فَإِنْ لَمْ يَكُنْ شَاهِدٌ فَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ فَإِنْ لَمْ يَحْلِفْ [وَ] رَدَّ الْيَمِينَ عَلَى الْمُدَّعِي فَهُوَ وَاجِبٌ عَلَيْهِ أَنْ يَحْلِفَ وَ يَأْخُذَ حَقَّهُ فَإِنْ أَبَى أَنْ يَحْلِفَ فَلَا شَيْ‏ءَ لَهُ .",
					"english": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from the one who reported it, <br>He (asws) said, ‘The extraction of the rights is by four ways – by the testimony of two just men; so if there do not happen to be two just men, so one man and two women. So if there do not happen to be two women, so a man and an oath of the claimant. So if there does not happen to be a witness, so the swearing of the oath is upon the defendant. So if he were not to swear, and return the oath upon the claimant, so it is obligatory upon him that he swears, and takes his right. But if he refuses to swear, so there is nothing for him’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُدَّعَى عَلَيْهِ الْحَقُّ وَ لَيْسَ لِصَاحِبِ الْحَقِّ بَيِّنَةٌ قَالَ يُسْتَحْلَفُ الْمُدَّعَى عَلَيْهِ فَإِنْ أَبَى أَنْ يَحْلِفَ وَ قَالَ أَنَا أَرُدُّ الْيَمِينَ عَلَيْكَ لِصَاحِبِ الْحَقِّ فَإِنَّ ذَلِكَ وَاجِبٌ عَلَى صَاحِبِ الْحَقِّ أَنْ يَحْلِفَ وَ يَأْخُذَ مَالَهُ .",
					"english": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from one of his companions, from Aban, from a man, <br>(It has been narrated) from Abu Abdullah (asws) regarding the man who is claimed against (defendant) for the right, and there is no proof for the owner of the right. He (asws) said: ‘The defendant would swear an oath. So if he refuses to swear and says, ‘I turn the swearing of the oath upon you’, to the owner of the right, so that would be obligatory upon the owner of the right that he swears, and takes his wealth’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُرَدُّ الْيَمِينُ عَلَى الْمُدَّعِي .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The swearing would be turned upon the claimant’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّجُلِ يُقِيمُ الْبَيِّنَةَ عَلَى حَقِّهِ هَلْ عَلَيْهِ أَنْ يُسْتَحْلَفَ قَالَ لَا .",
					"english": "Ali Bin Ibrahim, from his father, from one of his companions, from Aasim Bin Humeyd, from Muhammad Bin Muslim who said, <br>‘I asked Abu Ja’far (asws) about the man who establishes the proof upon his right, is there upon him that he should be swearing an oath?’ He (asws) said: ‘No’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ أَوْ غَيْرِهِ عَنْ أَبَانٍ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَقَامَ الرَّجُلُ الْبَيِّنَةَ عَلَى حَقِّهِ فَلَيْسَ عَلَيْهِ يَمِينٌ فَإِنْ لَمْ يُقِمِ الْبَيِّنَةَ فَرَدَّ عَلَيْهِ الَّذِي ادُّعِيَ عَلَيْهِ الْيَمِينَ فَإِنْ أَبَى أَنْ يَحْلِفَ فَلَا حَقَّ لَهُ .<br>عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبَانٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, or someone else, from Aban, from Abu Al Abbas, <br>Abu Abdullah (asws) has said: ‘When the man establishes the proof upon his right, so there is no swearing of an oath upon him. So if there does not happen to be the proof, so the defendant turns the swearing upon him (the claimant). So if he were to refuse, so there is no right for him’.<br>Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Aban, from a man, <br>(It has been narrated) from Abu Abdullah (asws) – similar to it’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ مُوسَى بْنِ أُكَيْلٍ النُّمَيْرِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا رَضِيَ صَاحِبُ الْحَقِّ بِيَمِينِ الْمُنْكِرِ لِحَقِّهِ فَاسْتَحْلَفَهُ فَحَلَفَ أَنْ لَا حَقَّ لَهُ قِبَلَهُ ذَهَبَتِ الْيَمِينُ بِحَقِّ الْمُدَّعِي فَلَا دَعْوَى لَهُ<br>قُلْتُ لَهُ وَ إِنْ كَانَتْ عَلَيْهِ بَيِّنَةٌ عَادِلَةٌ قَالَ نَعَمْ وَ إِنْ أَقَامَ بَعْدَ مَا اسْتَحْلَفَهُ بِاللَّهِ خَمْسِينَ قَسَامَةً مَا كَانَ لَهُ وَ كَانَتِ الْيَمِينُ قَدْ أَبْطَلَتْ كُلَّ مَا ادَّعَاهُ قَبْلَهُ مِمَّا قَدِ اسْتَحْلَفَهُ عَلَيْهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Fazal, from Ali Bin Uqba, from Musa Bin Akeyl Al Numeyri, from Ibn Abu Yafour, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘When the owner of the right is happy with the oath which would deny him his right, so the (defendant) swears an oath that there is no right for him (the claimant), the swearing does away with the right of the claimant, so there is no claim for him’.<br>I said to him (asws), ‘And if there was just proof over it?’ He (asws) said: ‘Yes, even if he were to establish after what has been sworn by Allah (azwj), sworn endorsements of fifty (men), it would not be for him, and the oath would have invalidated everything what he had claimed for before it, from what has been oathed against him’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ خَضِرٍ النَّخَعِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ الْمَالُ فَيَجْحَدُهُ قَالَ إِنِ اسْتَحْلَفَهُ فَلَيْسَ لَهُ أَنْ يَأْخُذَ شَيْئاً وَ إِنْ تَرَكَهُ وَ لَمْ يَسْتَحْلِفْهُ فَهُوَ عَلَى حَقِّهِ .",
					"english": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from AL Fazl Bin Shazaan, both together from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Khazar Al Nakhai’e, <br>(It has been narrated) from Abu Abdullah (asws) regarding the man who happened to have wealth for him over the man, but he argued it (disputed it). He (asws) said: ‘If he (the defendant) were to swear, so it is not for him (the claimant) that he should take anything, and if he (the defendant) leaves it and does not swear, so he (the claimant) is upon his right’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ بَعْضِ أَصْحَابِهِ فِي الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ الْمَالُ فَيَجْحَدُهُ فَيَحْلِفُ لَهُ يَمِينَ صَبْرٍ أَ لَهُ عَلَيْهِ شَيْ‏ءٌ قَالَ لَيْسَ لَهُ أَنْ يَطْلُبَ مِنْهُ وَ كَذَلِكَ إِنِ احْتَسَبَهُ عِنْدَ اللَّهِ فَلَيْسَ لَهُ أَنْ يَطْلُبَهُ مِنْهُ .",
					"english": "Ali, from his father, from Abdul Rahman Bin Hammad, from Ibrahim Bin Abdul Hameed, <br>(It has been narrated) from one of his companions regarding the man who happened to have some wealth for him upon the man, but he (defendant) argued it, so he swore an oath. Should he (claimant) be patient or is there anything upon him’. He (asws) said: ‘It is not for him that he should seek from it, and similar to that if he were to Reckon it with Allah (azwj) (waives it), so it is not for him that he should seek it from him’."
				}
			],
			[
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ شُعَيْبٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَأْتِي الْقَوْمَ فَيَدَّعِي دَاراً فِي أَيْدِيهِمْ وَ يُقِيمُ الَّذِي فِي يَدِهِ الدَّارُ الْبَيِّنَةَ أَنَّهُ وَرِثَهَا عَنْ أَبِيهِ وَ لَا يَدْرِي كَيْفَ كَانَ أَمْرُهَا فَقَالَ أَكْثَرُهُمْ بَيِّنَةً يُسْتَحْلَفُ وَ يُدْفَعُ إِلَيْهِ<br>وَ ذَكَرَ أَنَّ عَلِيّاً ( عليه السلام ) أَتَاهُ قَوْمٌ يَخْتَصِمُونَ فِي بَغْلَةٍ فَقَامَتِ الْبَيِّنَةُ لِهَؤُلَاءِ أَنَّهُمْ أَنْتَجُوهَا عَلَى مِذْوَدِهِمْ وَ لَمْ يَبِيعُوا وَ لَمْ يَهَبُوا وَ أَقَامَ هَؤُلَاءِ الْبَيِّنَةَ أَنَّهُمْ أَنْتَجُوهَا عَلَى مِذْوَدِهِمْ لَمْ يَبِيعُوا وَ لَمْ يَهَبُوا فَقَضَى بِهَا لِأَكْثَرِهِمْ بَيِّنَةً وَ اسْتَحْلَفَهُمْ<br>قَالَ فَسَأَلْتُهُ حِينَئِذٍ فَقُلْتُ أَ رَأَيْتَ إِنْ كَانَ الَّذِي ادَّعَى الدَّارَ فَقَالَ إِنَّ أَبَا هَذَا الَّذِي هُوَ فِيهَا أَخَذَهَا بِغَيْرِ ثَمَنٍ وَ لَمْ يُقِمِ الَّذِي هُوَ فِيهَا بَيِّنَةً إِلَّا أَنَّهُ وَرِثَهَا عَنْ أَبِيهِ قَالَ إِذَا كَانَ أَمْرُهَا هَكَذَا فَهِيَ لِلَّذِي ادَّعَاهَا وَ أَقَامَ الْبَيِّنَةَ عَلَيْهَا .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Shuayb, from Abu Baseer who said, <br>‘I asked Abu Abdullah (asws) about the man who came to a group of people and claimed for a house which was in their hands, and the one in whose hand was the house established the proof and he had inherited it from his father, and it is not known how was his matter’. So he (asws) said: ‘The one with the most proof would have to swear an oath, and it would be handed over to him’.<br>And he (asws) mentioned that they came to Ali (asws) with a group of people disputing regarding a mule. So the proof was established for these ones that they had bred it in their stable, and neither had they sold it nor had they gifted it; and those ones established the proof that they had bred it in their stable, and neither had they sold it nor gifted it. So he (asws) judged by it based upon the one with the most proof, and made them swear an oath’.<br>He (the narrator) said, ‘So I asked him (asws) at that time, ‘What is your view that there was one who claimed for the house?’ So he (asws) said: ‘If the father of the one who was (living) in it acquired it without a price and the one who was in it cannot establish (proof) except that he had inherited it from his father?’ He (asws) said: ‘If it was like that, so it is for the one who claims it and establishes the proof for it’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْخَشَّابِ عَنْ غِيَاثِ بْنِ كَلُّوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِي دَابَّةٍ فِي أَيْدِيهِمَا وَ أَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ أَنَّهَا نُتِجَتْ عِنْدَهُ فَأَحْلَفَهُمَا عَلِيٌّ ( عليه السلام ) فَحَلَفَ أَحَدُهُمَا وَ أَبَى الْآخَرُ أَنْ يَحْلِفَ فَقَضَى بِهَا لِلْحَالِفِ<br>فَقِيلَ لَهُ فَلَوْ لَمْ تَكُنْ فِي يَدِ وَاحِدٍ مِنْهُمَا وَ أَقَامَا الْبَيِّنَةَ قَالَ أُحْلِفُهُمَا فَأَيُّهُمَا حَلَفَ وَ نَكَلَ الْآخَرُ جَعَلْتُهَا لِلْحَالِفِ فَإِنْ حَلَفَا جَمِيعاً جَعَلْتُهَا بَيْنَهُمَا نِصْفَيْنِ قِيلَ فَإِنْ كَانَتْ فِي يَدِ أَحَدِهِمَا وَ أَقَامَا جَمِيعاً الْبَيِّنَةَ قَالَ أَقْضِي بِهَا لِلْحَالِفِ الَّذِي هِيَ فِي يَدِهِ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Khashab, from Gayas Bin Kuleyb, from Is’haq Bin Ammar, <br>(It has been narrated) from Abu Abdullah (asws) that two men disputed to Amir Al-Momineen (asws) regarding an animal which was in both their hands, and each one of them established the proof that he had bred it in his presence. So Ali (azwj) made both of them to swear an oath. So one of them swore and the other one refuse to swear. So due to it he (asws) judged for the one who swore the oath.<br>So it was said to him (asws), ‘Supposing it was not in the hand of any one of them and they both established the proof?’ He (asws) said: ‘They would both have to swear an oath. So whichever of the two swear, and the other one shirks from it, it would be made to be for the one who swore. So if both of them were to swear, it would be made to be for both of them together, (its price) in two halves’. So if it was in the hands of one of the two and they both establish the proof?’ He (asws) said: ‘I (asws) would judge by it to be for the one who swears in whose hand it is’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيٌّ ( عليه السلام ) إِذَا أَتَاهُ رَجُلَانِ بِشُهُودٍ عَدْلُهُمْ سَوَاءٌ وَ عَدَدُهُمْ أَقْرَعَ بَيْنَهُمْ عَلَى أَيِّهِمْ تَصِيرُ الْيَمِينُ قَالَ وَ كَانَ يَقُولُ اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ أَيُّهُمْ كَانَ لَهُ الْحَقُّ فَأَدِّهِ إِلَيْهِ ثُمَّ يَجْعَلُ الْحَقَّ لِلَّذِي تَصِيرُ إِلَيْهِ الْيَمِينُ إِذَا حَلَفَ .",
					"english": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa, from Aban, from Abdul Rahman Bin Abu Abdullah, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Whenever they came to Ali (asws) with two men with witnesses equal in being just and in number, he (asws) would draw a lot upon whichever the oath would come to be. And he (asws) would be saying: ‘O Allah (azwj), Lord (azwj) of the seven skies! For whomever the right was, so Make it to be for him’. Then he (asws) would make the right to be for the one to whom it (the lot) came to be, when he swore an oath’."
				},
				{
					"arabic": "عَنْهُ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ دَاوُدَ بْنِ سِرْحَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَاهِدَيْنِ شَهِدَا عَلَى أَمْرٍ وَاحِدٍ وَ جَاءَ آخَرَانِ فَشَهِدَا عَلَى غَيْرِ الَّذِي شَهِدَا وَ اخْتَلَفُوا قَالَ يُقْرَعُ بَيْنَهُمْ فَأَيُّهُمْ قُرِعَ عَلَيْهِ الْيَمِينُ فَهُوَ أَوْلَى بِالْقَضَاءِ .",
					"english": "From him, from Moala Bin Muhammad, from Al Washa, from Dawood Bin Sirham, <br>(It has been narrated) from Abu Abdullah (asws) regarding two witnesses who testified upon one matter and two others came over, so they testified upon other than which they had testified, and they differed. He (asws) said: ‘Lots would be drawn between them, so whoever the lot comes out to for the swearing of the oath, so he would be the first to be judged for’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ أَنَّ رَجُلَيْنِ عَرَفَا بَعِيراً فَأَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا بَيِّنَةً فَجَعَلَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَيْنَهُمَا .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abu Jameela, from Simak Bin Harb, from Tameem Bin Tarafa, <br>‘Two men recognised a camel, so each one of the two established the proof. So Amir Al-Momineen (asws) made it to be between both of them (equally)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) اخْتَصَمَ إِلَيْهِ رَجُلَانِ فِي دَابَّةٍ وَ كِلَاهُمَا أَقَامَ الْبَيِّنَةَ أَنَّهُ أَنْتَجَهَا فَقَضَى بِهَا لِلَّذِي هِيَ فِي يَدِهِ وَ قَالَ لَوْ لَمْ تَكُنْ فِي يَدِهِ جَعَلْتُهَا بَيْنَهُمَا نِصْفَيْنِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, <br>(It has been narrated) from Abu Abdullah (asws) that Amir Al-Momineen (asws) (judged between) two men disputed to him regarding an animal, and each of the two established the proof that he had bred it. So he (asws) judged by it to be for the one in whose hand it was, and said, ‘And had it not been in his hand, I (asws) would have made it (price) to be between both of them in two halves’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُثَنًّى الْحَنَّاطِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ شَهِدَ لَهُ رَجُلَانِ بِأَنَّ لَهُ عِنْدَ رَجُلٍ خَمْسِينَ دِرْهَماً وَ جَاءَ آخَرَانِ فَشَهِدَا بِأَنَّ لَهُ عِنْدَهُ مِائَةَ دِرْهَمٍ كُلُّهُمْ شَهِدُوا فِي مَوْقِفٍ قَالَ أَقْرِعْ بَيْنَهُمْ ثُمَّ اسْتَحْلِفِ الَّذِينَ أَصَابَهُمُ الْقَرْعُ بِاللَّهِ أَنَّهُمْ يَحْلِفُونَ بِالْحَقِّ .",
					"english": "Ali Bin Ibrahim, from his father, from one of our companions, from Musny Al Hannat, from Zurara, <br>(It has been narrated) from Abu Ja’far (asws), said, ‘I said to him (asws), ‘Two witnesses testified for a man that there were fifty Dirhams with a man, and two others came and testified that there was for him one hundred Dirhams, all of them having testified in one standing’. He (asws) said: ‘Lots would be drawn between them, then the ones for whom the lot came would swear an oath by Allah (azwj) that they are swearing with the truth’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ الْعَطَّارِ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ كَانَتْ لَهُ امْرَأَةٌ فَجَاءَ رَجُلٌ بِشُهُودٍ أَنَّ هَذِهِ الْمَرْأَةَ امْرَأَةُ فُلَانٍ وَ جَاءَ آخَرُونَ فَشَهِدُوا أَنَّهَا امْرَأَةُ فُلَانٍ فَاعْتَدَلَ الشُّهُودُ وَ عُدِّلُوا قَالَ يُقْرَعُ بَيْنَ الشُّهُودِ فَمَنْ خَرَجَ سَهْمُهُ فَهُوَ الْمُحِقُّ وَ هُوَ أَوْلَى بِهَا .",
					"english": "Ali, from his father, from Ibn Fazzal, from Dawood Bin Abu Yazeed Al Attar, from one of his men, <br>(It has been narrated) from Abu Abdullah (asws) regarding a man for whom was a wife. So a man came over with witnesses that this woman is the wife of so and so, and others came over and testified that she is the wife of so and so. So the witnesses were all just’. He (asws) said: ‘A lot would be drawn between the witnesses, for the one for whom the lot comes out, so he is the rightful, and he would be the first (to have the right) with it’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ جَارِيَةٍ لَمْ تُدْرِكْ بِنْتِ سَبْعِ سِنِينَ مَعَ رَجُلٍ وَ امْرَأَةٍ ادَّعَى الرَّجُلُ أَنَّهَا مَمْلُوكَةٌ لَهُ وَ ادَّعَتِ الْمَرْأَةُ أَنَّهَا ابْنَتُهَا فَقَالَ قَدْ قَضَى فِي هَذَا عَلِيٌّ ( عليه السلام ) قُلْتُ وَ مَا قَضَى فِي هَذَا عَلِيٌّ ( عليه السلام ) قَالَ كَانَ يَقُولُ النَّاسُ كُلُّهُمْ أَحْرَارٌ إِلَّا مَنْ أَقَرَّ عَلَى نَفْسِهِ بِالرِّقِّ وَ هُوَ مُدْرِكٌ وَ مَنْ أَقَامَ بَيِّنَةً عَلَى مَنِ ادَّعَى مِنْ عَبْدٍ أَوْ أَمَةٍ فَإِنَّهُ يُدْفَعُ إِلَيْهِ يَكُونُ لَهُ رِقّاً قُلْتُ فَمَا تَرَى أَنْتَ قَالَ أَرَى أَنْ أَسْأَلَ الَّذِي ادَّعَى أَنَّهَا مَمْلُوكَةٌ لَهُ عَلَى مَا ادَّعَى<br>فَإِنْ أَحْضَرَ شُهُوداً يَشْهَدُونَ أَنَّهَا مَمْلُوكَةٌ لَهُ لَا يَعْلَمُونَهُ بَاعَ وَ لَا وَهَبَ دَفَعْتُ الْجَارِيَةَ إِلَيْهِ حَتَّى تُقِيمَ الْمَرْأَةُ مَنْ يَشْهَدُ لَهَا أَنَّ الْجَارِيَةَ ابْنَتُهَا حُرَّةٌ مِثْلُهَا فَلْتُدْفَعْ إِلَيْهَا وَ تُخْرَجُ مِنْ يَدِ الرَّجُلِ<br>قُلْتُ فَإِنْ لَمْ يُقِمِ الرَّجُلُ شُهُوداً أَنَّهَا مَمْلُوكَةٌ لَهُ قَالَ تُخْرَجُ مِنْ يَدِهِ فَإِنْ أَقَامَتِ الْمَرْأَةُ الْبَيِّنَةَ عَلَى أَنَّهَا ابْنَتُهَا دُفِعَتْ إِلَيْهَا وَ إِنْ لَمْ يُقِمِ الرَّجُلُ الْبَيِّنَةَ عَلَى مَا ادَّعَاهُ وَ لَمْ تُقِمِ الْمَرْأَةُ الْبَيِّنَةَ عَلَى مَا ادَّعَتْ خُلِّيَ سَبِيلُ الْجَارِيَةِ تَذْهَبُ حَيْثُ شَاءَتْ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, form his father, both together from Ibn Mahboub, from Ibn Ra’ib, from Humran Bin Ayn who said, <br>‘I asked Abu Ja’far (asws) about a slave girl who has yet to become aware (attain adulthood), being a girl seven years of age who was with a man and a woman. The man claimed that she was his owned slave girl, and the woman claimed that she was her daughter. So he (asws) said: ‘Ali (asws) had judged with regard to this’. I said, ‘And what did Ali (asws) judge regarding this?’ He (asws) said: ‘He (asws) was saying: ‘All the people are free, except for the one who confesses upon himself with the slavery, and he is an adult, and the one upon whom the proof is established by the one who claims.<br>So if witnesses are testifying that she is an owned slave girl of his, and it is not know her being sold or gifted, so I (asws) would hand over the slave girl to him, until the woman establishes one who testifies for her that the slave girl is her daughter, free like her. So she should be handed over to her, and be taken out from the hand of the man’.<br>I said, ‘So if the man does not establish witness that she is an owned slave girls of his?’ He (asws) said: ‘She would be taken out from his hand. So if the woman establishes the proof upon that she is her daughter, she would be handed over to her. And if the man does not establish the proof upon what he claims, and the woman does not establish the proof upon what she claims, the way of the slave girl would be left open. She can go wherever she so desires to’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ دَاوُدَ ( عليه السلام ) سَأَلَ رَبَّهُ أَنْ يُرِيَهُ قَضِيَّةً مِنْ قَضَايَا الْآخِرَةِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا دَاوُدُ أَنَّ الَّذِي سَأَلْتَنِي لَمْ أُطْلِعْ عَلَيْهِ أَحَداً مِنْ خَلْقِي وَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَقْضِيَ بِهِ غَيْرِي<br>قَالَ فَلَمْ يَمْنَعْهُ ذَلِكَ أَنْ عَادَ فَسَأَلَ اللَّهَ أَنْ يُرِيَهُ قَضِيَّةً مِنْ قَضَايَا الْآخِرَةِ قَالَ فَأَتَاهُ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ لَهُ يَا دَاوُدُ لَقَدْ سَأَلْتَ رَبَّكَ شَيْئاً لَمْ يَسْأَلْهُ قَبْلَكَ نَبِيٌّ يَا دَاوُدُ إِنَّ الَّذِي سَأَلْتَ لَمْ يُطْلِعْ عَلَيْهِ أَحَداً مِنْ خَلْقِهِ وَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَقْضِيَ بِهِ غَيْرَهُ قَدْ أَجَابَ اللَّهُ دَعْوَتَكَ وَ أَعْطَاكَ مَا سَأَلْتَ يَا دَاوُدُ إِنَّ أَوَّلَ خَصْمَيْنِ يَرِدَانِ عَلَيْكَ غَداً الْقَضِيَّةُ فِيهِمَا مِنْ قَضَايَا الْآخِرَةِ<br>قَالَ فَلَمَّا أَصْبَحَ دَاوُدُ ( عليه السلام ) جَلَسَ فِي مَجْلِسِ الْقَضَاءِ أَتَاهُ شَيْخٌ مُتَعَلِّقٌ بِشَابٍّ وَ مَعَ الشَّابِّ عُنْقُودٌ مِنْ عِنَبٍ فَقَالَ لَهُ الشَّيْخُ يَا نَبِيَّ اللَّهِ إِنَّ هَذَا الشَّابَّ دَخَلَ بُسْتَانِي وَ خَرَّبَ كَرْمِي وَ أَكَلَ مِنْهُ بِغَيْرِ إِذْنِي وَ هَذَا الْعُنْقُودُ أَخَذَهُ بِغَيْرِ إِذْنِي<br>فَقَالَ دَاوُدُ لِلشَّابِّ مَا تَقُولُ فَأَقَرَّ الشَّابُّ أَنَّهُ قَدْ فَعَلَ ذَلِكَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا دَاوُدُ إِنِّي إِنْ كَشَفْتُ لَكَ عَنْ قَضَايَا الْآخِرَةِ فَقَضَيْتَ بِهَا بَيْنَ الشَّيْخِ وَ الْغُلَامِ<br>لَمْ يَحْتَمِلْهَا قَلْبُكَ وَ لَمْ يَرْضَ بِهَا قَوْمُكَ يَا دَاوُدُ إِنَّ هَذَا الشَّيْخَ اقْتَحَمَ عَلَى أَبِي هَذَا الْغُلَامِ فِي بُسْتَانِهِ فَقَتَلَهُ وَ غَصَبَ بُسْتَانَهُ وَ أَخَذَ مِنْهُ أَرْبَعِينَ أَلْفَ دِرْهَمٍ فَدَفَنَهَا فِي جَانِبِ بُسْتَانِهِ فَادْفَعْ إِلَى الشَّابِّ سَيْفاً وَ مُرْهُ أَنْ يَضْرِبَ عُنُقَ الشَّيْخِ وَ ادْفَعْ إِلَيْهِ الْبُسْتَانَ وَ مُرْهُ أَنْ يَحْفِرَ فِي مَوْضِعِ كَذَا وَ كَذَا وَ يَأْخُذَ مَالَهُ<br>قَالَ فَفَزِعَ مِنْ ذَلِكَ دَاوُدُ ( عليه السلام ) وَ جَمَعَ إِلَيْهِ عُلَمَاءَ أَصْحَابِهِ وَ أَخْبَرَهُمُ الْخَبَرَ وَ أَمْضَى الْقَضِيَّةَ عَلَى مَا أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ .",
					"english": "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abu Hamza, <br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Dawood (as) asked his (as) Lord (azwj) that He (azwj) Show him (as) a Judgement from the Judgements of the Hereafter. So Allah (azwj) Mighty and Majestic Revealed unto him (as): “O Dawood (as)! That which you (as) have asked Me (azwj), no one from My (azwj) creatures has been notified of it, nor is it befitting for anyone that he judges by it, apart from Me (azwj)”.<br>He (asws) said: ‘So that did not prevent him (as) to repeat, so he (as) asked Allah (azwj) that He (azwj) Shows him (as) a Judgement from the Judgements of the Hereafter. So Jibraeel (as) came over to him (as) and said to him (as): ‘O Dawood (as)! You (as) have asked your (as) Lord (azwj) something which no Prophet (as) before you (as) has asked. O Dawood (as)! That which you asked, none from His (azwj) creatures has been notified with, nor is it befitting for anyone that he (as) judged by it, apart from Him (azwj). However, Allah (azwj) has Answered your (as) supplication, and has Granted you (as) what you (as) asked for. O Dawood (as)! The first two litigants who would intend to you tomorrow, judge regarding both of them from the Judgements of the Hereafter’.<br>He (asws) said: ‘So when it was the morning, Dawood (as) sat is his (as) judicial council. An old man came over to him concerning a youth, and with him was the youth with a bunch of grapes. So the old man said to him (as), ‘O Prophet (as) of Allah (azwj)! This youth entered my garden and spoilt my vineyard, and ate from it without my permission. And this is the bunch which he took without my permission’.<br>So Dawood (as) said to the youth: ‘What are you saying?’ So the youth confessed that he had done that. So Allah (azwj) Mighty and Majestic Revealed unto him (as): “O Dawood (as)! I (azwj) hereby Uncover for you (as) from the Judgements of the Hereafter. Therefore, judge by it between the old man and the boy.<br>Your (as) heart, (however) would not be able to bear it, and your (as) people would not be pleased with it. O Dawood (as)! This old man stormed upon the father of this boy in his garden, so he killed him, and usurped his garden, and seized forty thousand Dirhams from it. So he buried it by the side of his garden. So hand a sword to the youth and order him that he should strike the neck of the old man, and hand over the garden to him, and order him that he should dig in such and such a place and take his wealth”.<br>He (asws) said: ‘So Dawood (as) panicked from that and gathered to himself (as), his (as) scholars, and his (as) companions, and informed them of the news, and passed the Judgement upon what Allah (azwj) Mighty and Majestic had Revealed unto him (as)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ إِسْحَاقَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الرَّجُلِ يُبْضِعُهُ الرَّجُلُ ثَلَاثِينَ دِرْهَماً فِي ثَوْبٍ وَ آخَرُ عِشْرِينَ دِرْهَماً فِي ثَوْبٍ فَبَعَثَ بِالثَّوْبَيْنِ فَلَمْ يَعْرِفْ هَذَا ثَوْبَهُ وَ لَا هَذَا ثَوْبَهُ قَالَ يُبَاعُ الثَّوْبَانِ فَيُعْطَى صَاحِبُ الثَّلَاثِينَ ثَلَاثَةَ أَخْمَاسٍ الثَّمَنِ وَ الْآخَرُ خُمُسَيِ الثَّمَنِ قُلْتُ فَإِنَّ صَاحِبَ الْعِشْرِينَ قَالَ لِصَاحِبِ الثَّلَاثِينَ اخْتَرْ أَيَّهُمَا شِئْتَ قَالَ قَدْ أَنْصَفَهُ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Al Husayn Bin Abu Al A’la, from Is’haq, <br>(It has been narrated) from Abu Abdullah (asws) having said regarding the man who merged a thirty Dirham piece of cloth, with another man with twenty Dirhams piece of cloth. So the two parcels were sent, and it was not recognised whether this was his cloth, or this was not his cloth. He (asws) said: ‘So the two pieces of cloth would be sold, so the owner of the thirty would be given three-fifths of the price, and the other one would be given two-fifths of the price’. I said, ‘So if the owner of the twenty said to the owner of the thirty, ‘Choose whichever of the two you so desire to?’ He (asws) said: ‘He has been fair’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ أَبِي شُعَيْبٍ الْمَحَامِلِيِّ الرِّفَاعِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَبَّلَ رَجُلًا عَنْ حَفْرِ بِئْرٍ عَشْرَ قَامَاتٍ بِعَشَرَةِ دَرَاهِمَ فَحَفَرَ قَامَةً ثُمَّ عَجَزَ عَنْهَا فَقَالَ لَهُ جُزْءٌ مِنْ خَمْسَةٍ وَ خَمْسِينَ جُزْءاً مِنَ الْعَشَرَةِ دَرَاهِمَ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Abbas Bin Marouf, from Abu Shuayb Al Mahamily Al Rafaiy who said, <br>‘I asked Abu Abdullah (asws) about a man who accepted a man about digging of a well of a depth of ten statures for ten Dirhams. So he dug up to one stature then was frustrated from it (refused to dig further). So he (asws) said: ‘For him would be one part out of fifty-five parts from ten Dirhams’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي الْمُعَلَّى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بْنُ الْخَطَّابِ بِامْرَأَةٍ قَدْ تَعَلَّقَتْ بِرَجُلٍ مِنَ الْأَنْصَارِ وَ كَانَتْ تَهْوَاهُ وَ لَمْ تَقْدِرْ لَهُ عَلَى حِيلَةٍ فَذَهَبَتْ فَأَخَذَتْ بَيْضَةً فَأَخْرَجَتْ مِنْهَا الصُّفْرَةَ وَ صَبَّتِ الْبَيَاضَ عَلَى ثِيَابِهَا بَيْنَ فَخِذَيْهَا ثُمَّ جَاءَتْ إِلَى عُمَرَ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا الرَّجُلَ أَخَذَنِي فِي مَوْضِعِ كَذَا وَ كَذَا فَفَضَحَنِي<br>قَالَ فَهَمَّ عُمَرُ أَنْ يُعَاقِبَ الْأَنْصَارِيَّ فَجَعَلَ الْأَنْصَارِيُّ يَحْلِفُ وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) جَالِسٌ وَ يَقُولُ يَا أَمِيرَ الْمُؤْمِنِينَ تَثَبَّتْ فِي أَمْرِي فَلَمَّا أَكْثَرَ الْفَتَى قَالَ عُمَرُ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) يَا أَبَا الْحَسَنِ مَا تَرَى فَنَظَرَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى بَيَاضٍ عَلَى ثَوْبِ الْمَرْأَةِ وَ بَيْنَ فَخِذَيْهَا فَاتَّهَمَهَا أَنْ تَكُونَ احْتَالَتْ لِذَلِكَ فَقَالَ ائْتُونِي بِمَاءٍ حَارٍّ قَدْ أُغْلِيَ غَلَيَاناً شَدِيداً فَفَعَلُوا<br>فَلَمَّا أُتِيَ بِالْمَاءِ أَمَرَهُمْ فَصَبُّوا عَلَى مَوْضِعِ الْبَيَاضِ فَاشْتَوَى ذَلِكَ الْبَيَاضُ فَأَخَذَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَأَلْقَاهُ فِي فِيهِ فَلَمَّا عَرَفَ طَعْمَهُ أَلْقَاهُ مِنْ فِيهِ ثُمَّ أَقْبَلَ عَلَى الْمَرْأَةِ حَتَّى أَقَرَّتْ بِذَلِكَ وَ دَفَعَ اللَّهُ عَزَّ وَ جَلَّ عَنِ الْأَنْصَارِيِّ عُقُوبَةَ عُمَرَ .",
					"english": " (See Hadeeth below - Ch 17 H 22 for calculation)<br>Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Yazeed, from Abu Al Moala, <br>Abu Abdullah (asws) has said: ‘They came to Umar Bin Al-Khattab with a woman who had attached (her heart) to a man from the ‘الْأَنْصَارِيَّ’ (a local man of Medina), and had desired him, but she was not able to have a way to him. So she went (to him) and took and egg and extracted the yolk from it, and applied the albumen upon her clothes in between her thighs. Then she came over to Umar and said, ‘O commander of the faithful! This man has disgraced me in such and such a place, so he shamed (raped) me’.<br>So Umar understood that he should punish the ‘الْأَنْصَارِيَّ’ (a local man of Medina) Helper, so he made the Helper to swear an oath, and Amir Al-Momineen (asws) was seated, and he was saying, ‘O commander of the faithful, prove my matter’. So when the youth frequented it, Umar said to Amir Al-Momineen (asws), ‘O Abu Al-Hassan (asws)! What is your (asws) view’. So Amir Al-Momineen (asws) looked at the whiteness upon the clothes of the woman and between her thighs, so he (asws) accused her that she was defrauding with that. So he (asws) said: ‘Come to me with hot water which has boiled with intense boiling’. So they did it.<br>So when they came up with the water, he (asws) ordered them, so they splashed it upon the place of the whiteness. So that whiteness solidified. So Amir Al-Momineen (asws) took it and cast it in his (asws) mouth. So when he (asws) recognised its taste, he (asws) threw it out from his (asws) mouth. Then he (asws) faced towards the woman until she confessed with that, and Allah (azwj) Mighty and Majestic Defended the ‘الْأَنْصَارِيَّ’ (local resident of Medina) from the punishment of Umar’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ عَشَرَةٌ كَانُوا جُلُوساً وَ وَسْطَهُمْ كِيسٌ فِيهِ أَلْفُ دِرْهَمٍ فَسَأَلَ بَعْضُهُمْ بَعْضاً أَ لَكُمْ هَذَا الْكِيسُ فَقَالُوا كُلُّهُمْ لَا وَ قَالَ وَاحِدٌ مِنْهُمْ هُوَ لِي فَلِمَنْ هُوَ قَالَ لِلَّذِي ادَّعَاهُ .",
					"english": "Ali Bin Ibrahim, from his father, from one of his companions, from Mansour Bin Hazim, <br>(It has been narrated) from Abu Abdullah (asws), said, ‘I said, ‘Ten (people) were seated, and in the middle of them was a bag in which were a thousand Dirhams. So they asked each other, ‘Is this bag yours?’ So all of them said, ‘No’, and one of them said it is for him. So for whom is it?’ He (asws) said: ‘For the one who claimed it’."
				},
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ قَالَ حَدَّثَنِي أَبُو عِيسَى يُوسُفُ بْنُ مُحَمَّدٍ قَرَابَةً لِسُوَيْدِ بْنِ سَعِيدٍ الْأَمْرَانِيِّ قَالَ حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَحْمَدَ الْفَارِسِيِّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ أَبِي لَيْلَى عَنِ الْهَيْثَمِ بْنِ جَمِيلٍ عَنْ زُهَيْرٍ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَنْ عَاصِمِ بْنِ حَمْزَةَ السَّلُولِيِّ قَالَ سَمِعْتُ غُلَاماً بِالْمَدِينَةِ وَ هُوَ يَقُولُ يَا أَحْكَمَ الْحَاكِمِينَ احْكُمْ بَيْنِي وَ بَيْنَ أُمِّي فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ يَا غُلَامُ لِمَ تَدْعُو عَلَى أُمِّكَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهَا حَمَلَتْنِي فِي بَطْنِهَا تِسْعَةَ أَشْهُرٍ وَ أَرْضَعَتْنِي حَوْلَيْنِ فَلَمَّا تَرَعْرَعْتُ وَ عَرَفْتُ الْخَيْرَ مِنَ الشَّرِّ وَ يَمِينِي عَنْ شِمَالِي طَرَدَتْنِي وَ انْتَفَتْ مِنِّي وَ زَعَمَتْ أَنَّهَا لَا تَعْرِفُنِي<br>فَقَالَ عُمَرُ أَيْنَ تَكُونُ الْوَالِدَةُ قَالَ فِي سَقِيفَةِ بَنِي فُلَانٍ فَقَالَ عُمَرُ عَلَيَّ بِأُمِّ الْغُلَامِ قَالَ فَأَتَوْا بِهَا مَعَ أَرْبَعَةِ إِخْوَةٍ لَهَا وَ أَرْبَعِينَ قَسَامَةً يَشْهَدُونَ لَهَا أَنَّهَا لَا تَعْرِفُ الصَّبِيَّ وَ أَنَّ هَذَا الْغُلَامَ غُلَامٌ مُدَّعٍ ظَلُومٌ غَشُومٌ يُرِيدُ أَنْ يَفْضَحَهَا فِي عَشِيرَتِهَا وَ أَنَّ هَذِهِ جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ تَتَزَوَّجْ قَطُّ وَ أَنَّهَا بِخَاتَمِ رَبِّهَا<br>فَقَالَ عُمَرُ يَا غُلَامُ مَا تَقُولُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ هَذِهِ وَ اللَّهِ أُمِّي حَمَلَتْنِي فِي بَطْنِهَا تِسْعَةَ أَشْهُرٍ وَ أَرْضَعَتْنِي حَوْلَيْنِ فَلَمَّا تَرَعْرَعْتُ وَ عَرَفْتُ الْخَيْرَ مِنَ الشَّرِّ وَ يَمِينِي مِنْ شِمَالِي طَرَدَتْنِي وَ انْتَفَتْ مِنِّي وَ زَعَمَتْ أَنَّهَا لَا تَعْرِفُنِي<br>فَقَالَ عُمَرُ يَا هَذِهِ مَا يَقُولُ الْغُلَامُ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ وَ الَّذِي احْتَجَبَ بِالنُّورِ فَلَا عَيْنَ تَرَاهُ وَ حَقِّ مُحَمَّدٍ وَ مَا وَلَدَ مَا أَعْرِفُهُ وَ لَا أَدْرِي مِنْ أَيِّ النَّاسِ هُوَ وَ إِنَّهُ غُلَامٌ مُدَّعٍ يُرِيدُ أَنْ يَفْضَحَنِي فِي عَشِيرَتِي وَ إِنِّي جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ أَتَزَوَّجْ قَطُّ وَ إِنِّي بِخَاتَمِ رَبِّي فَقَالَ عُمَرُ أَ لَكِ شُهُودٌ فَقَالَتْ نَعَمْ هَؤُلَاءِ فَتَقَدَّمَ الْأَرْبَعُونَ الْقَسَامَةَ فَشَهِدُوا عِنْدَ عُمَرَ أَنَّ الْغُلَامَ مُدَّعٍ يُرِيدُ أَنْ يَفْضَحَهَا فِي عَشِيرَتِهَا وَ أَنَّ هَذِهِ جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ تَتَزَوَّجْ قَطُّ وَ أَنَّهَا بِخَاتَمِ رَبِّهَا<br>فَقَالَ عُمَرُ خُذُوا هَذَا الْغُلَامَ وَ انْطَلِقُوا بِهِ إِلَى السِّجْنِ حَتَّى نَسْأَلَ عَنِ الشُّهُودِ فَإِنْ عُدِّلَتْ شَهَادَتُهُمْ جَلَدْتُهُ حَدَّ الْمُفْتَرِي فَأَخَذُوا الْغُلَامَ يُنْطَلَقُ بِهِ إِلَى السِّجْنِ فَتَلَقَّاهُمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي بَعْضِ الطَّرِيقِ فَنَادَى الْغُلَامُ يَا ابْنَ عَمِّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّنِي غُلَامٌ مَظْلُومٌ وَ أَعَادَ عَلَيْهِ الْكَلَامَ الَّذِي كَلَّمَ بِهِ عُمَرَ ثُمَّ قَالَ وَ هَذَا عُمَرُ قَدْ أَمَرَ بِي إِلَى الْحَبْسِ فَقَالَ عَلِيٌّ ( عليه السلام ) رُدُّوهُ إِلَى عُمَرَ<br>فَلَمَّا رَدُّوهُ قَالَ لَهُمْ عُمَرُ أَمَرْتُ بِهِ إِلَى السِّجْنِ فَرَدَدْتُمُوهُ إِلَيَّ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ أَمَرَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) أَنْ نَرُدَّهُ إِلَيْكَ وَ سَمِعْنَاكَ وَ أَنْتَ تَقُولُ لَا تَعْصُوا لِعَلِيٍّ ( عليه السلام ) أَمْراً<br>فَبَيْنَا هُمْ كَذَلِكَ إِذْ أَقْبَلَ عَلِيٌّ ( عليه السلام ) فَقَالَ عَلَيَّ بِأُمِّ الْغُلَامِ فَأَتَوْا بِهَا فَقَالَ عَلِيٌّ ( عليه السلام ) يَا غُلَامُ مَا تَقُولُ فَأَعَادَ الْكَلَامَ فَقَالَ عَلِيٌّ ( عليه السلام ) لِعُمَرَ أَ تَأْذَنُ لِي أَنْ أَقْضِيَ بَيْنَهُمْ فَقَالَ عُمَرُ سُبْحَانَ اللَّهِ وَ كَيْفَ لَا وَ قَدْ سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ أَعْلَمُكُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ<br>ثُمَّ قَالَ لِلْمَرْأَةِ يَا هَذِهِ أَ لَكِ شُهُودٌ قَالَتْ نَعَمْ فَتَقَدَّمَ الْأَرْبَعُونَ قَسَامَةً فَشَهِدُوا بِالشَّهَادَةِ الْأُولَى فَقَالَ عَلِيٌّ ( عليه السلام ) لَأَقْضِيَنَّ الْيَوْمَ بِقَضِيَّةٍ بَيْنَكُمَا هِيَ مَرْضَاةُ الرَّبِّ مِنْ فَوْقِ عَرْشِهِ عَلَّمَنِيهَا حَبِيبِي رَسُولُ اللَّهِ ( صلى الله عليه وآله )<br>ثُمَّ قَالَ لَهَا أَ لَكِ وَلِيٌّ قَالَتْ نَعَمْ هَؤُلَاءِ إِخْوَتِي فَقَالَ لِإِخْوَتِهَا أَمْرِي فِيكُمْ وَ فِي أُخْتِكُمْ جَائِزٌ فَقَالُوا نَعَمْ يَا ابْنَ عَمِّ مُحَمَّدٍ ( صلى الله عليه وآله ) أَمْرُكَ فِينَا وَ فِي أُخْتِنَا جَائِزٌ فَقَالَ عَلِيٌّ ( عليه السلام ) أُشْهِدُ اللَّهَ وَ أُشْهِدُ مَنْ حَضَرَ مِنَ الْمُسْلِمِينَ أَنِّي قَدْ زَوَّجْتُ هَذَا الْغُلَامَ مِنْ هَذِهِ الْجَارِيَةِ بِأَرْبَعِمِائَةِ دِرْهَمٍ وَ النَّقْدُ مِنْ مَالِي يَا قَنْبَرُ عَلَيَّ بِالدَّرَاهِمِ فَأَتَاهُ قَنْبَرٌ بِهَا فَصَبَّهَا فِي يَدِ الْغُلَامِ قَالَ خُذْهَا فَصُبَّهَا فِي حَجْرِ امْرَأَتِكَ وَ لَا تَأْتِنَا إِلَّا وَ بِكَ أَثَرُ الْعُرْسِ يَعْنِي الْغُسْلَ<br>فَقَامَ الْغُلَامُ فَصَبَّ الدَّرَاهِمَ فِي حَجْرِ الْمَرْأَةِ ثُمَّ تَلَبَّبَهَا فَقَالَ لَهَا قُومِي فَنَادَتِ الْمَرْأَةُ النَّارَ النَّارَ يَا ابْنَ عَمِّ مُحَمَّدٍ تُرِيدُ أَنْ تُزَوِّجَنِي مِنْ وَلَدِي هَذَا وَ اللَّهِ وَلَدِي زَوَّجَنِي إِخْوَتِي هَجِيناً فَوَلَدْتُ مِنْهُ هَذَا الْغُلَامَ فَلَمَّا تَرَعْرَعَ وَ شَبَّ أَمَرُونِي أَنْ أَنْتَفِيَ مِنْهُ وَ أَطْرُدَهُ وَ هَذَا وَ اللَّهِ وَلَدِي وَ فُؤَادِي يَتَقَلَّى أَسَفاً عَلَى وَلَدِي<br>قَالَ ثُمَّ أَخَذَتْ بِيَدِ الْغُلَامِ وَ انْطَلَقَتْ وَ نَادَى عُمَرُ وَا عُمَرَاهْ لَوْ لَا عَلِيٌّ لَهَلَكَ عُمَرُ .",
					"english": "Ali Bin Muhammad, from Ibrahim Bin Is’haq Al Ahmar, from Isa Yusuf Bin Muhammad, a relative of Suweyd Bin saeed Al Amrany, from Suweyd Bin saeed, from Abdul Rahman Bin Ahmad Al Farsy, from Muhammad Bin Ibrahim Bin Abu Layli, from Al Haysam Bin Jameel, from zuheyr, from Abu Is’haq Al Sabi’e, from Aasim Bin Hamza Al Saluly who said, <br>‘I heard a boy at Al-Medina and he was saying, ‘O Judge of the Judges! Judge between me and my mother!’ So Umar Bin Al-Khattab said to him, ‘O boy! Why are you supplicating against your mother?’ So he said, ‘O commander of the faithful! She bore me in her belly for nine months, and weaned me for two years. So when I grew up and recognised the good from the evil, and my right from my left, she expelled me and negated me and alleged that she did not recognise me’.<br>So Umar said, ‘Where does your mother happen to be?’ He said, ‘In a tent of the clan of so and so’. So Umar said, ‘(Come) to me with the mother of the boy!’ So they came over with her, and with four brothers of hers, and forty (men) swearing on oath testifying for her, that she does not recognise the child, and that the boy is a claimant who is unjust and lewd (immoral), intending to shame her in her clan, and that this is a slave girl who is from Qureysh who had not married at all, and that she is with a seal of her Lord (azwj) (a virgin)’.<br>So Umar said, ‘O boy! What are you saying?’ So he said, ‘O commander of the faithful! By Allah (azwj)! This is my mother who bore me in her belly for nine months, and weaned me for two years. So when I grew up and recognised the good from the evil, and my right from my left, she expelled me and negated me, and she claims that she does not recognise me’.<br>So Umar said, ‘O you (woman)! What is this boy saying?’ So she said, ‘O commander of the faithful! By the One (azwj) Who is Veiled by the Light, so no eye has seen Him (azwj), and right was Muhammad (saww), I do not recognise him nor do I know from which people he is, and he is a boy who is a claimant intending to shame me in my clam, and I am a slave girl from Qureysh, not being married at all, and I am with a seal from my Lord (azwj)’. So Umar said, ‘Are there witnesses for you?’ So she said, ‘Yes, they are’. So the forty (men) swearing on oath, so they testified in the presence of Umar that the boy is a claimant intending to shame her in her clan, and there this is a slave girl from Qureysh, not having been married at all, and she is with a seal from her Lord (azwj)’.<br>So Umar said, ‘Seize this boy, and go with him to the prison until we ask about the witnesses. So if their testimonies was just, I will whip him with a legal penalty (Hadd) of the slanderer’. So they seized the boy went with him towards the prison. So they came across Amir Al-Momineen (asws) in one of the roads. So the boy called out, ‘O cousin of Rasool-Allah (saww)! I am an oppressed boy’, and he repeated the speech to him (asws) which he had spoken with to Umar. Then he said, ‘And this Umar has ordered regarding me (to be sent) to the prison’. So Ali (asws) said: ‘Return him to Umar’.<br>So when they returned him, Umar said to them, ‘I ordered with him to the prison, and you have returned him to me?’ So they said, ‘O commander of the faithful! Ali (asws) Bin Abu Talib (asws) ordered us that the be returned to you, and we heard you, and you were saying, ‘Do not disobey to Ali (asws) in any matter’.<br>So whilst they were in that, Ali (asws) came over. So he (asws) said: ‘(send to) me with the mother of the boy’. So they came over with her. So Ali (asws) said: ‘O boy, what are you saying?’ So he repeated the speech. So Ali (asws) said to Umar: ‘Do you permit me (asws) that I (asws) judge between them?’ So Umar said, ‘Glory be to Allah (azwj)! And how (can it be) no, and I have heard Rasool-Allah (saww) saying: ‘The most knowledgeable of you all is Ali (asws) Bin Abu Talib (asws)’.<br>Then he (asws) said to the woman: ‘O you (woman)! Are there witnesses for you?’ She said, ‘Yes’. So the forty (men) swearing on oath testified with the first testimony. So Ali (asws) said: ‘I (asws) shall judge today with a judgement between you two, being the Pleasure of the Lord (azwj) from above His (azwj) Throne, which my (asws) beloved Rasool-Allah (saww) had taught me (asws)’.<br>Then he (asws) said to her: ‘Is there a guardian for you?’ She said, ‘Yes, they are, my brothers’. So he (asws) said to her brothers: ‘My (asws) order regarding you and regarding your sister is allowed?’ So they said, ‘Yes, O cousin of Muhammad (saww), your (asws) order regarding us and regarding our sister is allowed’. So Ali (asws) said: ‘I (asws) am keeping Allah (azwj) as a Witness, and the ones who are present from the Muslims, that I (asws) hereby marry this boy to this slave girl, with (a dower of) four hundred Dirhams, and the cash is from my (asws) wealth. O Qanbar! To me (asws) with the Dirhams!’ So Qanbar came over with it. So He (asws) placed it in the hands of the boy, and said: ‘Take it, and place it in the lap of your wife, and do not come to us except with you are the effects of the marriage, meaning the washing’.<br>So the boy stood up and placed the Dirhams in the lap of the woman, then addressed her, so he said to her, ‘Stand up’. So the woman called out, ‘The Fire! The Fire! O cousin of Muhammad (saww), are you (asws) intending to marry me to this son of mine? By Allah (azwj) this is my son. My brothers married me off to a half-caste, so I gave birth to this boy from him. So when he grew up and became a youth, they ordered me that I should deny him and expel him, this, by Allah (azwj), (he) is my son, and my heart regrets over my son’.<br>He (the narrator) said: ‘Then she grabbed the hand of the boy and went with him, and Umar called out: ‘Woe unto Umar! Had it not been for Ali (asws), Umar would be destroyed!’"
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بِامْرَأَةٍ تَزَوَّجَهَا شَيْخٌ فَلَمَّا أَنْ وَاقَعَهَا مَاتَ عَلَى بَطْنِهَا فَجَاءَتْ بِوَلَدٍ فَادَّعَى بَنُوهُ أَنَّهَا فَجَرَتْ وَ تَشَاهَدُوا عَلَيْهَا فَأَمَرَ بِهَا عُمَرُ أَنْ تُرْجَمَ<br>فَمَرَّ بِهَا عَلِيٌّ ( عليه السلام ) فَقَالَتْ يَا ابْنَ عَمِّ رَسُولِ اللَّهِ إِنَّ لِي حُجَّةً قَالَ هَاتِي حُجَّتَكِ فَدَفَعَتْ إِلَيْهِ كِتَاباً فَقَرَأَهُ فَقَالَ هَذِهِ الْمَرْأَةُ تُعْلِمُكُمْ بِيَوْمَ تَزَوَّجَهَا وَ يَوْمَ وَاقَعَهَا وَ كَيْفَ كَانَ جِمَاعُهُ لَهَا رُدُّوا الْمَرْأَةَ<br>فَلَمَّا أَنْ كَانَ مِنَ الْغَدِ دَعَا بِصِبْيَانٍ أَتْرَابٍ وَ دَعَا بِالصَّبِيِّ مَعَهُمْ فَقَالَ لَهُمُ الْعَبُوا حَتَّى إِذَا أَلْهَاهُمُ اللَّعِبُ قَالَ لَهُمُ اجْلِسُوا حَتَّى إِذَا تَمَكَّنُوا صَاحَ بِهِمْ فَقَامَ الصِّبْيَانُ وَ قَامَ الْغُلَامُ فَاتَّكَأَ عَلَى رَاحَتَيْهِ فَدَعَا بِهِ عَلِيٌّ ( عليه السلام ) وَ وَرَّثَهُ مِنْ أَبِيهِ وَ جَلَدَ إِخْوَتَهُ الْمُفْتَرِينَ حَدّاً حَدّاً فَقَالَ لَهُ عُمَرُ كَيْفَ صَنَعْتَ قَالَ ( عليه السلام ) عَرَفْتُ ضَعْفَ الشَّيْخِ فِي اتِّكَاءِ الْغُلَامِ عَلَى رَاحَتَيْهِ.",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘They came to Umar with a woman who had been married to an old man. So when he had copulated with her, fell dead upon her belly. So she came up with a child, but his sons claimed that she had been immoral and testified against her. So Umar order with her to be stoned.<br>So Ali (asws) passed by her, so she said, ‘O cousin of Rasool-Allah (saww)! There is a proof for me’. He (asws) said: ‘Bring me (asws) your proof’. So she handed over a letter to him (asws). So he (asws) read it. So he (asws) said: ‘This woman is letting you know of the day she was married, and the day she was copulated with and how her copulation was. Return the woman!’<br>So when it was the morning, he (asws) called over some children of equal ages, and called the child (of the woman) along with them. So he (asws) said to them: ‘Play’, until the playing was exhausting for them, he (asws) said: ‘Sit down’. When they had taken their places, he (asws) shouted at them. So the children stood up, and the boy (of the woman) leaned upon his hands (in order to stand up). So Ali (asws) called him over and made him inherit him from his father, and whipped his brothers for the false accusation by a legal penalty (Hadd) each. So Umar said to him (asws), ‘How did you (asws) do this?’ He (asws) said: ‘I (asws) recognised the weakness of the old man in the leaning of the boy upon his hands (when he tried to get up)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا أَقْبَلَ عَلَى عَهْدِ عَلِيٍّ ( عليه السلام ) مِنَ الْجَبَلِ حَاجّاً وَ مَعَهُ غُلَامٌ لَهُ فَأَذْنَبَ فَضَرَبَهُ مَوْلَاهُ فَقَالَ مَا أَنْتَ مَوْلَايَ بَلْ أَنَا مَوْلَاكَ قَالَ فَمَا زَالَ ذَا يَتَوَعَّدُ ذَا وَ ذَا يَتَوَعَّدُ ذَا وَ يَقُولُ كَمَا أَنْتَ حَتَّى نَأْتِيَ الْكُوفَةَ يَا عَدُوَّ اللَّهِ فَأَذْهَبَ بِكَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )<br>فَلَمَّا أَتَيَا الْكُوفَةَ أَتَيَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ الَّذِي ضَرَبَ الْغُلَامَ أَصْلَحَكَ اللَّهُ هَذَا غُلَامٌ لِي وَ إِنَّهُ أَذْنَبَ فَضَرَبْتُهُ فَوَثَبَ عَلَيَّ وَ قَالَ الْآخَرُ هُوَ وَ اللَّهِ غُلَامٌ لِي إِنَّ أَبِي أَرْسَلَنِي مَعَهُ لِيُعَلِّمَنِي وَ إِنَّهُ وَثَبَ عَلَيَّ يَدَّعِينِي لِيَذْهَبَ بِمَالِي<br>قَالَ فَأَخَذَ هَذَا يَحْلِفُ وَ هَذَا يَحْلِفُ وَ هَذَا يُكَذِّبُ هَذَا وَ هَذَا يُكَذِّبُ هَذَا قَالَ فَقَالَ انْطَلِقَا فَتَصَادَقَا فِي لَيْلَتِكُمَا هَذِهِ وَ لَا تَجِيئَانِي إِلَّا بِحَقٍّ<br>قَالَ فَلَمَّا أَصْبَحَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لِقَنْبَرٍ اثْقُبْ فِي الْحَائِطِ ثَقْبَيْنِ قَالَ وَ كَانَ إِذَا أَصْبَحَ عَقَّبَ حَتَّى تَصِيرَ الشَّمْسُ عَلَى رُمْحٍ يُسَبِّحُ فَجَاءَ الرَّجُلَانِ وَ اجْتَمَعَ النَّاسُ فَقَالُوا لَقَدْ وَرَدَتْ عَلَيْهِ قَضِيَّةٌ مَا وَرَدَ عَلَيْهِ مِثْلُهَا لَا يَخْرُجُ مِنْهَا فَقَالَ لَهُمَا مَا تَقُولَانِ فَحَلَفَ هَذَا أَنَّ هَذَا عَبْدُهُ وَ حَلَفَ هَذَا أَنَّ هَذَا عَبْدُهُ<br>فَقَالَ لَهُمَا قُومَا فَإِنِّي لَسْتُ أَرَاكُمَا تَصْدُقَانِ ثُمَّ قَالَ لِأَحَدِهِمَا أَدْخِلْ رَأْسَكَ فِي هَذَا الثَّقْبِ ثُمَّ قَالَ لِلْآخَرِ أَدْخِلْ رَأْسَكَ فِي هَذَا الثَّقْبِ ثُمَّ قَالَ يَا قَنْبَرُ عَلَيَّ بِسَيْفِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَجِّلِ اضْرِبْ رَقَبَةَ الْعَبْدِ مِنْهُمَا قَالَ فَأَخْرَجَ الْغُلَامُ رَأْسَهُ مُبَادِراً فَقَالَ عَلِيٌّ ( عليه السلام ) لِلْغُلَامِ أَ لَسْتَ تَزْعُمُ أَنَّكَ لَسْتَ بِعَبْدٍ وَ مَكَثَ الْآخَرُ فِي الثَّقْبِ فَقَالَ بَلَى وَ لَكِنَّهُ ضَرَبَنِي وَ تَعَدَّى عَلَيَّ قَالَ فَتَوَثَّقَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ دَفَعَهُ إِلَيْهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Abdullah Bin Usman, from a man, <br>(It has been narrated) from Abu Abdullah (asws) that a man came down from the mountain for Hajj and with him was a slave of his. So he sinned, so his master struck him. So he said, ‘You are not my master, but I am your master’. So this one did not cease to threaten that one, and that one did not cease to threaten this one, and he was saying, ‘You wait until we come to Al-Kufa, O enemy of Allah (azwj), so I shall go with you to Amir Al-Momineen (asws)’.<br>So when they both came to Al-Kufa, they both came to Amir Al-Momineen (asws). So the one who struck the slave said, ‘May Allah (azwj) Keep you (asws) well! This is a slave of mine, and he sinned, so I struck him, but he leapt upon me’. And the other one said, ‘By Allah (azwj), he is a slave of mine, My father had sent me with him for him to teach me, and he leapt upon me to claim and go away with my wealth’.<br>He (asws) said: ‘So this one swore an oath, and this one to swear an oath, and this one to belied this one, and this one to belied this one’. So he (asws) said: ‘Go away both of you, so be truthful in this night of your, and do not come to me except with the truth’.<br>He (asws) said: ‘So when it was the morning, Amir Al-Momineen (asws) said to Qanbar: ‘Pierce two holes in the wall’. So when it was morning he (asws) Prayed and Glorified until the sun came out to (the length of a) spear. So the two men came over, and the people gathered, saying, ‘A judgement has been referred to him (asws) the like of which has not been referred to (before). He (asws) would not be able to come out from it’. So he (asws) said to both of them: ‘What are you both saying?’ So this one swore on oath that this one was his slave, and this one swore that this one was his slave.<br>So he (asws) said to both of them: ‘Arise, both of you, for I do not see both of you speaking the truth’. Then he (asws) said to one of the two: ‘Enter your head in the hole (in the wall)’. Then he (asws) said to the other one: ‘Enter your head in this hole (in the wall)’. Then he (asws) said: ‘O Qanbar! (Bring) to me (asws) the sword of Rasool-Allah (saww) quickly, I (asws) want to strike off the neck of the slave from these two’. So the slave brought out his head first. So Ali (asws) said to the slave: ‘Are you not alleging that you are not a slave?’ And the other one remained in the hole. So he said, ‘Yes, but he struck me and exceeded upon me’. So Amir Al-Momineen (asws) authenticated (a document) for him and handed it over to him (the master)’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بْنُ الْخَطَّابِ بِجَارِيَةٍ قَدْ شَهِدُوا عَلَيْهَا أَنَّهَا بَغَتْ وَ كَانَ مِنْ قِصَّتِهَا أَنَّهَا كَانَتْ يَتِيمَةً عِنْدَ رَجُلٍ وَ كَانَ الرَّجُلُ كَثِيراً مَا يَغِيبُ عَنْ أَهْلِهِ فَشَبَّتِ الْيَتِيمَةُ فَتَخَوَّفَتِ الْمَرْأَةُ أَنْ يَتَزَوَّجَهَا زَوْجُهَا فَدَعَتْ بِنِسْوَةٍ حَتَّى أَمْسَكْنَهَا فَأَخَذَتْ عُذْرَتَهَا بِإِصْبَعِهَا فَلَمَّا قَدِمَ زَوْجُهَا مِنْ غَيْبَتِهِ رَمَتِ الْمَرْأَةُ الْيَتِيمَةَ بِالْفَاحِشَةِ وَ أَقَامَتِ الْبَيِّنَةَ مِنْ جَارَاتِهَا اللَّائِي سَاعَدَتْهَا عَلَى ذَلِكَ<br>فَرُفِعَ ذَلِكَ إِلَى عُمَرَ فَلَمْ يَدْرِ كَيْفَ يَقْضِي فِيهَا ثُمَّ قَالَ لِلرَّجُلِ ائْتِ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) وَ اذْهَبْ بِنَا إِلَيْهِ فَأَتَوْا عَلِيّاً ( عليه السلام ) وَ قَصُّوا عَلَيْهِ الْقِصَّةَ فَقَالَ لِامْرَأَةِ الرَّجُلِ أَ لَكِ بَيِّنَةٌ أَوْ بُرْهَانٌ قَالَتْ لِي شُهُودٌ هَؤُلَاءِ جَارَاتِي يَشْهَدْنَ عَلَيْهَا بِمَا أَقُولُ فَأَحْضَرَتْهُنَّ<br>فَأَخْرَجَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) السَّيْفَ مِنْ غِمْدِهِ فَطَرَحَ بَيْنَ يَدَيْهِ وَ أَمَرَ بِكُلِّ وَاحِدَةٍ مِنْهُنَّ فَأُدْخِلَتْ بَيْتاً ثُمَّ دَعَا بِامْرَأَةِ الرَّجُلِ فَأَدَارَهَا بِكُلِّ وَجْهٍ فَأَبَتْ أَنْ تَزُولَ عَنْ قَوْلِهَا فَرَدَّهَا إِلَى الْبَيْتِ الَّذِي كَانَتْ فِيهِ وَ دَعَا إِحْدَى الشُّهُودِ وَ جَثَا عَلَى رُكْبَتَيْهِ ثُمَّ قَالَ تَعْرِفِينِي أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ وَ هَذَا سَيْفِي وَ قَدْ قَالَتِ امْرَأَةُ الرَّجُلِ مَا قَالَتْ وَ رَجَعَتْ إِلَى الْحَقِّ وَ أَعْطَيْتُهَا الْأَمَانَ وَ إِنْ لَمْ تَصْدُقِينِي لَأَمْلَأَنَّ السَّيْفَ مِنْكِ فَالْتَفَتَتْ إِلَى عُمَرَ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ الْأَمَانَ عَلَيَّ فَقَالَ لَهَا أَمِيرُ الْمُؤْمِنِينَ فَاصْدُقِي<br>فَقَالَتْ لَا وَ اللَّهِ إِلَّا أَنَّهَا رَأَتْ جَمَالًا وَ هَيْئَةً فَخَافَتْ فَسَادَ زَوْجِهَا عَلَيْهَا فَسَقَتْهَا الْمُسْكِرَ وَ دَعَتْنَا فَأَمْسَكْنَاهَا فَافْتَضَّتْهَا بِإِصْبَعِهَا فَقَالَ عَلِيٌّ ( عليه السلام ) اللَّهُ أَكْبَرُ أَنَا أَوَّلُ مَنْ فَرَّقَ بَيْنَ الشَّاهِدَيْنِ إِلَّا دَانِيَالَ النَّبِيَّ<br>فَأَلْزَمَ عَلِيٌّ الْمَرْأَةَ حَدَّ الْقَاذِفِ وَ أَلْزَمَهُنَّ جَمِيعاً الْعُقْرَ وَ جَعَلَ عُقْرَهَا أَرْبَعَمِائَةِ دِرْهَمٍ وَ أَمَرَ الْمَرْأَةَ أَنْ تُنْفَى مِنَ الرَّجُلِ وَ يُطَلِّقَهَا زَوْجُهَا وَ زَوَّجَهُ الْجَارِيَةَ وَ سَاقَ عَنْهُ عَلِيٌّ ( عليه السلام ) الْمَهْرَ<br>فَقَالَ عُمَرُ يَا أَبَا الْحَسَنِ فَحَدِّثْنَا بِحَدِيثِ دَانِيَالَ فَقَالَ عَلِيٌّ ( عليه السلام ) إِنَّ دَانِيَالَ كَانَ يَتِيماً لَا أُمَّ لَهُ وَ لَا أَبَ وَ إِنَّ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ عَجُوزاً كَبِيرَةً ضَمَّتْهُ فَرَبَّتْهُ وَ إِنَّ مَلِكاً مِنْ مُلُوكِ بَنِي إِسْرَائِيلَ كَانَ لَهُ قَاضِيَانِ وَ كَانَ لَهُمَا صَدِيقٌ وَ كَانَ رَجُلًا صَالِحاً وَ كَانَتْ لَهُ امْرَأَةٌ بَهِيَّةٌ جَمِيلَةٌ وَ كَانَ يَأْتِي الْمَلِكَ فَيُحَدِّثُهُ<br>وَ احْتَاجَ الْمَلِكُ إِلَى رَجُلٍ يَبْعَثُهُ فِي بَعْضِ أُمُورِهِ فَقَالَ لِلْقَاضِيَيْنِ اخْتَارَا رَجُلًا أُرْسِلْهُ فِي بَعْضِ أُمُورِي فَقَالَا فُلَانٌ فَوَجَّهَهُ الْمَلِكُ فَقَالَ الرَّجُلُ لِلْقَاضِيَيْنِ أُوصِيكُمَا بِامْرَأَتِي خَيْراً فَقَالَا نَعَمْ فَخَرَجَ الرَّجُلُ<br>فَكَانَ الْقَاضِيَانِ يَأْتِيَانِ بَابَ الصَّدِيقِ فَعَشِقَا امْرَأَتَهُ فَرَاوَدَاهَا عَنْ نَفْسِهَا فَأَبَتْ فَقَالَا لَهَا وَ اللَّهِ لَئِنْ لَمْ تَفْعَلِي لَنَشْهَدَنَّ عَلَيْكِ عِنْدَ الْمَلِكِ بِالزِّنَى ثُمَّ لَنَرْجُمَنَّكِ فَقَالَتِ افْعَلَا مَا أَحْبَبْتُمَا فَأَتَيَا الْمَلِكَ فَأَخْبَرَاهُ وَ شَهِدَا عِنْدَهُ أَنَّهَا بَغَتْ فَدَخَلَ الْمَلِكَ مِنْ ذَلِكَ أَمْرٌ عَظِيمٌ وَ اشْتَدَّ بِهَا غَمُّهُ وَ كَانَ بِهَا مُعْجَباً<br>فَقَالَ لَهُمَا إِنَّ قَوْلَكُمَا مَقْبُولٌ وَ لَكِنِ ارْجُمُوهَا بَعْدَ ثَلَاثَةِ أَيَّامٍ وَ نَادَى فِي الْبَلَدِ الَّذِي هُوَ فِيهِ احْضُرُوا قَتْلَ فُلَانَةَ الْعَابِدَةِ فَإِنَّهَا قَدْ بَغَتْ فَإِنَّ الْقَاضِيَيْنِ قَدْ شَهِدَا عَلَيْهَا بِذَلِكَ فَأَكْثَرَ النَّاسُ فِي ذَلِكَ وَ قَالَ الْمَلِكُ لِوَزِيرِهِ مَا عِنْدَكَ فِي هَذَا مِنْ حِيلَةٍ فَقَالَ مَا عِنْدِي فِي ذَلِكَ مِنْ شَيْ‏ءٍ<br>فَخَرَجَ الْوَزِيرُ يَوْمَ الثَّالِثِ وَ هُوَ آخِرُ أَيَّامِهَا فَإِذَا هُوَ بِغِلْمَانٍ عُرَاةٍ يَلْعَبُونَ وَ فِيهِمْ دَانِيَالُ وَ هُوَ لَا يَعْرِفُهُ فَقَالَ دَانِيَالُ يَا مَعْشَرَ الصِّبْيَانِ تَعَالَوْا حَتَّى أَكُونَ أَنَا الْمَلِكَ وَ تَكُونَ أَنْتَ يَا فُلَانُ الْعَابِدَةَ وَ يَكُونَ فُلَانٌ وَ فُلَانٌ الْقَاضِيَيْنِ الشَّاهِدَيْنِ عَلَيْهَا ثُمَّ جَمَعَ تُرَاباً وَ جَعَلَ سَيْفاً مِنْ قَصَبٍ وَ قَالَ لِلصِّبْيَانِ خُذُوا بِيَدِ هَذَا فَنَحُّوهُ إِلَى مَكَانِ كَذَا وَ كَذَا وَ خُذُوا بِيَدِ هَذَا فَنَحُّوهُ إِلَى مَكَانِ كَذَا وَ كَذَا<br>ثُمَّ دَعَا بِأَحَدِهِمَا وَ قَالَ لَهُ قُلْ حَقّاً فَإِنَّكَ إِنْ لَمْ تَقُلْ حَقّاً قَتَلْتُكَ وَ الْوَزِيرُ قَائِمٌ يَنْظُرُ وَ يَسْمَعُ فَقَالَ أَشْهَدُ أَنَّهَا بَغَتْ فَقَالَ مَتَى قَالَ يَوْمَ كَذَا وَ كَذَا فَقَالَ رُدُّوهُ إِلَى مَكَانِهِ وَ هَاتُوا الْآخَرَ فَرَدُّوهُ إِلَى مَكَانِهِ وَ جَاءُوا بِالْآخَرِ فَقَالَ لَهُ بِمَا تَشْهَدُ فَقَالَ أَشْهَدُ أَنَّهَا بَغَتْ قَالَ مَتَى قَالَ يَوْمَ كَذَا وَ كَذَا قَالَ مَعَ مَنْ قَالَ مَعَ فُلَانِ بْنِ فُلَانٍ قَالَ وَ أَيْنَ قَالَ بِمَوْضِعِ كَذَا وَ كَذَا<br>فَخَالَفَ أَحَدُهُمَا صَاحِبَهُ فَقَالَ دَانِيَالُ اللَّهُ أَكْبَرُ شَهِدَا بِزُورٍ يَا فُلَانُ نَادِ فِي النَّاسِ أَنَّهُمَا شَهِدَا عَلَى فُلَانَةَ بِزُورٍ فَاحْضُرُوا قَتْلَهُمَا فَذَهَبَ الْوَزِيرُ إِلَى الْمَلِكِ مُبَادِراً فَأَخْبَرَهُ الْخَبَرَ فَبَعَثَ الْمَلِكُ إِلَى الْقَاضِيَيْنِ فَاخْتَلَفَا كَمَا اخْتَلَفَ الْغُلَامَانِ فَنَادَى الْمَلِكُ فِي النَّاسِ وَ أَمَرَ بِقَتْلِهِمَا.",
					"english": "Ali, from his father, from Ibn Abu Umeyr, from Muawiya Bin Wahab, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘They came to Umar Bin Al-Khattab with a slave girl who had been testified against that she had committed adultery, and from her story was that she was an orphan (in the custody of) a man, and the man used to be frequently absent from his family. So the orphan girl matured, so the wife (of that man) feared that her husband may marry her. So she called women (friends) until they restrained her. So she took away her virginity by her fingers. So when the husband returned from his absence, the wife accused the orphan girl with the immorality, and established the proof from her neighbours who had aided her upon that.<br>So that was raised to Umar, but he did not know how to judge with regards to it. Then he said to the man, ‘Go to Ali (asws) Bin Abu Talib (asws), and we will go with you to him (asws)’. So they came over to Ali (asws) and related to him (asws) the story. So he (asws) said to the wife of the man, ‘Is there any proof for you, or evidence?’ She said, ‘There are witnesses for me, these neighbours of mine who are testifying against her with what I am saying, so I am presenting them. <br>So Ali (asws) Bin Abu Talib (asws) brought out the sword from its sheath, so he (asws) placed it in front of him, and ordered for each one of them (women witnesses) to enter into a room. Then he called the wife of the man, so he (asws) interrogated her with every aspect, but she refused to waver from her words. So he returned her to the room in which she was, and called for one of the witnesses, and sat upon his (asws) knees. Then he (asws) said: ‘Do you recognise me (asws)? I (asws) am Ali (asws) Bin Abu Talib (asws), and this is my (asws) sword, and the wife of the man has said what she said, and returned to the truth, and I (asws) gave her amnesty, and if you are not truthful to me, I (asws) will fill the sword from you (your blood)’. So she turned around to Umar and said, ‘O commander of the faithful! The amnesty for me’. So Amir Al-Momineen (asws) said to her: ‘So speak the truth to me (asws)’.<br>So she said, ‘No, by Allah (azwj), except that she saw the (in the orphan girl) beauty and body, so she feared mischief of her husband upon her, so she gave her an intoxicating drink, and called us over, so we restrained her, and she deflowered her with her fingers’. So Ali (asws) said: ‘Allah (azwj) is the Greatest! I (asws) am the first one to differentiate between two witnesses, except for Dainel (as), the Prophet (asws).<br>So Ali (asws) necessitated upon the woman the legal penalty (Hadd) of the slanderer, and necessitated upon all the women together, the dower, and made her dower to be four hundred Dirhams, and ordered the woman that be denied from the man and divorced her, and married the girl to him, and Ali (asws) paid (contributed) the dower from himself (asws)’.<br>So Umar said, ‘O Abu Al Hassan (asws)! So narrate to us with a Hadeeth of Daniel (as)’. So Ali (asws) said: ‘Dainel (as) was an orphan, not having a mother for him (as) nor a father, and a woman from the Children of Israel, very old, cared for him (asws) and loved him (as). And (there was a) a king from the kings of the Children of Israel who had two judges for him who had a friend who was a righteous man, for whom was a woman with a beautiful body, and he used to come to the king and discuss with him.<br>And the king had a need from that man, to send him regarding one of his matters. So he said to the two judges, ‘Both of you choose a man to send him in one of my matters’. So they both said, ‘So and so’. So the king diverted himself to him. So the man said to the two judges, ‘I bequeath to both of you with my wife for her safety’. So they both said, ‘Yes’. So the man went out.<br>So the judges used to come to the door of the friend, so they both desired his wife, but she repulsed them both from herself and refused. So they both said to her, ‘By Allah (azwj)! If you were not to do it, we would testify against you in the presence of the king with the adultery, then we would have you stoned’. So she said, ‘So do whatever you both like to’. So they both went over to the king and informed him, and testified in his presence that she is an adulteress. So there entered a grievous matter into the king due to that, and his grief got aggravated by it, and he had also admired her.<br>So he said to them both, ‘Both your words are accepted, but, stone her after three days’. He called out in the city in which he (her husband) was, for (the people) to be present for the killing of so and so woman worshipper, for she had committed adultery, for the two judges has testified against her’. So there were a lot of people with regards to that, and the king said to his Vizier, ‘What is with you with regards to this from an excuse?’ So he said, ‘There is nothing with me regarding that anything’.<br>So the Vizier went out on the third day, and it was the last of her days, and there were (some) little boys playing, and among them was Dainel (as), and he did not know him (as). So Daniel (as) said: ‘O group of children! Come, until I (as) become (pretend) I (as) am the king, and you become the so and so worshipper woman, and so and so, and so and so become the two judges testifying against her. Then he (as) gathered dust and made a sword from a stick, and said to the children: ‘Take this (pretend judge) by your hand and go to this such and such a place, and take the hand of this (the other pretend judge) and go to this such and such a place.<br>Then he (as) called one of the two and said to him: ‘Speak the truth. If you do not speak the truth, I (as) will kill you’. And the Vizier was standing and listening’. So he (one pretend judge said) said, ‘I testify that she has committed adultery’. So he (as) said: ‘When?’ He said, ‘On such and such a day’. He (as) said: ‘Return him to his place and bring the other one’. So he returned him to his place, and came with the other one. So he (as) said to him: ‘With what do you testify?’ So he said, ‘I testify that she has committed adultery’. He (as) said: ‘When?’ He said, ‘On such and such a day’. He (as) said: ‘With whom?’ He said, ‘With so and so, son of so and so’. He (as) said: ‘And where?’ He said, ‘At such and such a place’.<br>So one of the two contradicted his companions. So Daniel (as) said: ‘Allah (azwj) is the Greatest! A false testimony. O so and so, call out among the people that these two have testified against so and so woman with falsity, therefore present them and kill both of them’. So the Vizier went to the king quickly and informed him of the news. So the king sent for the two judges, and they both differed just as the two boys had differed. So the king called out among the people, and ordered with the killing of them both’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى يُحَدِّثُ أَصْحَابَهُ فَقَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَيْنَ رَجُلَيْنِ اصْطَحَبَا فِي سَفَرٍ فَلَمَّا أَرَادَا الْغَدَاءَ أَخْرَجَ أَحَدَهُمَا مِنْ زَادِهِ خَمْسَةَ أَرْغِفَةٍ وَ أَخْرَجَ الْآخَرُ ثَلَاثَةَ أَرْغِفَةٍ فَمَرَّ بِهِمَا عَابِرُ سَبِيلٍ فَدَعَوَاهُ إِلَى طَعَامِهِمَا فَأَكَلَ الرَّجُلُ مَعَهُمَا حَتَّى لَمْ يَبْقَ شَيْ‏ءٌ فَلَمَّا فَرَغُوا أَعْطَاهُمَا الْعَابِرُ بِهِمَا ثَمَانِيَةَ دَرَاهِمَ ثَوَابَ مَا أَكَلَهُ مِنْ طَعَامِهِمَا فَقَالَ صَاحِبُ الثَّلَاثَةِ أَرْغِفَةٍ لِصَاحِبِ الْخَمْسَةِ أَرْغِفَةٍ اقْسِمْهَا نِصْفَيْنِ بَيْنِي وَ بَيْنَكَ وَ قَالَ صَاحِبُ الْخَمْسَةِ لَا بَلْ يَأْخُذُ كُلُّ وَاحِدٍ مِنَّا مِنَ الدَّرَاهِمِ عَلَى عَدَدِ مَا أَخْرَجَ مِنَ الزَّادِ<br>قَالَ فَأَتَيَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي ذَلِكَ فَلَمَّا سَمِعَ مَقَالَتَهُمَا قَالَ لَهُمَا اصْطَلِحَا فَإِنَّ قَضِيَّتَكُمَا دَنِيَّةٌ فَقَالَا اقْضِ بَيْنَنَا بِالْحَقِّ<br>قَالَ فَأَعْطَى صَاحِبَ الْخَمْسَةِ أَرْغِفَةٍ سَبْعَةَ دَرَاهِمَ وَ أَعْطَى صَاحِبَ الثَّلَاثَةِ أَرْغِفَةٍ دِرْهَماً وَ قَالَ أَ لَيْسَ أَخْرَجَ أَحَدُكُمَا مِنْ زَادِهِ خَمْسَةَ أَرْغِفَةٍ وَ أَخْرَجَ الْآخَرُ ثَلَاثَةَ أَرْغِفَةٍ قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلَ مَعَكُمَا ضَيْفُكُمَا مِثْلَ مَا أَكَلْتُمَا قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلَ كُلُّ وَاحِدٍ مِنْكُمَا ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثِهَا قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلْتَ أَنْتَ يَا صَاحِبَ الثَّلَاثَةِ ثَلَاثَةَ أَرْغِفَةٍ إِلَّا ثُلُثاً وَ أَكَلْتَ أَنْتَ يَا صَاحِبَ الْخَمْسَةِ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ وَ أَكَلَ الضَّيْفُ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ أَ لَيْسَ بَقِيَ لَكَ يَا صَاحِبَ الثَّلَاثَةِ ثُلُثُ رَغِيفٍ مِنْ زَادِكَ وَ بَقِيَ لَكَ يَا صَاحِبَ الْخَمْسَةِ رَغِيفَانِ وَ ثُلُثٌ وَ أَكَلْتَ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ<br>فَأَعْطَاهُمَا لِكُلِّ ثُلُثِ رَغِيفٍ دِرْهَماً فَأَعْطَى صَاحِبَ الرَّغِيفَيْنِ وَ ثُلُثٍ سَبْعَةَ دَرَاهِمَ وَ أَعْطَى صَاحِبَ ثُلُثِ رَغِيفٍ دِرْهَماً .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj who said, <br>‘I heard Ibn Abu Layli discussing with his companions, so he said, ‘Amir Al-Momineen (asws) judged between two men who had accompanied each other in a journey. So when they intended breakfast, one of them brought out from his provision, five loaves, and the other one brought out three loaves. So there passed by them a traveller. So they called him over to both their food. So the man was with them both until there did not remain anything (from the loaves). So when they were free, the traveller gave them both eight Dirhams as a reward of what he had eaten from both their food. So the owner of the three loaves said to the owner of the five loaves, ‘Divide it in two halves between me and you’, and the owner of the five (loaves) said, ‘No, but each one of us should take from the Dirhams upon the number of whatever was brought out from the provisions. <br>So they both came to Amir Al-Momineen (asws) regarding that. So when he (asws) heard both their speeches, said to them both: ‘Settle with each other, for if I (asws) were to judge between the two of you, it would be closer’. So they both said, ‘Judge between us with the truth’.<br>He (the narrator) said, ‘So he (asws) gave the owner of the five loaves seven Dirhams, and gave the owner of the three loaves one Dirham, and said: ‘Did not one of you bring out five loaves from his provisions and the other one brought out three loaves?’ So they both said: ‘Yes’. He (asws) said: ‘Did not a guest eat with you both similar to what you both ate?’ They both said, ‘Yes’. He (asws) said: ‘Did not each one of you two each three loaves less a third of it (two and two-thirds of a loaf each)?’ They both said: ‘Yes’. Is it not that you, owner of the three (loaves) ate three less a third, and you O owner of the five (loaves) three loaves less a third, and the guest ate three loaves less a third. Is it not that there remains for you, O owner of the three (loaves), a third of a loaf from your provision, and there remains for you, O owner of the five (loaves) two loaves and a third, and you ate three loaves less a third?’<br>Thus, he (asws) gave them both, for every third of a loaf, one Dirham. So he gave the owner of the two loaves and a third, seven Dirhams, and gave the owner of a third of a loaf, one Dirham’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُوسُفَ بْنِ عَقِيلٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ أَكَلَ وَ أَصْحَابٌ لَهُ شَاةً فَقَالَ إِنْ أَكَلْتُمُوهَا فَهِيَ لَكُمْ وَ إِنْ لَمْ تَأْكُلُوهَا فَعَلَيْكُمْ كَذَا وَ كَذَا فَقَضَى فِيهِ أَنَّ ذَلِكَ بَاطِلٌ لَا شَيْ‏ءَ فِي الْمُؤَاكَلَةِ مِنَ الطَّعَامِ مَا قَلَّ مِنْهُ وَ مَا كَثُرَ وَ مَنَعَ غَرَامَتَهُ فِيهِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Yusuf Bin Aqeel, from Muhammad Bin Qays, <br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Amir Al-Momineen (asws) judged regarding a man who ate, and his companion had a sheep. So he said, ‘Eat it all, so it is for you, and if you do not eat it, so upon you would be such and such (an amount to pay). So he (asws) judged with regards to it that, that is invalid. There is nothing in the eating from the good, what is less from it, and what is more, and prevented the fine from him’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ عَلِيٍّ الْكَاتِبِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي شَيْبَةَ عَنْ حَرِيزٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ زَاذَانَ قَالَ اسْتَوْدَعَ رَجُلَانِ امْرَأَةً وَدِيعَةً وَ قَالَا لَهَا لَا تَدْفَعِيهَا إِلَى وَاحِدٍ مِنَّا حَتَّى نَجْتَمِعَ عِنْدَكِ ثُمَّ انْطَلَقَا فَغَابَا فَجَاءَ أَحَدُهُمَا إِلَيْهَا فَقَالَ أَعْطِينِي وَدِيعَتِي فَإِنَّ صَاحِبِي قَدْ مَاتَ فَأَبَتْ حَتَّى كَثُرَ اخْتِلَافُهُ ثُمَّ أَعْطَتْهُ ثُمَّ جَاءَ الْآخَرُ فَقَالَ هَاتِي وَدِيعَتِي فَقَالَتْ أَخَذَهَا صَاحِبُكَ وَ ذَكَرَ أَنَّكَ قَدْ مِتَّ<br>فَارْتَفَعَا إِلَى عُمَرَ فَقَالَ لَهَا عُمَرُ مَا أَرَاكِ إِلَّا وَ قَدْ ضَمِنْتِ فَقَالَتِ الْمَرْأَةُ اجْعَلْ عَلِيّاً ( عليه السلام ) بَيْنِي وَ بَيْنَهُ فَقَالَ عُمَرُ اقْضِ بَيْنَهُمَا فَقَالَ عَلِيٌّ ( عليه السلام ) هَذِهِ الْوَدِيعَةُ عِنْدِي وَ قَدْ أَمَرْتُمَاهَا أَنْ لَا تَدْفَعَهَا إِلَى وَاحِدٍ مِنْكُمَا حَتَّى تَجْتَمِعَا عِنْدَهَا فَائْتِنِي بِصَاحِبِكَ فَلَمْ يُضَمِّنْهَا وَ قَالَ ( عليه السلام ) إِنَّمَا أَرَادَا أَنْ يَذْهَبَا بِمَالِ الْمَرْأَةِ .",
					"english": "Al Husayn Bin Muhammad, from Ahmad Bin Ali, the scribe, from Ibrahim Bin Muhammad Al Saqafy, from Abdullah Bin Abu Shayba, from Hareyz, from Atiya Bin Al Saib, from Zadan who said, <br>‘Two men entrusted a woman with an entrustment and both said to her, ‘Do not hand it over to anyone one from us until we are gathered in your presence’. Then they both left. So they were both absent (for a time), and then one of the two came to her, so he said, ‘Give me my entrustment, for my companions has died’. But she refused, to the extent that their differing were numerous, then she gave it to him. Then the other one came over, so he said, ‘Give me my entrustment’. So she said, ‘You companions has taken it, and mentioned that you had died’.<br>So the matter was raised to Umar. So Umar said to her, ‘I do not see you except as one who is responsible’. So the woman said, ‘I make Ali (asws) between me and him’. So Umar said, ‘Judge between the two’. So Ali (asws) said: ‘This (woman) is the entrustment in my (asws) presence, and you had both instructed her that she should not hand it over to any one of you until you are both gathered in her presence. So come to me (asws) with your companion (the other man who took the money)’. Thus he (asws) did not hold her to be responsible, and Ali (asws) said: ‘But rather, they had both intended to go away with the wealth of the woman’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ عُقْبَةَ بْنِ خَالِدٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ رَأَيْتَ غَيْلَانَ بْنَ جَامِعٍ وَ اسْتَأْذَنَ عَلَيَّ فَأَذِنْتُ لَهُ وَ قَدْ بَلَغَنِي أَنَّهُ كَانَ يَدْخُلُ إِلَى بَنِي هَاشِمٍ<br>فَلَمَّا جَلَسَ قَالَ أَصْلَحَكَ اللَّهُ أَنَا غَيْلَانُ بْنُ جَامِعٍ الْمُحَارِبِيُّ قَاضِي ابْنِ هُبَيْرَةَ قَالَ قُلْتُ يَا غَيْلَانُ مَا أَظُنُّ ابْنَ هُبَيْرَةَ وَضَعَ عَلَى قَضَائِهِ إِلَّا فَقِيهاً قَالَ أَجَلْ قُلْتُ يَا غَيْلَانُ تَجْمَعُ بَيْنَ الْمَرْءِ وَ زَوْجِهِ قَالَ نَعَمْ قُلْتُ وَ تُفَرِّقُ بَيْنَ الْمَرْءِ وَ زَوْجِهِ قَالَ نَعَمْ قُلْتُ وَ تَقْتُلُ قَالَ نَعَمْ قُلْتُ وَ تَضْرِبُ الْحُدُودَ قَالَ نَعَمْ قُلْتُ وَ تَحْكُمُ فِي أَمْوَالِ الْيَتَامَى قَالَ نَعَمْ قُلْتُ وَ بِقَضَاءِ مَنْ تَقْضِي قَالَ بِقَضَاءِ عُمَرَ وَ بِقَضَاءِ ابْنِ مَسْعُودٍ وَ بِقَضَاءِ ابْنِ عَبَّاسٍ وَ أَقْضِي مِنْ قَضَاءِ أَمِيرِ الْمُؤْمِنِينَ بِالشَّيْ‏ءِ<br>قَالَ قُلْتُ يَا غَيْلَانُ أَ لَسْتُمْ تَزْعُمُونَ يَا أَهْلَ الْعِرَاقِ وَ تَرْوُونَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ عَلِيٌّ أَقْضَاكُمْ فَقَالَ نَعَمْ قَالَ قُلْتُ وَ كَيْفَ تَقْضِي مِنْ قَضَاءِ عَلِيٍّ ( عليه السلام ) زَعَمْتَ بِالشَّيْ‏ءِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ عَلِيٌّ أَقْضَاكُمْ قَالَ وَ قُلْتُ كَيْفَ تَقْضِي يَا غَيْلَانُ قَالَ أَكْتُبُ هَذَا مَا قَضَى بِهِ فُلَانُ بْنُ فُلَانٍ لِفُلَانِ بْنِ فُلَانٍ يَوْمَ كَذَا وَ كَذَا مِنْ شَهْرِ كَذَا وَ كَذَا مِنْ سَنَةِ كَذَا ثُمَّ أَطْرَحُهُ فِي الدَّوَاوِينِ<br>قَالَ قُلْتُ يَا غَيْلَانُ هَذَا الْحَتْمُ مِنَ الْقَضَاءِ فَكَيْفَ تَقُولُ إِذَا جَمَعَ اللَّهُ الْأَوَّلِينَ وَ الْآخِرِينَ فِي صَعِيدٍ ثُمَّ وَجَدَكَ قَدْ خَالَفْتَ قَضَاءَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٍّ ( عليه السلام ) قَالَ فَأُقْسِمُ بِاللَّهِ لَجَعَلَ يَنْتَحِبُ قُلْتُ أَيُّهَا الرَّجُلُ اقْصِدْ لِسَانَكَ<br>قَالَ ثُمَّ قَدِمْتُ الْكُوفَةَ فَمَكَثْتُ مَا شَاءَ اللَّهُ ثُمَّ إِنِّي سَمِعْتُ رَجُلًا مِنَ الْحَيِّ يُحَدِّثُ وَ كَانَ فِي سَمْرِ ابْنِ هُبَيْرَةَ قَالَ وَ اللَّهِ إِنِّي لَعِنْدَهُ لَيْلَةً إِذْ جَاءَهُ الْحَاجِبُ فَقَالَ هَذَا غَيْلَانُ بْنُ جَامِعٍ فَقَالَ أَدْخِلْهُ قَالَ فَدَخَلَ فَسَأَلَهُ ثُمَّ قَالَ لَهُ مَا حَالُ النَّاسِ أَخْبِرْنِي لَوِ اضْطَرَبَ حَبْلٌ مَنْ كَانَ لَهَا قَالَ مَا رَأَيْتُ ثَمَّ أَحَداً إِلَّا جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام )<br>قَالَ أَخْبِرْنِي مَا صَنَعْتَ بِالْمَالِ الَّذِي كَانَ مَعَكَ فَإِنَّهُ بَلَغَنِي أَنَّهُ طَلَبَهُ مِنْكَ فَأَبَيْتَ قَالَ قَسَمْتُهُ قَالَ أَ فَلَا أَعْطَيْتَهُ مَا طَلَبَ مِنْكَ قَالَ كَرِهْتُ أَنْ أُخَالِفَكَ قَالَ فَسَأَلْتُكَ بِاللَّهِ أَمَرْتُكَ أَنْ تَجْعَلَهُ أَوَّلَهُمْ قَالَ نَعَمْ قَالَ فَفَعَلْتَ قَالَ لَا قَالَ فَهَلَّا خَالَفْتَنِي وَ أَعْطَيْتَهُ الْمَالَ كَمَا خَالَفْتَنِي فَجَعَلْتَهُ آخِرَهُمْ أَمَا وَ اللَّهِ لَوْ فَعَلْتَ مَا زِلْتَ مِنْهَا سَيِّداً ضَخْماً حَاجَتُكَ قَالَ تُخَلِّينِي قَالَ تَكَلَّمْ بِحَاجَتِكَ قَالَ تُعْفِينِي مِنَ الْقَضَاءِ<br>قَالَ فَحَسَرَ عَنْ ذِرَاعَيْهِ ثُمَّ قَالَ أَنَا أَبُو خَالِدٍ لَقِيتُهُ وَ اللَّهِ عِلْباً مُلَفِّقاً نَعَمْ قَدْ أَعْفَيْنَاكَ وَ اسْتَعْمَلْنَا عَلَيْهِ الْحَجَّاجَ بْنَ عَاصِمٍ .",
					"english": "Abu Ali Al Ashary, from Imran Bin Musa, from Muhammad Bin Al Husayn Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Ali Bin Uqba, from his father Uqba Bin Khalid who said, <br>‘Abu Abdullah (asws) said to me: ‘If you were Gaylan Bin Jamie and he seeks permission to see me (asws), so give permission to him, and it has reached me (asws) that he used to go over to the Clan of Hashim’.<br>So when he was seated, he said, ‘May Allah (azwj) Keep you (asws) well! I am Gaylan Bin Jamie Al Muharby, a judge of Ibn Hubeyra. He (the narrator) said, ‘I said, ‘O Gaylan! I did not think that Ibn Hubeyra would place upon his judgement, except for a jurist’. He said, ‘Yes’. I said, ‘O Gaylan! Do you bring togetherness between the man and his spouse?’ He said, ‘Yes’. I said, ‘And separation between the man and his spouse?’ He said, ‘Yes’. I said, ‘And you kill?’ He said, ‘Yes’. I said, ‘And you whip the legal penalties (Hadd)?’ He said, ‘Yes’. I said, ‘And you issue orders regarding the wealth of the orphans?’ He said, ‘Yes’. I said, ‘By the judgement of whom do you judge?’ He said, ‘By the judgement of Umar, and by the judgement of Ibn Masoud, and by judgement of Ibn Abbas, and I (also) judge from the judgements of Amir Al-Momineen (asws) with (some) things’.<br>He (the narrator) said, ‘I said, ‘O Gaylan! Are you all not thinking, O people of Iraq, and viewing that Rasool-Allah (saww) said: ‘Ali (asws) is your judge’?’ So he said, ‘Yes’. I said, ‘And how can you judge from the Judgements of Ali (asws) with some things, and Rasool-Allah (saww) has said; ‘Ali (asws) is your judge?’ He (the narrator) said, ‘And I said, ‘How come you are judging, O Gaylan?’ He said, ‘I write this down, whatever I have judged with, ‘So and so, son of so and so, for so and so, son of so and so, on such and such a day, from such a such a month, from such a such a year, then I place it in the registers’.<br>He (the narrator) said, ‘I said, ‘O Gaylan! This is the requirement from the judges, so how would you be saying when Allah (azwj) Gathers the formers ones and the later ones in one plain, then Finds you to have opposed the judgements of Rasool-Allah (saww) and Ali (asws)?’ So he swore by Allah (azwj) and sobbed loudly. I said, ‘O you man, economise with your tongue!<br>He (the narrator) said, ‘Then I proceeded to Al-Kufa. So I remained there for as long as Allah (azwj) so Desired to, then I heard a man from Al-Hayy discussing, and he was a friend of Ibn Hubeyra. He said, ‘BY Allah (azwj)! I was in his Ibn Hubeyra) presence one night when a guard came over, so he said, ‘This is Gaylan Bin Jamie. So he said, ‘Enter him’. He said, ‘So he entered. So he asked him, then said to him, ‘What is the state of the people. Inform me if the rope is turbulent for the one who has it’. He said, ‘I did not see anyone except for Ja’far (asws) Bin Muhammad (asws)’.<br>He said, ‘Inform me, what did you do with the wealth of the one who was with you, for it has reached me that he had sought it from you, but you refused?’ He said, ‘I swore an oath for him’. He said, ‘So you did not give it to him what he sought from you?’ He said, ‘I disliked that I should oppose you’. He said, ‘So I had asked you by Allah (azwj), ordering you that you should make him to be the first one’. He said, ‘Yes’. He said, ‘So did you do it?’ He said, ‘No’. He said, ‘So is this not opposing me in giving him the wealth, just as you opposed me so you made him to be the last of them? But, by Allah (azwj), had you done it, your mastership would not have moved away from you due to it, and a great need for you’. He said, ‘Free me’. He said, ‘Speak with your need’. He said, ‘Excuse me from being the judge’.<br>He (the narrator) said, ‘So he rolled up his sleeves, then said, ‘I am Abu Khalid. By Allah (azwj) you have met him as a concocter. Yes, we have excused you, and we have appointed over you, Al-Hajjaj Bin Aasim’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَبِي عَبْدِ اللَّهِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ عَبْدِ اللَّهِ بْنِ وَضَّاحٍ قَالَ كَانَتْ بَيْنِي وَ بَيْنَ رَجُلٍ مِنَ الْيَهُودِ مُعَامَلَةٌ فَخَانَنِي بِأَلْفِ دِرْهَمٍ فَقَدَّمْتُهُ إِلَى الْوَالِي فَأَحْلَفْتُهُ فَحَلَفَ وَ قَدْ عَلِمْتُ أَنَّهُ حَلَفَ يَمِيناً فَاجِرَةً فَوَقَعَ لَهُ بَعْدَ ذَلِكَ عِنْدِي أَرْبَاحٌ وَ دَرَاهِمُ كَثِيرَةٌ فَأَرَدْتُ أَنْ أَقْتَصَّ الْأَلْفَ دِرْهَمٍ الَّتِي كَانَتْ لِي عِنْدَهُ وَ حَلَفَ عَلَيْهَا<br>فَكَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) وَ أَخْبَرْتُهُ أَنِّي قَدْ أَحْلَفْتُهُ فَحَلَفَ وَ قَدْ وَقَعَ لَهُ عِنْدِي مَالٌ فَإِنْ أَمَرْتَنِي أَنْ آخُذَ مِنْهُ الْأَلْفَ دِرْهَمٍ الَّتِي حَلَفَ عَلَيْهَا فَعَلْتُ فَكَتَبَ ( عليه السلام ) لَا تَأْخُذْ مِنْهُ شَيْئاً إِنْ كَانَ قَدْ ظَلَمَكَ فَلَا تَظْلِمْهُ وَ لَوْ لَا أَنَّكَ رَضِيتَ بِيَمِينِهِ فَحَلَّفْتَهُ لَأَمَرْتُكَ أَنْ تَأْخُذَهَا مِنْ تَحْتِ يَدِكَ وَ لَكِنَّكَ رَضِيتَ بِيَمِينِهِ فَقَدْ مَضَتِ الْيَمِينُ بِمَا فِيهَا فَلَمْ آخُذْ مِنْهُ شَيْئاً وَ انْتَهَيْتُ إِلَى كِتَابِ أَبِي الْحَسَنِ ( عليه السلام ) .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abu Abdullah Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from Abdullah Bin Wazzah who said, <br>‘There was a deal between me and a man from the Jews, so he betrayed me by a thousand Dirhams. So I brought him to the governor, and he made him swear an oath, and I knew he had sworn a false oath. Then there occurred, after that, profits and many Dirhams. So I intended that I should avenge by a thousand Dirhams which were for me with him, and he had sworn over it.<br>So I wrote to Abu Al-Hassan (asws) and informed him (asws) that I have made him swear an oath, so he had sword, and there had occurred some wealth for him, with me. So If you (asws) were to order me that I should take a thousand Dirhams from it which he had sworn upon, so I would do it’. So he (asws) wrote: ‘Do not take anything from it. If he has been unjust to you, so you do not be unjust to him. And had it not been that you were pleased with him taking the oath, so he took it, I (asws) would have ordered you that you can take it from (what is) under your hand (control), but you were pleased with his oath. Thus the oath has gone with what was in it, therefore do not take anything from it’. And I was prevented by the letter of Abu Al-Hassan (asws)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْبَيِّنَةِ إِذَا أُقِيمَتْ عَلَى الْحَقِّ أَ يَحِلُّ لِلْقَاضِي أَنْ يَقْضِيَ بِقَوْلِ الْبَيِّنَةِ إِذَا لَمْ يَعْرِفْهُمْ مِنْ غَيْرِ مَسْأَلَةٍ قَالَ فَقَالَ خَمْسَةُ أَشْيَاءَ يَجِبُ عَلَى النَّاسِ أَنْ يَأْخُذُوا بِهَا ظَاهِرَ الْحُكْمِ الْوِلَايَاتُ وَ التَّنَاكُحُ وَ الْمَوَارِيثُ وَ الذَّبَائِحُ وَ الشَّهَادَاتُ فَإِذَا كَانَ ظَاهِرُهُ ظَاهِراً مَأْمُوناً جَازَتْ شَهَادَتُهُ وَ لَا يُسْأَلُ عَنْ بَاطِنِهِ .",
					"english": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from one of his men, <br>(It has been narrated) from Abu Abdullah (asws), said, ‘I asked him (asws) about the proof when it is established upon the truth, is it permissible for the judges to issue judgements by the proofs when they are not recognising without questioning it?’ So he (asws) said: ‘There are five things which are obligated upon the people that these can be taken by the apparent for the decision – the guardianship, and the marriage, and the inheritors, and the slaughtered animals, and the testimonies. So when its apparent appears to be reliable, his testimony is allowed, and its esoteric (Batin) would not be questioned’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ حَرِيزٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ دَفَعَ إِلَى رَجُلٍ أَلْفَ دِرْهَمٍ يَخْلِطُهَا بِمَالِهِ وَ يَتَّجِرُ بِهَا فَلَمَّا طَلَبَهَا مِنْهُ قَالَ ذَهَبَ الْمَالُ وَ كَانَ لِغَيْرِهِ مَعَهُ مِثْلُهَا وَ مَالٌ كَثِيرٌ لِغَيْرِ وَاحِدٍ فَقَالَ لَهُ كَيْفَ صَنَعَ أُولَئِكَ قَالَ أَخَذُوا أَمْوَالَهُمْ نَفَقَاتٍ فَقَالَ أَبُو جَعْفَرٍ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) جَمِيعاً يَرْجِعُ إِلَيْهِ بِمَالِهِ وَ يَرْجِعُ هُوَ عَلَى أُولَئِكَ بِمَا أَخَذُوا .",
					"english": "Muhammad Bin Yahya, from Ali Bin Ismail, from Muhammad Bin Amro, from Ali Bin Al Hassan, from Hareyz, from Abu Ubeyda who said, <br>‘I said to Abu Ja’far (asws) and Abu Abdullah (asws), ‘A man handed over a thousand Dirhams to a man who mixed it with his own wealth and did some business with it. So when he sought it from him, he said, ‘The wealth is gone, and there was for others (as well) with him, similar to it, and a lot of wealth for someone else’. So he said to him, ‘What did they do?’ So he said, ‘They took their wealth, expenses’. So Abu Ja’far (asws) and Abu Abdullah (asws) both said: ‘He has to return his wealth to him, and he has recourse to those with what they have taken’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَزِيدَ بْنِ إِسْحَاقَ عَنْ هَارُونَ بْنِ حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اسْتَأْجَرَ أَجِيراً فَلَمْ يَأْمَنْ أَحَدُهُمَا صَاحِبَهُ فَوَضَعَ الْأَجْرَ عَلَى يَدِ رَجُلٍ فَهَلَكَ ذَلِكَ الرَّجُلُ وَ لَمْ يَدَعْ وَفَاءً فَاسْتَهْلَكَ الْأَجْرُ فَقَالَ الْمُسْتَأْجِرُ ضَامِنٌ لِأَجْرِ الْأَجِيرِ حَتَّى يَقْضِيَ إِلَّا أَنْ يَكُونَ الْأَجِيرُ دَعَاهُ إِلَى ذَلِكَ فَرَضِيَ بِالرَّجُلِ فَإِنْ فَعَلَ فَحَقُّهُ حَيْثُ وَضَعَهُ وَ رَضِيَ بِهِ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Yazeed Bin Si’haq, from Haroun Bin Hamza who said, <br>‘I asked Abu Abdullah (asws) about a man who employed an employee. But, one of the two does not trust his companion, so the wages were placed upon a (third) man. So that man died, and did not get the wages paid. Thus the wages were destroyed. So he (asws) said: ‘The employer is responsible of the wages to the employee until it is paid, except if it so happened that the employee called for it to be that, so he was pleased with the (third) man (holding it). So if he did it, so his right would be wherever he placed it and was pleased with it’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ جَعْفَرٍ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ جَعْفَرِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الْمَرْأَةُ تَمُوتُ فَيَدَّعِي أَبُوهَا أَنَّهُ كَانَ أَعَارَهَا بَعْضَ مَا كَانَ عِنْدَهَا مِنْ مَتَاعٍ وَ خَدَمٍ أَ تُقْبَلُ دَعْوَاهُ بِلَا بَيِّنَةٍ أَمْ لَا تُقْبَلُ دَعْوَاهُ إِلَّا بِبَيِّنَةٍ فَكَتَبَ إِلَيْهِ يَجُوزُ بِلَا بَيِّنَةٍ<br>قَالَ وَ كَتَبْتُ إِلَيْهِ إِنِ ادَّعَى زَوْجُ الْمَرْأَةِ الْمَيِّتَةِ أَوْ أَبُو زَوْجِهَا أَوْ أُمُّ زَوْجِهَا فِي مَتَاعِهَا أَوْ [فِي] خَدَمِهَا مِثْلَ الَّذِي ادَّعَى أَبُوهَا مِنْ عَارِيَّةِ بَعْضِ الْمَتَاعِ أَوِ الْخَدَمِ أَ تَكُونُ فِي ذَلِكَ بِمَنْزِلَةِ الْأَبِ فِي الدَّعْوَى فَكَتَبَ ( عليه السلام ) لَا .",
					"english": "Muhammad Bin Ja’far Al Kufy, from Muhammad Bin Al Ismail, from Ja’far Bin Isa who said, <br>‘I wrote to Abu Al-Hassan (asws), ‘May I be sacrificed for you (asws)! The woman dies, so her father claims that he had lent to her what was with her, from the possessions, and a servant. Would his testimony be accepted for his claim without a proof, or his claim would not be acceptable except with the proof?’ So he (asws) wrote to him: ‘It is allowed without proof’.<br>He (asws) said: ‘And I wrote to him (asws) that if a husband of the deceased woman were to claim, or father of her husband, or mother of her husband, with regards to possessions, or regarding a servant, similar to what her father had claimed from having lent some of the possessions, or the servant. Would they be with regards to that, at the status of the father?’ So he (asws) wrote: ‘No’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أُتِيَ بِعَبْدٍ لِذِمِّيٍّ قَدْ أَسْلَمَ فَقَالَ اذْهَبُوا فَبِيعُوهُ مِنَ الْمُسْلِمِينَ وَ ادْفَعُوا ثَمَنَهُ إِلَى صَاحِبِهِ وَ لَا تُقِرُّوهُ عِنْدَهُ .",
					"english": "Muhammad Bin Yahya, raising it from Hammad Bin Isa, <br>(It has been narrated) from Abu Abdullah (asws) that they came to Amir Al-Momineen (asws) with a slave of a Zimmy (under the responsibility) who had become a Muslim. So he said: ‘Go and sell him to the Muslims and hand over his price to his owner, and do not leave him with him’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي جَمِيلَةَ عَنْ إِسْمَاعِيلَ بْنِ أَبِي إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ ضَمْرَةَ بْنِ أَبِي ضَمْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَحْكَامُ الْمُسْلِمِينَ عَلَى ثَلَاثَةٍ شَهَادَةٍ عَادِلَةٍ أَوْ يَمِينٍ قَاطِعَةٍ أَوْ سُنَّةٍ مَاضِيَةٍ مِنْ أَئِمَّةِ الْهُدَى .",
					"english": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Abu Jameela, from Ismail Bin Abu Idrees, from Al Husayn Bin Zamara Bin Abu Zamara, from his father, from his grandfather who said, <br>‘Amir Al-Momineen (asws) said: ‘The rulings of the Muslims are upon three – Just testimony, or a conclusive oath, or a past Sunnah of the Imams (asws) of the Guidance’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ قَالَ اخْتَصَمَ رَجُلَانِ إِلَى دَاوُدَ ( عليه السلام ) فِي بَقَرَةٍ فَجَاءَ هَذَا بِبَيِّنَةٍ عَلَى أَنَّهَا لَهُ وَ جَاءَ هَذَا بِبَيِّنَةٍ عَلَى أَنَّهَا لَهُ قَالَ فَدَخَلَ دَاوُدُ ( عليه السلام ) الْمِحْرَابَ فَقَالَ يَا رَبِّ إِنَّهُ قَدْ أَعْيَانِي أَنْ أَحْكُمَ بَيْنَ هَذَيْنِ فَكُنْ أَنْتَ الَّذِي تَحْكُمُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اخْرُجْ فَخُذِ الْبَقَرَةَ مِنْ الَّذِي فِي يَدِهِ فَادْفَعْهَا إِلَى الْآخَرِ وَ اضْرِبْ عُنُقَهُ<br>قَالَ فَضَجَّتْ بَنُو إِسْرَائِيلَ مِنْ ذَلِكَ وَ قَالُوا جَاءَ هَذَا بِبَيِّنَةٍ وَ جَاءَ هَذَا بِبَيِّنَةٍ وَ كَانَ أَحَقُّهُمْ بِإِعْطَائِهَا الَّذِي هِيَ فِي يَدِهِ فَأَخَذَهَا مِنْهُ وَ ضَرَبَ عُنُقَهُ وَ أَعْطَاهَا هَذَا<br>قَالَ فَدَخَلَ دَاوُدُ الْمِحْرَابَ فَقَالَ يَا رَبِّ قَدْ ضَجَّتْ بَنُو إِسْرَائِيلَ مِمَّا حَكَمْتَ بِهِ فَأَوْحَى إِلَيْهِ رَبُّهُ أَنَّ الَّذِي كَانَتِ الْبَقَرَةُ فِي يَدِهِ لَقِيَ أَبَا الْآخَرِ فَقَتَلَهُ وَ أَخَذَ الْبَقَرَةَ مِنْهُ فَإِذَا جَاءَكَ مِثْلُ هَذَا فَاحْكُمْ بَيْنَهُمْ بِمَا تَرَى وَ لَا تَسْأَلْنِي أَنْ أَحْكُمَ حَتَّى الْحِسَابِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Dawood Bin Farqad, <br>(It has been narrated) from Ismail son of Ja’far (asws) who said, ‘Two men disputed to Dawood (as) regarding a cow. So this one came with a proof upon that it belonged to him, and this one came with a proof that it belonged to him. So Dawood (as) entered into the Prayer niche, so he (as) said :’O Lord (azwj)! It has tired me (as) to judge between these two, so You (azwj) be the One Who Judged’. So Allah (azwj) Mighty and Majestic Revealed unto him (as): “Take the cow from the one in whose hand it is and hand it over to the other one, and strike off his neck”.<br>He (the narrator) said: ‘So the Children of Israel made a lot of noise from that, and they said: ‘This one came with the proof, and this one came with the proof, and it would have been more rightful of giving it to the one in whose hand it was, but he took it from him and struck off his neck, and gave it to this one’.<br>He (the narrator) said, ‘So Dawood (as) entered into the Prayer niche, so he (as) said: ‘O Lord (azwj)! The Children of Israel made a lot of noise from what I (as) judged with’. So his (as) Lord (azwj) Revealed unto him: “The one in whose hand was the cow met the father of the other one, so he killed him and seized the cow from him. So (from now on) when they come to you (as) with the likes of this, so judge between them with what you (as) see, and do not ask Me (azwj) that I (azwj) should Judge, until the Reckoning (Day of Judgement)’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ أَبِي شُعَيْبٍ الْمَحَامِلِيِّ الرِّفَاعِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَبَّلَ رَجُلًا أَنْ يَحْفِرَ لَهُ بِئْراً عَشْرَ قَامَاتٍ بِعَشَرَةِ دَرَاهِمَ فَحَفَرَ لَهُ قَامَةً ثُمَّ عَجَزَ قَالَ يُقْسَمُ عَشَرَةٌ عَلَى خَمْسَةٍ وَ خَمْسِينَ جُزْءاً فَمَا أَصَابَ وَاحِداً فَهُوَ لِلْقَامَةِ الْأُولَى وَ الِاثْنَانِ لِلثَّانِيَةِ وَ الثَّلَاثَةُ لِلثَّالِثَةِ عَلَى هَذَا الْحِسَابِ إِلَى عَشَرَةٍ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muawiya Bin Hukeym, from Abu Shuayb Al Mahamily Al Rafaiy who said, <br>‘I asked Abu Abdullah (asws) about a man who agreed with a man to dig a well for him ten statures deep for ten Dirhams. So he dug one stature for him, then was frustrated. He (asws) said: ‘The ten (Dirhams) would be divided upon fifty five parts. So whatever he does one so it is for the first stature, and two for the second, and three for the third, upon this accounting up to the ten’. (1+2+3+4+5+6+7+8+9+10 = 55)."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلَيْنِ ادَّعَيَا بَغْلَةً فَأَقَامَ أَحَدُهُمَا عَلَى صَاحِبِهِ شَاهِدَيْنِ وَ الْآخَرُ خَمْسَةً فَقَضَى لِصَاحِبِ الشُّهُودِ الْخَمْسَةِ خَمْسَةَ أَسْهُمٍ وَ لِصَاحِبِ الشَّاهِدَيْنِ سَهْمَيْنِ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, <br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Amir Al-Momineen (asws) said regarding two men who claimed a mule. So one of the two established two witnesses over his companion, and the other one, five. So he (asws) judged for the one with the five witnesses, five portions, and for the one with two witnesses, two portions’."
				}
			]
		]
	]
}