{
	"chapters": [
		[
			[
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ الْحَرِيرِيِّ عَنْ أَبِيهِ عَنْ سَعْدٍ الْخَفَّافِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَا سَعْدُ تَعَلَّمُوا الْقُرْآنَ فَإِنَّ الْقُرْآنَ يَأْتِي يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ صُورَةٍ نَظَرَ إِلَيْهَا الْخَلْقُ وَ النَّاسُ صُفُوفٌ عِشْرُونَ وَ مِائَةُ أَلْفِ صَفٍّ ثَمَانُونَ أَلْفَ صَفٍّ أُمَّةُ مُحَمَّدٍ وَ أَرْبَعُونَ أَلْفَ صَفٍّ مِنْ سَائِرِ الْأُمَم<br>َيَأْتِي عَلَى صَفِّ الْمُسْلِمِينَ فِي صُورَةِ رَجُلٍ فَيُسَلِّمُ فَيَنْظُرُونَ إِلَيْهِ ثُمَّ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ إِنَّ هَذَا الرَّجُلَ مِنَ الْمُسْلِمِينَ نَعْرِفُهُ بِنَعْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ كَانَ أَشَدَّ اجْتِهَاداً مِنَّا فِي الْقُرْآنِ فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْجَمَالِ وَ النُّورِ مَا لَمْ نُعْطَه<br>ُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ عَلَى صَفِّ الشُّهَدَاءِ فَيَنْظُرُونَ إِلَيْهِ الشُّهَدَاءُ ثُمَّ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الرَّبُّ الرَّحِيمُ إِنَّ هَذَا الرَّجُلَ مِنَ الشُّهَدَاءِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ مِنْ شُهَدَاءِ الْبَحْرِ فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْفَضْلِ مَا لَمْ نُعْطَه<br>َالَ فَيَتَجَاوَزُ حَتَّى يَأْتِيَ عَلَى صَفِّ شُهَدَاءِ الْبَحْرِ فِي صُورَةِ شَهِيدٍ فَيَنْظُرُ إِلَيْهِ شُهَدَاءُ الْبَحْرِ فَيَكْثُرُ تَعَجُّبُهُمْ وَ يَقُولُونَ إِنَّ هَذَا مِنْ شُهَدَاءِ الْبَحْرِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّ الْجَزِيرَةَ الَّتِي أُصِيبَ فِيهَا كَانَتْ أَعْظَمَ هَوْلًا مِنَ الْجَزِيرَةِ الَّتِي أُصِبْنَا فِيهَا فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْجَمَالِ وَ النُّورِ مَا لَمْ نُعْطَه<br>ُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ صَفَّ النَّبِيِّينَ وَ الْمُرْسَلِينَ فِي صُورَةِ نَبِيٍّ مُرْسَلٍ فَيَنْظُرُ النَّبِيُّونَ وَ الْمُرْسَلُونَ إِلَيْهِ فَيَشْتَدُّ لِذَلِكَ تَعَجُّبُهُمْ وَ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ إِنَّ هَذَا النَّبِيَّ مُرْسَلٌ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ أُعْطِيَ فَضْلًا كَثِيرا<br>َالَ فَيَجْتَمِعُونَ فَيَأْتُونَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَسْأَلُونَهُ وَ يَقُولُونَ يَا مُحَمَّدُ مَنْ هَذَا فَيَقُولُ لَهُمْ أَ وَ مَا تَعْرِفُونَهُ فَيَقُولُونَ مَا نَعْرِفُهُ هَذَا مِمَّنْ لَمْ يَغْضَبِ اللَّهُ عَلَيْهِ فَيَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هَذَا حُجَّةُ اللَّهِ عَلَى خَلْقِهِ فَيُسَلِّم<br>ُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ عَلَى صَفِّ الْمَلَائِكَةِ فِي سُورَةِ مَلَكٍ مُقَرَّبٍ فَتَنْظُرُ إِلَيْهِ الْمَلَائِكَةُ فَيَشْتَدُّ تَعَجُّبُهُمْ وَ يَكْبُرُ ذَلِكَ عَلَيْهِمْ لِمَا رَأَوْا مِنْ فَضْلِهِ وَ يَقُولُونَ تَعَالَى رَبُّنَا وَ تَقَدَّسَ إِنَّ هَذَا الْعَبْدَ مِنَ الْمَلَائِكَةِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ كَانَ أَقْرَبَ الْمَلَائِكَةِ إِلَى اللَّهِ عَزَّ وَ جَلَّ مَقَاماً فَمِنْ هُنَاكَ أُلْبِسَ مِنَ النُّورِ وَ الْجَمَالِ مَا لَمْ نُلْبَس<br>ُمَّ يُجَاوِزُ حَتَّى يَنْتَهِيَ إِلَى رَبِّ الْعِزَّةِ تَبَارَكَ وَ تَعَالَى فَيَخِرُّ تَحْتَ الْعَرْشِ فَيُنَادِيهِ تَبَارَكَ وَ تَعَالَى يَا حُجَّتِي فِي الْأَرْضِ وَ كَلَامِيَ الصَّادِقَ النَّاطِقَ ارْفَعْ رَأْسَكَ وَ سَلْ تُعْطَ وَ اشْفَعْ تُشَفَّع<br>َيَرْفَعُ رَأْسَهُ فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى كَيْفَ رَأَيْتَ عِبَادِي فَيَقُولُ يَا رَبِّ مِنْهُمْ مَنْ صَانَنِي وَ حَافَظَ عَلَيَّ وَ لَمْ يُضَيِّعْ شَيْئاً وَ مِنْهُمْ مَنْ ضَيَّعَنِي وَ اسْتَخَفَّ بِحَقِّي وَ كَذَّبَ بِي وَ أَنَا حُجَّتُكَ عَلَى جَمِيعِ خَلْقِك<br>َيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ عِزَّتِي وَ جَلَالِي وَ ارْتِفَاعِ مَكَانِي لَأُثِيبَنَّ عَلَيْكَ الْيَوْمَ أَحْسَنَ الثَّوَابِ وَ لَأُعَاقِبَنَّ عَلَيْكَ الْيَوْمَ أَلِيمَ الْعِقَاب<br>َالَ فَيَرْجِعُ الْقُرْآنُ رَأْسَهُ فِي صُورَةٍ أُخْرَى قَالَ فَقُلْتُ لَهُ يَا أَبَا جَعْفَرٍ فِي أَيِّ صُورَةٍ يَرْجِعُ قَالَ فِي صُورَةِ رَجُلٍ شَاحِبٍ مُتَغَيِّرٍ يُبْصِرُهُ أَهْلُ الْجَمْعِ فَيَأْتِي الرَّجُلَ مِنْ شِيعَتِنَا الَّذِي كَانَ يَعْرِفُهُ وَ يُجَادِلُ بِهِ أَهْلَ الْخِلَافِ فَيَقُومُ بَيْنَ يَدَيْهِ فَيَقُولُ مَا تَعْرِفُنِي فَيَنْظُرُ إِلَيْهِ الرَّجُلُ فَيَقُولُ مَا أَعْرِفُكَ يَا عَبْدَ اللَّه<br>َالَ فَيَرْجِعُ فِي صُورَتِهِ الَّتِي كَانَتْ فِي الْخَلْقِ الْأَوَّلِ وَ يَقُولُ مَا تَعْرِفُنِي فَيَقُولُ نَعَمْ فَيَقُولُ الْقُرْآنُ أَنَا الَّذِي أَسْهَرْتُ لَيْلَكَ وَ أَنْصَبْتُ عَيْشَكَ سَمِعْتَ الْأَذَى وَ رُجِمْتَ بِالْقَوْلِ فِيَّ أَلَا وَ إِنَّ كُلَّ تَاجِرٍ قَدِ اسْتَوْفَى تِجَارَتَهُ وَ أَنَا وَرَاءَكَ الْيَوْم<br>َالَ فَيَنْطَلِقُ بِهِ إِلَى رَبِّ الْعِزَّةِ تَبَارَكَ وَ تَعَالَى فَيَقُولُ يَا رَبِّ يَا رَبِّ عَبْدُكَ وَ أَنْتَ أَعْلَمُ بِهِ قَدْ كَانَ نَصِباً فِيَّ مُوَاظِباً عَلَيَّ يُعَادَى بِسَبَبِي وَ يُحِبُّ فِيَّ وَ يُبْغِضُ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ أَدْخِلُوا عَبْدِي جَنَّتِي وَ اكْسُوهُ حُلَّةً مِنْ حُلَلِ الْجَنَّةَ وَ تَوِّجُوهُ بِتَاج<br>َإِذَا فُعِلَ بِهِ ذَلِكَ عُرِضَ عَلَى الْقُرْآنِ فَيُقَالُ لَهُ هَلْ رَضِيتَ بِمَا صُنِعَ بِوَلِيِّكَ فَيَقُولُ يَا رَبِّ إِنِّي أَسْتَقِلُّ هَذَا لَهُ فَزِدْهُ مَزِيدَ الْخَيْرِ كُلِّهِ فَيَقُولُ وَ عِزَّتِي وَ جَلَالِي وَ عُلُوِّي وَ ارْتِفَاعِ مَكَانِي لَأَنْحَلَنَّ لَهُ الْيَوْمَ خَمْسَةَ أَشْيَاءَ مَعَ الْمَزِيدِ لَهُ وَ لِمَنْ كَانَ بِمَنْزِلَتِهِ أَلَا إِنَّهُمْ شَبَابٌ لَا يَهْرَمُونَ وَ أَصِحَّاءُ لَا يَسْقُمُونَ وَ أَغْنِيَاءُ لَا يَفْتَقِرُونَ وَ فَرِحُونَ لَا يَحْزَنُونَ وَ أَحْيَاءٌ لَا يَمُوتُون<br>ُمَّ تَلَا هَذِهِ الْآيَةَ لا يَذُوقُونَ فِيهَا الْمَوْتَ إِلَّا الْمَوْتَةَ الْأُولى قَالَ قُلْتُ جُعِلْتُ فِدَاكَ يَا أَبَا جَعْفَرٍ وَ هَلْ يَتَكَلَّمُ الْقُرْآنُ فَتَبَسَّمَ ثُمَّ قَالَ رَحِمَ اللَّهُ الضُّعَفَاءَ مِنْ شِيعَتِنَا إِنَّهُمْ أَهْلُ تَسْلِيمٍ ثُمَّ قَالَ نَعَمْ يَا سَعْدُ وَ الصَّلَاةُ تَتَكَلَّمُ وَ لَهَا صُورَةٌ وَ خَلْقٌ تَأْمُرُ وَ تَنْهَ<br>َالَ سَعْدٌ فَتَغَيَّرَ لِذَلِكَ لَوْنِي وَ قُلْتُ هَذَا شَيْ‏ءٌ لَا أَسْتَطِيعُ أَنَا أَتَكَلَّمُ بِهِ فِي النَّاسِ فَقَالَ أَبُو جَعْفَرٍ وَ هَلِ النَّاسُ إِلَّا شِيعَتُنَا فَمَنْ لَمْ يَعْرِفِ الصَّلَاةَ فَقَدْ أَنْكَرَ حَقَّنَ<br>ُمَّ قَالَ يَا سَعْدُ أُسْمِعُكَ كَلَامَ الْقُرْآنِ قَالَ سَعْدٌ فَقُلْتُ بَلَى صَلَّى اللَّهُ عَلَيْكَ فَقَالَ .<br>إِنَّ الصَّلاةَ تَنْهى عَنِ الْفَحْشاءِ وَ الْمُنْكَرِ وَ لَذِكْرُ اللَّهِ أَكْبَر<br>َالنَّهْيُ كَلَامٌ وَ الْفَحْشَاءُ وَ الْمُنْكَرُ رِجَالٌ وَ نَحْنُ ذِكْرُ اللَّهِ وَ نَحْنُ أَكْبَر<br>",
					"english": "Ali Bin Muhammad, from Ali Bin Al Abbas, from Al Husayn Bin Abdul Rahman, from Sufyan Al Hareyri, from his father, from Sa’ad Al Khaffaf,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘O Sa’ad! Learn the Quran, for the Quran would come on the Day of Judgment in an excellent image. The creatures would look at it, and the people would be in one hundred and twenty thousand rows – eighty thousand rows being the community of Muhammad (saww), and forty thousand rows from the rest of the communities.<br>So it would come to the rows of the Muslims in an image of a man, and it would greet. So they would be looking at him, then they would be saying, ‘There is no god except Allah (azwj), the Forbearing, the Benevolent. This man is from the Muslims. We recognise him by his appearance and his description, apart from that he was of a more intense striving than us in the Quran, so from over there he has been Given from the splendour, and the beauty, and the radiance what we have not been Given’.<br>Then he would cross over until he comes to the rows of the martyrs. So the martyrs would be looking at him, then they would be saying, ‘There is no god except Allah (azwj), the Lord (azwj), the Merciful. This man is from the martyrs. We recognise him by his appearance and his qualities, apart from that he is from the martyrs of the sea, for from over there he has been Given from the splendour and the superiority what he was not been Given’.<br>He (asws) said: ‘So he would cross over until he comes to the rows of the martyrs of the sea in an image of a martyr. So the martyrs of the sea would look at him and would frequent in wonderment, and they would be saying, ‘This one is from the martyrs of the sea. We recognise him by his appearance and his qualities, apart from that the island in which he was hit would have been of a more grievous terror than the island in which we were hit. So from over there, he was Given from the splendour, and the beauty, and the radiance what we have not been Given’.<br>Then he would cross over until he comes to the rows of the Prophets (as) and the Mursil Prophets (as) in an image of a Mursil Prophet (as). So the Prophets (as) and the Mursil Prophets (as) would be looking at him, and their (as) wonderment would intensify due to that, and they would be saying: ‘There is no god except Allah (azwj), the Forbearing, the Benevolent. This is a Mursil Prophet. We recognise him by his appearance and his qualities, apart from that he has been Given a lot of merits’.<br>  <br>So they (as) would be gathering together, and they (as) would be coming to Rasool-Allah (saww), and they (as) would be asking him (saww): ‘O Muhammad (saww)! Who is this?’ So he (saww) would be saying to them: ‘Or are you (as) all not recognising him?’ So they (as) would be saying: ‘We (as) do not recognise him. This is from the one whom Allah (azwj) is not Angered upon’. So Rasool-Allah (saww) would be saying: ‘This is a Proof of Allah (azwj) upon His (azwj) creatures, so greet him’.<br>Then he would cross over until he comes to the rows of the Angels in an image of an Angel of Proximity. So the Angels would look at him and their wonderment would intensify, and that would be a great thing upon them due to what they see from his merits, and they would be saying: ‘Exalted is our Lord (azwj) and Holy! This is the servant from the Angels. We recognise him by his appearance and his qualities, apart from that he was the closest of the Angels to Allah (azwj) Mighty and Majestic in status, so from over there he was Clothed from the radiance and the beauty what we have not been Clothed in’.<br>Then he would cross over until he ends up to the Lord (azwj) of the Might, the Blessed and Exalted. So he would prostrate beneath the Throne. So the Blessed and High would Call out to him: “O My (azwj) Proof in the earth, and My (azwj) Truthful Speech, the Speaker! Raise your head and ask, you will be Given, and interceded, your intercession will be Accepted!”<br>So he would raise his head, and Allah (azwj) Blessed and High would be saying: “How did you see My (azwj) servants to be?” So he would be saying: ‘O Lord (azwj)! From them were the ones who safeguarded me and memorised me, and did not waste anything; and from them were the one who wasted me and took lightly with my rights, and belief with me, and I am Your (azwj) Proof upon the entirety of Your (azwj) creatures’.<br>So Allah (azwj) Blessed and High would be Saying: “By My (azwj) Might and the Loftiness of My (azwj) Position! Today I (azwj) shall be Rewarding with the most excellent of Rewards based upon you, and today I (azwj) shall be Punishing with the most painful of the Punishments based upon you”.<br>He (asws) said: ‘So the Quran would be returning its head to be in another image’. I said to him (asws), ‘O Abu Ja’far (asws)! In which image would it return to be?’ He (asws) said: ‘In a changed image of a pale man. The people gathered would look at him, and he would go over to a man from our Shias whom he would recognise the one who used to argue by him against the adversaries. So he would pause in front of him and he would be saying: ‘Do you not recognise me?’ So the man would look at him and he would be saying, ‘I do not recognise you, O servant of Allah (azwj)!’<br>He (asws) said: ‘So it would return to be in its image which it used to be among the former creatures, and it would be saying: ‘Do you not recognise me (even now)?’ So he would be saying, ‘Yes (I do now)’. So the Quran would be saying: ‘I am that which you held a vigil with for your nights, and your life was concentrated upon listening to the hurtful things and you were pelted with the words regarding me. Indeed! And every trader would be fulfilled his trade, and I would be your backer today’.<br>He (asws) said: ‘So it would go with him to the Lord (azwj) of Might, the Blessed and Exalted, and it would be saying: ‘O Lord (azwj)! O Lord (azwj)! Your (azwj) servant, and You (azwj) are more Knowing with him, he was hard-working regarding me, and had established animosity due to my reason, and he was loving and hating regarding me. So Allah (azwj) Mighty and Majestic would be Saying: “Enter My (azwj) servant into My (azwj) Paradise, and Clothe him with garments and ornaments of the Paradise, and crown him with a crown’.<br>So when that would be done with him, he would be displayed to the Quran, so He (azwj) would be Saying to it: ‘Are you pleased with what I (azwj) have done with your friend?’ So it would be saying: ‘O Lord (azwj)! I consider this to be little for him, therefore Increase it more with the goodness, all of it’. So He (azwj) would be Saying: “By My (azwj) Might and My (azwj) Majesty and My (azwj) Exaltedness and the Loftiness of My (azwj) Position! I (azwj) shall Permit five things to be for him, along with the increase for him and for the ones who were at his status. Indeed! He shall be a youth and would not be growing old, and he shall be healthy and would not be getting any sickness, and he shall be rich and would not be impoverished, and he shall be happy and would not be grieving, and he shall live and would not be dying”.<br>Then the Imam (asws) recited this Verse [44:56] They shall not taste therein death except for the first death. I said, ‘May I be sacrificed for you (asws), O Abu Ja’far (asws)! And would the Quran be speaking?’ So he (asws) smiled, then said: ‘May Allah (azwj) be Merciful upon the weak ones (of understanding) from our (asws) Shias. They are people of the submission’. Then he (asws) said: ‘Yes, O Sa’ad! And the Salāt would (also) be speaking, and for it there would be an image, and a shape. It would enjoin and forbid’.<br>‏<br>Sa’ad said, ‘So my colour changed due to that, and I said, ‘This is something I do not have the capacity to speak with among the people’. So Abu Ja’far (asws) said: ‘And are the people except for our (asws) Shias? So the one who does not recognise the Salāt, so he has denied our (asws) rights’.<br>Then he (asws) said: ‘O Sa’ad! Shall I (asws) make you hear the speech of the Quran?’ So I said, ‘Yes, O son (asws) of Rasool-Allah (saww)!’ So he (asws) said:<br>‘[29:45] surely, Salāt prevents from the immoralities and evil, and the Remembrance of Allah is the greatest.<br>So the prevention is a speech, and the immoralities and the evil are (two) men, and we (asws) are the Remembrance of Allah (azwj), and we (asws) are the greatest’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّهَا النَّاسُ إِنَّكُمْ فِي دَارِ هُدْنَةٍ وَ أَنْتُمْ عَلَى ظَهْرِ سَفَرٍ وَ السَّيْرُ بِكُمْ سَرِيعٌ وَ قَدْ رَأَيْتُمُ اللَّيْلَ وَ النَّهَارَ وَ الشَّمْسَ وَ الْقَمَرَ يُبْلِيَانِ كُلَّ جَدِيدٍ وَ يُقَرِّبَانِ كُلَّ بَعِيدٍ وَ يَأْتِيَانِ بِكُلِّ مَوْعُودٍ فَأَعِدُّوا الْجَهَازَ لِبُعْدِ الْمَجَاز<br>َالَ فَقَامَ الْمِقْدَادُ بْنُ الْأَسْوَدِ فَقَالَ يَا رَسُولَ اللَّهِ وَ مَا دَارُ الْهُدْنَةِ قَالَ دَارُ بَلَاغٍ وَ انْقِطَاعٍ فَإِذَا الْتَبَسَتْ عَلَيْكُمُ الْفِتَنُ كَقِطَعِ اللَّيْلِ الْمُظْلِمِ فَعَلَيْكُمْ بِالْقُرْآنِ فَإِنَّهُ شَافِعٌ مُشَفَّعٌ وَ مَاحِلٌ مُصَدَّقٌ وَ مَنْ جَعَلَهُ أَمَامَهُ قَادَهُ إِلَى الْجَنَّةِ وَ مَنْ جَعَلَهُ خَلْفَهُ سَاقَهُ إِلَى النَّارِ وَ هُوَ الدَّلِيلُ يَدُلُّ عَلَى خَيْرِ سَبِيل<br>َ هُوَ كِتَابٌ فِيهِ تَفْصِيلٌ وَ بَيَانٌ وَ تَحْصِيلٌ وَ هُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ وَ لَهُ ظَهْرٌ وَ بَطْنٌ فَظَاهِرُهُ حُكْمٌ وَ بَاطِنُهُ عِلْمٌ ظَاهِرُهُ أَنِيقٌ وَ بَاطِنُهُ عَمِيقٌ لَهُ نُجُومٌ وَ عَلَى نُجُومِهِ نُجُومٌ لَا تُحْصَى عَجَائِبُهُ وَ لَا تُبْلَى غَرَائِبُه<br>ِيهِ مَصَابِيحُ الْهُدَى وَ مَنَارُ الْحِكْمَةِ وَ دَلِيلٌ عَلَى الْمَعْرِفَةِ لِمَنْ عَرَفَ الصِّفَةَ فَلْيَجْلُ جَالٍ بَصَرَهُ وَ لْيُبْلِغِ الصِّفَةَ نَظَرَهُ يَنْجُ مِنْ عَطَبٍ وَ يَتَخَلَّصْ مِنْ نَشَبٍ فَإِنَّ التَّفَكُّرَ حَيَاةُ قَلْبِ الْبَصِيرِ كَمَا يَمْشِي الْمُسْتَنِيرُ فِي الظُّلُمَاتِ بِالنُّورِ فَعَلَيْكُمْ بِحُسْنِ التَّخَلُّصِ وَ قِلَّةِ التَّرَبُّصِ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws), from his (asws) forefathers (asws) having said: ‘Rasool-Allah (saww) said: ‘O you people! You are in a house of truce, and you are upon the back of a journey and the travel is quick with you, and you have seen the night and the day, and the sun and the moon turning every new (thing) into old, and every remote (thing) to be close by, and every promised (thing) has come up, therefore prepare the ship (of life) for the long passageway’.<br>So Al-Miqdad Bin al-Aswad (ra) arose and said, ‘O Rasool-Allah (saww)! And what is the house of truce?’ He (saww) said: ‘A house of communication and interruption. So when the strife confuses upon you like the interruption of the dark night, so upon you is to be with the Quran, for it is an interceder who would be interceded with, and an inviter who would be ratified; and the one who makes it to be in front of him, it would Guide him to the Paradise, and the one who makes it to be behind him, it would usher him into the Fire, and it is a pointer upon the best way.<br>And it is a Book wherein is detail, and explanation, and achievement, and it is the detail not being with the amusement; and for it there is an apparent and a hidden (meaning). So it’s apparent is wisdom, and its hidden is knowledge. Its apparent is profound, and its hidden is bottomless. There are luminaries for it, and upon its luminaries, are (more) luminaries. Neither can its wonderments be counted nor do its marvels wear out.<br>Therein are lanterns of guidance, and minarets of wisdom, and it evidences upon the recognition to the one (asws) who understands the capacity, so it brightens the brightness of his insight and lets his look reach the capacity. It rescues from the corruption and finishes off from the entanglements, for the pondering is a revival of the heart of insight just as the enlightened one walks in the darkness with the light. Therefore, it is upon you with the excellent sincerity and without having second thoughts’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْعَزِيزَ الْجَبَّارَ أَنْزَلَ عَلَيْكُمْ كِتَابَهُ وَ هُوَ الصَّادِقُ الْبَارُّ فِيهِ خَبَرُكُمْ وَ خَبَرُ مَنْ قَبْلَكُمْ وَ خَبَرُ مَنْ بَعْدَكُمْ وَ خَبَرُ السَّمَاءِ وَ الْأَرْضِ وَ لَوْ أَتَاكُمْ مَنْ يُخْبِرُكُمْ عَنْ ذَلِكَ لَتَعَجَّبْتُمْ .",
					"english": "Ali, from his father, from Abdullah Bin Al Mugheira, from Sama’at Bin Mihran who said,<br>‘Abu Abdullah (asws) said: ‘The Mighty, the Compeller Sent down His (azwj) Book upon you all, and it is the truthful and righteous. Therein is your news, and the news of the ones before you, and news of the ones (to come) after you, and news of the sky and the earth. And if someone were to come to you informing you all about that, it would have astonished you all’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَا أَوَّلُ وَافِدٍ عَلَى الْعَزِيزِ الْجَبَّارِ يَوْمَ الْقِيَامَةِ وَ كِتَابُهُ وَ أَهْلُ بَيْتِي ثُمَّ أُمَّتِي ثُمَّ أَسْأَلُهُمْ مَا فَعَلْتُمْ بِكِتَابِ اللَّهِ وَ بِأَهْلِ بَيْتِي .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Abu Al Jaroud who said,<br>‘Abu Ja’far (asws) said: ‘Rasool-Allah (saww) said: ‘I (saww) would be the first delegate to the Mighty, the Compeller, on the Day of Judgment, and (and so would be) His (azwj) Book, and the People (asws) of my (saww) Household. Then it would be my (saww) community, then I (saww) would ask them what they did with the Book of Allah (azwj) and with the People (asws) of my (saww) Household’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ هَذَا الْقُرْآنَ فِيهِ مَنَارُ الْهُدَى وَ مَصَابِيحُ الدُّجَى فَلْيَجْلُ جَالٍ بَصَرَهُ وَ يَفْتَحُ لِلضِّيَاءِ نَظَرَهُ فَإِنَّ التَّفَكُّرَ حَيَاةُ قَلْبِ الْبَصِيرِ كَمَا يَمْشِي الْمُسْتَنِيرُ فِي الظُّلُمَاتِ بِالنُّورِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ahmad Bin Yahya, from Talha Bin Zayd,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘This Quran, in it are minarets of guidance, and lanterns for the darkness. So let him brighten the brightness of his vision and open his vision for the illumination, for the pondering is a revival for the insight of ‘’ (wisdom sometimes also translated as the heart) just as the enlightened one would walk in ‘’ the darkness with the light’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ فِي وَصِيَّةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَصْحَابَهُ اعْلَمُوا أَنَّ الْقُرْآنَ هُدَى النَّهَارِ وَ نُورُ اللَّيْلِ الْمُظْلِمِ عَلَى مَا كَانَ مِنْ جَهْدٍ وَ فَاقَةٍ .",
					"english": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Jameela who said,<br>‘Abu Abdullah (asws) said: ‘It was in the bequest of Amir Al-Momineen (asws) to his (asws) companions: ‘Know that the Quran is a Guidance for the day, and light for the dark night, upon the one who was from a striving one and destitution’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ شَكَا رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) وَجَعاً فِي صَدْرِهِ فَقَالَ ( صلى الله عليه وآله ) اسْتَشْفِ بِالْقُرْآنِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ شِفاءٌ لِما فِي الصُّدُور.",
					"english": "Ali, from his father, from Al Nowfaly, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws), from his (asws) forefathers (asws) having said: ‘A man complained to the Prophet (saww) of pain in his chest, so he (saww) said: ‘Seek healing with the Quran, for Allah (azwj) Mighty and Majestic is Saying [10:57] and a Healing for what is in the chests’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْخَشَّابِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ اللَّهِ لَا يَرْجِعُ الْأَمْرُ وَ الْخِلَافَةُ إِلَى آلِ أَبِي بَكْرٍ وَ عُمَرَ أَبَداً وَ لَا إِلَى بَنِي أُمَيَّةَ أَبَداً وَ لَا فِي وُلْدِ طَلْحَةَ وَ الزُّبَيْرِ أَبَداً وَ ذَلِكَ أَنَّهُمْ نَبَذُوا الْقُرْآنَ وَ أَبْطَلُوا السُّنَنَ وَ عَطَّلُوا الْأَحْكَام<br>َ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْقُرْآنُ هُدًى مِنَ الضَّلَالِ وَ تِبْيَانٌ مِنَ الْعَمَى وَ اسْتِقَالَةٌ مِنَ الْعَثْرَةِ وَ نُورٌ مِنَ الظُّلْمَةِ وَ ضِيَاءٌ مِنَ الْأَحْدَاثِ وَ عِصْمَةٌ مِنَ الْهَلَكَةِ وَ رُشْدٌ مِنَ الْغَوَايَةِ وَ بَيَانٌ مِنَ الْفِتَنِ وَ بَلَاغٌ مِنَ الدُّنْيَا إِلَى الْآخِرَةِ وَ فِيهِ كَمَالُ دِينِكُمْ وَ مَا عَدَلَ أَحَدٌ عَنِ الْقُرْآنِ إِلَّا إِلَى النَّارِ .",
					"english": "Abu Ali Al Ashary, from one of his companions, from Al Khashhab, raising it, said,<br>‘Abu Abdullah (asws) said: ‘No, by Allah (azwj)! Neither will the command nor the Caliphate return to Abu Bakr, and Umar, ever, nor to the Clan of Umayya, ever, nor to be among the children of Talha and Al-Zubeyr, ever, and that is because they discarded the Quran, and invalidated the Sunnah, and disrupted the judgments.<br>And Rasool-Allah (saww) said: ‘The Quran is a Guidance from the straying, and is a clarity from the blindness, and a stability from the stumbling, and a light from the darkness, and an illumination from the newly-occurring events, and an infallibility from the destruction, and a reasoning from the temptation, and an explanation from the strife, and an achievement from the world to the Hereafter; and therein is perfection of your Religion, and no one would deviate from the Quran except to the Fire’’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْقُرْآنَ زَاجِرٌ وَ آمِرٌ يَأْمُرُ بِالْجَنَّةِ وَ يَزْجُرُ عَنِ النَّارِ .",
					"english": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer who said,<br>‘I heard Abu Abdullah (asws) saying: ‘The Quran Prohibits and is a Commander. It Commands with (going to) the Paradise and Prohibits from (going to) the Fire’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أُعْطِيتُ السُّوَرَ الطِّوَالَ مَكَانَ التَّوْرَاةِ وَ أُعْطِيتُ الْمِئِينَ مَكَانَ الْإِنْجِيلِ وَ أُعْطِيتُ الْمَثَانِيَ مَكَانَ الزَّبُورِ وَ فُضِّلْتُ بِالْمُفَصَّلِ ثَمَانٌ وَ سِتُّونَ سُورَةً وَ هُوَ مُهَيْمِنٌ عَلَى سَائِرِ الْكُتُبِ وَ التَّوْرَاةُ لِمُوسَى وَ الْإِنْجِيلُ لِعِيسَى وَ الزَّبُورُ لِدَاوُدَ .",
					"english": "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Sa’ad Al Askaf who said,<br>‘Rasool-Allah (saww) said: ‘I (saww) have been Given the lengthy Chapters in place of the Torah, and I (saww) have been Given the (Chapter of) one hundred (Verses) in place of the Evangel, and I (saww) have been Given the Double (Surah Al-Fatiha) in place of the Psalms, and I (saww) have been Preferred with the detail of sixty eight Chapters, and these are the pre-dominant upon the rest of the Book; and the Torah is for Musa (as) and the Evangel is for Isa (as), and the Psalms is for Dawood (as)’’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَجِي‏ءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ مَنْظُورٍ إِلَيْهِ صُورَةً فَيَمُرُّ بِالْمُسْلِمِينَ فَيَقُولُونَ هَذَا الرَّجُلُ مِنَّا فَيُجَاوِزُهُمْ إِلَى النَّبِيِّينَ فَيَقُولُونَ هُوَ مِنَّا فَيُجَاوِزُهُمْ إِلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ فَيَقُولُونَ هُوَ مِنَّا حَتَّى يَنْتَهِيَ إِلَى رَبِّ الْعِزَّةِ عَزَّ وَ جَلَّ فَيَقُولُ يَا رَبِّ فُلَانُ بْنُ فُلَانٍ أَظْمَأْتُ هَوَاجِرَهُ وَ أَسْهَرْتُ لَيْلَهُ فِي دَارِ الدُّنْيَا وَ فُلَانُ بْنُ فُلَانٍ لَمْ أُظْمِئْ هَوَاجِرَهُ وَ لَمْ أُسْهِرْ لَيْلَه<br>َيَقُولُ تَبَارَكَ وَ تَعَالَى أَدْخِلْهُمُ الْجَنَّةَ عَلَى مَنَازِلِهِمْ فَيَقُومُ فَيَتَّبِعُونَهُ فَيَقُولُ لِلْمُؤْمِنِ اقْرَأْ وَ ارْقَهْ قَالَ فَيَقْرَأُ وَ يَرْقَى حَتَّى يَبْلُغَ كُلُّ رَجُلٍ مِنْهُمْ مَنْزِلَتَهُ الَّتِي هِيَ لَهُ فَيَنْزِلُهَا .",
					"english": "‏<br>Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The Quran will come on the Day of Judgment in the best perspective of the image. So it would pass by the Muslims, and they would be saying, ‘This is the man from us’. So it would go past them to the Prophets (as), and they (as) would be saying: ‘He is from us’. So it would go past them to the Angels of Proximity, and they would be saying: ‘He is from us’; to the extent that it would end up to the Lord (azwj) of the Honour, Mighty and Majestic and it would be saying: ‘O Lord (azwj)! So and so, son of so and so, his mouth was thirsty, and he observed vigils during his nights in the house of the world; and so and so, son of so and so, his mouth was not thirsty and he did not observe vigils during his night’.<br>So the Blessed and High would be Saying: “Enter them into the Paradise upon their (relevant) status. So they would be arising and following it. So it would be Saying to the Momin: ‘Recite and ascend’. He (asws) said: ‘So he (the Momin) would recite and ascend until each man from them would reach his dwelling which is for him, so it would lodge him (therein)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الدَّوَاوِينَ يَوْمَ الْقِيَامَةِ ثَلَاثَةٌ دِيوَانٌ فِيهِ النِّعَمُ وَ دِيوَانٌ فِيهِ الْحَسَنَاتُ وَ دِيوَانٌ فِيهِ السَّيِّئَاتُ فَيُقَابَلُ بَيْنَ دِيوَانِ النِّعَمِ وَ دِيوَانِ الْحَسَنَات<br>َتَسْتَغْرِقُ النِّعَمُ عَامَّةَ الْحَسَنَاتِ وَ يَبْقَى دِيوَانُ السَّيِّئَاتِ فَيُدْعَى بِابْنِ آدَمَ الْمُؤْمِنِ لِلْحِسَابِ فَيَتَقَدَّمُ الْقُرْآنُ أَمَامَهُ فِي أَحْسَنِ صُورَةٍ فَيَقُولُ يَا رَبِّ أَنَا الْقُرْآنُ وَ هَذَا عَبْدُكَ الْمُؤْمِنُ قَدْ كَانَ يُتْعِبُ نَفْسَهُ بِتِلَاوَتِي وَ يُطِيلُ لَيْلَهُ بِتَرْتِيلِي وَ تَفِيضُ عَيْنَاهُ إِذَا تَهَجَّدَ فَأَرْضِهِ كَمَا أَرْضَانِ<br>َالَ فَيَقُولُ الْعَزِيزُ الْجَبَّارُ عَبْدِيَ ابْسُطْ يَمِينَكَ فَيَمْلَؤُهَا مِنْ رِضْوَانِ اللَّهِ الْعَزِيزِ الْجَبَّارِ وَ يَمْلَأُ شِمَالَهُ مِنْ رَحْمَةِ اللَّهِ ثُمَّ يُقَالُ هَذِهِ الْجَنَّةُ مُبَاحَةٌ لَكَ فَاقْرَأْ وَ اصْعَدْ فَإِذَا قَرَأَ آيَةً صَعِدَ دَرَجَةً .",
					"english": "Ali Bin Ibrahim, from his father, and a number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ibn Mahboub, from Malik Bin Atiyya, from Yunus Bin Ammar who said,<br>‘Abu Abdullah (asws) said: ‘The registers on the Day of Judgment would be three registers – a register in which are (recorded) the Bounties, and a register in which are (recorded) the good deeds, and a register in which are (recorded) the evil deeds.<br>So the Bounties would generally cover the good deeds, and there would remain the evil deeds. So the son of Adam (as) would be called for the Reckoning, and the Quran would walk in front of him in an excellent image, and it would be saying: ‘O Lord (azwj)! I am the Quran, and this is Your (azwj) servant who used to exhaust himself by my recitation, and prolong his nights by my slow recitation, and flooded his eyes (with tears) when he (prayed the) Tahajjud Salāt, therefore Please him just as You (azwj) have Pleased me’.<br>He (asws) said: ‘So the Mighty, the Compeller would be Saying: “My (azwj) servant! Extend your right hand”. So it would be Filled with the Pleasure of Allah (azwj), the Mighty, the Compeller, and his left hand would be Filled from the Mercy of Allah (azwj). Then it would be said to him: ‘This is the Paradise, Gifted for you. Therefore recite and ascend. So whenever he recites a Verse, he would ascend a level’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) لَوْ مَاتَ مَنْ بَيْنَ الْمَشْرِقِ وَ الْمَغْرِبِ لَمَا اسْتَوْحَشْتُ بَعْدَ أَنْ يَكُونَ الْقُرْآنُ مَعِي وَ كَانَ ( عليه السلام ) إِذَا قَرَأَ مالِكِ يَوْمِ الدِّينِ يُكَرِّرُهَا حَتَّى كَادَ أَنْ يَمُوتَ .",
					"english": "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, altogether, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Sufyan Bin Uyayna, from Al Zuhry who said,<br>‘Ali (asws) Bin Al-Husayn (asws) said: ‘(Even) if (all) the ones in the east and the west were to die, I (asws) would not be lonely if the Quran happens to be with me (asws)’. And it was so that whenever he (asws) recited [1:4] Master of the Day of Judgment he (asws) would keep on repeating it until he (asws) would almost be dying’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ إِسْحَاقَ بْنِ غَالِبٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا جَمَعَ اللَّهُ عَزَّ وَ جَلَّ الْأَوَّلِينَ وَ الْآخِرِينَ إِذَا هُمْ بِشَخْصٍ قَدْ أَقْبَلَ لَمْ يُرَ قَطُّ أَحْسَنُ صُورَةً مِنْهُ فَإِذَا نَظَرَ إِلَيْهِ الْمُؤْمِنُونَ وَ هُوَ الْقُرْآنُ قَالُوا هَذَا مِنَّا هَذَا أَحْسَنُ شَيْ‏ءٍ رَأَيْنَ<br>َإِذَا انْتَهَى إِلَيْهِمْ جَازَهُمْ ثُمَّ يَنْظُرُ إِلَيْهِ الشُّهَدَاءُ حَتَّى إِذَا انْتَهَى إِلَى آخِرِهِمْ جَازَهُمْ فَيَقُولُونَ هَذَا الْقُرْآنُ فَيَجُوزُهُمْ كُلَّهُمْ حَتَّى إِذَا انْتَهَى إِلَى الْمُرْسَلِينَ فَيَقُولُونَ هَذَا الْقُرْآنُ فَيَجُوزُهُمْ حَتَّى يَنْتَهِيَ إِلَى الْمَلَائِكَةِ فَيَقُولُونَ هَذَا الْقُرْآن<br>َيَجُوزُهُمْ ثُمَّ يَنْتَهِي حَتَّى يَقِفَ عَنْ يَمِينِ الْعَرْشِ فَيَقُولُ الْجَبَّارُ وَ عِزَّتِي وَ جَلَالِي وَ ارْتِفَاعِ مَكَانِي لَأُكْرِمَنَّ الْيَوْمَ مَنْ أَكْرَمَكَ وَ لَأُهِينَنَّ مَنْ أَهَانَكَ .",
					"english": "‏<br>Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Is’haq Bin Ghalib who said,<br>‘Abu Abdullah (asws) said: ‘When Allah (azwj) will Gather the formers ones and the latter ones, they would be with a person who would in front of them. They would not have seen an image better than it, at all. So when the Momineen will look at him, and he would be the Quran, they would be saying, ‘This one is from us. This is the best thing we have seen’.<br>So when he ends up to them, he would go past them. Then the martyrs would look at him, until when he ends up to the last of them, and goes past them. So they would be saying: ‘This is the Quran’. So he would go past them until when he ends up to the Mursil Prophets (as), and they (as) would be saying: ‘This is the Quran’. So he would go past them until he ends up to the Angels, and they would be saying: ‘This is the Quran’.<br>So he would be going past them. Then he would end up until he pauses on the right of the Throne. So the Compeller would be Saying: “By My (azwj) Mighty and My (azwj) Majesty, and the Loftiness of My (azwj) Position! Today I (azwj) shall Honour the one whom honoured you, and I (azwj) shall Dishonour the one who dishonoured you”’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَهْلَ الْقُرْآنِ فِي أَعْلَى دَرَجَةٍ مِنَ الْآدَمِيِّينَ مَا خَلَا النَّبِيِّينَ وَ الْمُرْسَلِينَ فَلَا تَسْتَضْعِفُوا أَهْلَ الْقُرْآنِ حُقُوقَهُمْ فَإِنَّ لَهُمْ مِنَ اللَّهِ الْعَزِيزِ الْجَبَّارِ لَمَكَاناً عَلِيّاً .",
					"english": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Abu Al Husayn Al Farsy, from Suleyman Bin Ja’far Al Ja’fary, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘The people of the Quran would be in the highest Levels from the human beings except for the Prophets (as) and the Mursils Prophets (as). Therefore, you should not consider them weaken in the matter of their rights, for there is for them, from Allah (azwj) the Mighty, the Compeller, a lofty position’’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْحَافِظُ لِلْقُرْآنِ الْعَامِلُ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ibn Mahboub, from Jameel Bin Salih, from Al Fuzayl Bin Yasaar,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The memoriser of the Quran, the one acting by it, would be with the Ambassadors (Mursil Prophets (as)), the honourable, the righteous’."
				},
				{
					"arabic": "وَ بِإِسْنَادِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَعَلَّمُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ صَاحِبَهُ فِي صُورَةِ شَابٍّ جَمِيلٍ شَاحِبِ اللَّوْنِ فَيَقُولُ لَهُ الْقُرْآنُ أَنَا الَّذِي كُنْتُ أَسْهَرْتُ لَيْلَكَ وَ أَظْمَأْتُ هَوَاجِرَكَ وَ أَجْفَفْتُ رِيقَكَ وَ أَسَلْتُ دَمْعَتَكَ أَؤُولُ مَعَكَ حَيْثُمَا أُلْتَ وَ كُلُّ تَاجِرٍ مِنْ وَرَاءِ تِجَارَتِهِ وَ أَنَا الْيَوْمَ لَكَ مِنْ وَرَاءِ تِجَارَةِ كُلِّ تَاجِرٍ وَ سَيَأْتِيكَ كَرَامَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ فَأَبْشِرْ فَيُؤْتَى بِتَاجٍ فَيُوضَعُ عَلَى رَأْسِه<br>َ يُعْطَى الْأَمَانَ بِيَمِينِهِ وَ الْخُلْدَ فِي الْجِنَانِ بِيَسَارِهِ وَ يُكْسَى حُلَّتَيْنِ ثُمَّ يُقَالُ لَهُ اقْرَأْ وَ ارْقَهْ فَكُلَّمَا قَرَأَ آيَةً صَعِدَ دَرَجَةً وَ يُكْسَى أَبَوَاهُ حُلَّتَيْنِ إِنْ كَانَا مُؤْمِنَيْنِ ثُمَّ يُقَالُ لَهُمَا هَذَا لِمَا عَلَّمْتُمَاهُ الْقُرْآنَ .",
					"english": "And by his chain, from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘Learn the Quran, for it would be coming on the Day of Judgment to its companion in an image of a beautiful youth, radiant, and the Quran would be saying to him: ‘I am the one whom you held a vigil during your night, and your mouth was thirsty, and dried your throat, and your tears flowed. I shall be with you wherever you go to; and every trader is behind his trade, and I am for you today, from behind a trade with every trader, and there shall be coming to you, a Prestige from Allah (azwj) Mighty and Majestic. Therefore, receive glad tidings, for you would be Given a crown upon your head’.<br>And he would be Given the (deed of) security in his right hand, and the (deed of) eternal life in the Gardens in his left hand, and he would be Clothed in two garments. Then it would be said to him: ‘Recite and ascend. So every time he recites a Verse, he would ascend a level. And his parents would be Clothed by two Garments, if he was a Momin. Then it would be said to both of them: ‘This is due to both of you teaching him (your son) the Quran’’."
				},
				{
					"arabic": "ابْنُ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ مِنْهَالٍ الْقَصَّابِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَرَأَ الْقُرْآنَ وَ هُوَ شَابٌّ مُؤْمِنٌ اخْتَلَطَ الْقُرْآنُ بِلَحْمِهِ وَ دَمِهِ وَ جَعَلَهُ اللَّهُ عَزَّ وَ جَلَّ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَ كَانَ الْقُرْآنُ حَجِيزاً عَنْهُ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ إِنَّ كُلَّ عَامِلٍ قَدْ أَصَابَ أَجْرَ عَمَلِهِ غَيْرَ عَامِلِي فَبَلِّغْ بِهِ أَكْرَمَ عَطَايَاك<br>َالَ فَيَكْسُوهُ اللَّهُ الْعَزِيزُ الْجَبَّارُ حُلَّتَيْنِ مِنْ حُلَلِ الْجَنَّةِ وَ يُوضَعُ عَلَى رَأْسِهِ تَاجُ الْكَرَامَةِ ثُمَّ يُقَالُ لَهُ هَلْ أَرْضَيْنَاكَ فِيهِ فَيَقُولُ الْقُرْآنُ يَا رَبِّ قَدْ كُنْتُ أَرْغَبُ لَهُ فِيمَا هُوَ أَفْضَلُ مِنْ هَذَا فَيُعْطَى الْأَمْنَ بِيَمِينِهِ وَ الْخُلْدَ بِيَسَارِه<br>ُمَّ يَدْخُلُ الْجَنَّةَ فَيُقَالُ لَهُ اقْرَأْ وَ اصْعَدْ دَرَجَةً ثُمَّ يُقَالُ لَهُ هَلْ بَلَغْنَا بِهِ وَ أَرْضَيْنَاكَ فَيَقُولُ نَعَم<br>َالَ وَ مَنْ قَرَأَهُ كَثِيراً وَ تَعَاهَدَهُ بِمَشَقَّةٍ مِنْ شِدَّةِ حِفْظِهِ أَعْطَاهُ اللَّهُ عَزَّ وَ جَلَّ أَجْرَ هَذَا مَرَّتَيْنِ .",
					"english": "Ibn Mahboub, from Malik Bin Atiyya, from Minhal Al Qassab,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The one who recites the Quran and he is a Momin youth, the Quran would blend with his flesh and his blood, and Allah (azwj) Mighty and Majestic would Make him to be with the Ambassadors (Mursil Prophets (as)), the honourable, the righteous; and it would be so that the Quran would be concerned about him on the Day of Judgment, saying: ‘O Lord (azwj)! Every worker has attained a Recompense apart from my worker, therefore let him reach the most prestigious of Your (azwj) Gifts’.<br>He (asws) said: ‘So Allah (azwj) the Mighty, the Compeller would Clothe him with two garments of the Paradise and Place a crown of honour upon his head. The He (azwj) would Say to him (The Quran): “Have I please you with regards to him?” So the Quran would be saying: ‘O Lord (azwj)! I used to wish for him regarding what is superior than this, therefore Grant the (deed of) security in his right hand, and the (deed of) eternal life in his left hand’.<br>Then he would enter the Paradise, so it would be said to him: ‘Recite and ascend a level’. The He (azwj) would Say to him: “Have We (azwj) Made him reach it and Please you?” So he (the Quran) would be saying: ‘Yes’.<br>He (asws) said: ‘And the one who recites it a lot and approaches it with laboriousness (difficulty) from the difficulties of memorising it, Allah (azwj) Mighty and Majestic would Give him the Recompense of this, twice’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْخَشَّابِ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يُوسُفَ عَنْ مُعَاذِ بْنِ ثَابِتٍ عَنْ عَمْرِو بْنِ جُمَيْعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَحَقَّ النَّاسِ بِالتَّخَشُّعِ فِي السِّرِّ وَ الْعَلَانِيَةِ لَحَامِلُ الْقُرْآنِ وَ إِنَّ أَحَقَّ النَّاسِ فِي السِّرِّ وَ الْعَلَانِيَةِ بِالصَّلَاةِ وَ الصَّوْمِ لَحَامِلُ الْقُرْآن<br>ُمَّ نَادَى بِأَعْلَى صَوْتِهِ يَا حَامِلَ الْقُرْآنِ تَوَاضَعْ بِهِ يَرْفَعْكَ اللَّهُ وَ لَا تَعَزَّزْ بِهِ فَيُذِلَّكَ اللَّهُ يَا حَامِلَ الْقُرْآنِ تَزَيَّنْ بِهِ لِلَّهِ يُزَيِّنْكَ اللَّهُ بِهِ وَ لَا تَزَيَّنْ بِهِ لِلنَّاسِ فَيَشِينَكَ اللَّهُ بِه<br>َنْ خَتَمَ الْقُرْآنَ فَكَأَنَّمَا أُدْرِجَتِ النُّبُوَّةُ بَيْنَ جَنْبَيْهِ وَ لَكِنَّهُ لَا يُوحَى إِلَيْهِ وَ مَنْ جَمَعَ الْقُرْآنَ فَنَوْلُهُ لَا يَجْهَلُ مَعَ مَنْ يَجْهَلُ عَلَيْهِ وَ لَا يَغْضَبُ فِيمَنْ يَغْضَبُ عَلَيْهِ وَ لَا يَحِدُّ فِيمَنْ يَحِدُّ وَ لَكِنَّهُ يَعْفُو وَ يَصْفَحُ وَ يَغْفِرُ وَ يَحْلُمُ لِتَعْظِيمِ الْقُرْآن<br>َ مَنْ أُوتِيَ الْقُرْآنَ فَظَنَّ أَنَّ أَحَداً مِنَ النَّاسِ أُوتِيَ أَفْضَلَ مِمَّا أُوتِيَ فَقَدْ عَظَّمَ مَا حَقَّرَ اللَّهُ وَ حَقَّرَ مَا عَظَّمَ اللَّهُ .",
					"english": "Abu Ali Al-Ashary, from Al Hassan Bin Ali Bin Abdullah, and Humeyd Bin Ziyad, from Al Khashaab, altogether from Al Hassan Bin Ali Bin Yusuf, from Muaz Bin Sabit, from Amro Bin Jumie,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘The most rightful of the people with the humbleness in the private and public, is for the bearer (memoriser) of the Quran; and the mort rightful of the people in the private and public with the Salāt and the Fasting, is for the bearer (memoriser) of the Quran’.<br>Then he (saww) called out in a raised voice: ‘O bearer of the Quran! Be humble with it, Allah (azwj) would Raise you, and do not be bold with it for Allah (azwj) would Disgrace you. If you adorn with it for the Sake of Allah (azwj), Allah (azwj) would Adorn you with it, and do not adorn with it for the people, for Allah (azwj) would Discredit you with it.<br>The one who completes the Quran, so it is as if he has inserted the Prophet-hood between his two sides, but there is no Revelation (coming) to him; and the one who collects the Quran, so his Conferment is that he would not be ignorant along with the ones who are ignorant upon it, nor would he be angered regarding the one who would be angered upon him, nor would he be irritable regarding the one who irritates him, but he would be pardoning, and excusing, and forgiving, and forbearing due to the reverence of the Quran.<br>And the one who has been Given the Quran, if he thinks that anyone else from the people has been Given (anything) more superior than what he has been Given, so he has magnified what Allah (azwj) has Belittled, and belittled what Allah (azwj) has Magnified’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عُبَيْسِ بْنِ هِشَامٍ قَالَ حَدَّثَنَا صَالِحٌ الْقَمَّاطُ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ النَّاسُ أَرْبَعَةٌ فَقُلْتُ جُعِلْتُ فِدَاكَ وَ مَا هُمْ فَقَالَ رَجُلٌ أُوتِيَ الْإِيمَانَ وَ لَمْ يُؤْتَ الْقُرْآنَ وَ رَجُلٌ أُوتِيَ الْقُرْآنَ وَ لَمْ يُؤْتَ الْإِيمَانَ وَ رَجُلٌ أُوتِيَ الْقُرْآنَ وَ أُوتِيَ الْإِيمَانَ وَ رَجُلٌ لَمْ يُؤْتَ الْقُرْآنَ وَ لَا الْإِيمَان<br>َالَ قُلْتُ جُعِلْتُ فِدَاكَ فَسِّرْ لِي حَالَهُمْ فَقَالَ أَمَّا الَّذِي أُوتِيَ الْإِيمَانَ وَ لَمْ يُؤْتَ الْقُرْآنَ فَمَثَلُهُ كَمَثَلِ التَّمْرَةِ طَعْمُهَا حُلْوٌ وَ لَا رِيحَ لَهَا وَ أَمَّا الَّذِي أُوتِيَ الْقُرْآنَ وَ لَمْ يُؤْتَ الْإِيمَانَ فَمَثَلُهُ كَمَثَلِ الْآسِ رِيحُهَا طَيِّبٌ وَ طَعْمُهَا مُرٌّ وَ أَمَّا مَنْ أُوتِيَ الْقُرْآنَ وَ الْإِيمَانَ فَمَثَلُهُ كَمَثَلِ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَ طَعْمُهَا طَيِّبٌ وَ أَمَّا الَّذِي لَمْ يُؤْتَ الْإِيمَانَ وَ لَا الْقُرْآنَ فَمَثَلُهُ كَمَثَلِ الْحَنْظَلَةِ طَعْمُهَا مُرٌّ وَ لَا رِيحَ لَهَا.",
					"english": "Abu Ali Al Asjary, from Al Hassan Bin Ali Bin Abdullah, from Ubeys Bin Hisham who said, ‘Salih Al Qammat narrated to us, from Aban Bin Taghlub,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The people are four (types)’. So I said, ‘May I be sacrificed for you (asws)! And what (types) are they?’ So he (asws) said: ‘A man Given the Eman and not been Given the Quran; and a man Given the Quran and not been Given the Eman; and a man Given the Quran and Given the Eman; and a man not Given the Quran nor the Eman’.<br>He (the narrator) said, ‘I said, ‘May I be sacrificed for you (asws)! Explain their states to me’. So he (asws) said: ‘As for the one Given the Eman and not been Given the Quran, so his example it like an example of the date. Its taste is sweet, but there is no aroma for it. And as for the one Given the Quran and not Given the Eman, so his example is like an example of the myrtle. Its smell is aromatic and its taste is bitter. And as for the one Given the Quran and the Eman, so his example it like an example of the citrus. Its smell is aromatic and its taste is good. And as for the one neither Given the Eman nor the Quran, so his example is like an example of the colocynth, its taste is bitter and there is no (aromatic) smell to it’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ قَالَ قُلْتُ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْحَالُّ الْمُرْتَحِلُ قُلْتُ وَ مَا الْحَالُّ الْمُرْتَحِلُ قَالَ فَتْحُ الْقُرْآنِ وَ خَتْمُهُ كُلَّمَا جَاءَ بِأَوَّلِهِ ارْتَحَلَ فِي آخِرِه<br>َ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَعْطَاهُ اللَّهُ الْقُرْآنَ فَرَأَى أَنَّ رَجُلًا أُعْطِيَ أَفْضَلَ مِمَّا أُعْطِيَ فَقَدْ صَغَّرَ عَظِيماً وَ عَظَّمَ صَغِيراً .",
					"english": "Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasany, altogether from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Sufyan Bin Uyayna, from Al Zuhry who said,<br>‘I said to Ali (asws) Bin Al-Husayn (asws), ‘Which of the deeds is the most superior?’ He (asws) said: ‘The state of travelling’. I said, ‘And what is the state of travelling?’ He (asws) said: ‘Opening the Quran and ending it. Every time one comes to the beginning of it, travels to the end of it’.<br>And he (asws) said: ‘Rasool-Allah (saww) said: ‘The one whom Allah (azwj) has Given the Quran, so he views that (another) man has been Given superior than what he has been Given, so he has belittled a great (thing), and magnified a little one’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ سُلَيْمَانَ بْنِ رُشَيْدٍ عَنْ أَبِيهِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ قَرَأَ الْقُرْآنَ فَهُوَ غَنِيٌّ وَ لَا فَقْرَ بَعْدَهُ وَ إِلَّا مَا بِهِ غِنًى .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Suleyman Bin Rusheyd, from his father, from Muawiya Bin Ammar who said,<br>‘Abu Abdullah (asws) said to me: ‘The one who recites the Quran so he is rich, and there is no poverty after it, or else he is not with riches’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ أَبِي جَمِيلَةَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا مَعَاشِرَ قُرَّاءِ الْقُرْآنِ اتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فِيمَا حَمَّلَكُمْ مِنْ كِتَابِهِ فَإِنِّي مَسْئُولٌ وَ إِنَّكُمْ مَسْئُولُونَ إِنِّي مَسْئُولٌ عَنْ تَبْلِيغِ الرِّسَالَةِ وَ أَمَّا أَنْتُمْ فَتُسْأَلُونَ عَمَّا حُمِّلْتُمْ مِنْ كِتَابِ اللَّهِ وَ سُنَّتِي .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Abu Najran, from Abu Jameela, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Rasool-Allah (saww) said: ‘O group of reciters of the Quran! Fear Allah (azwj) Mighty and Majestic regarding what you are bearing from His (azwj) Book, for I (saww) would be Questioned and you all would be Questioned. I (saww) would be Questioned about the delivery of the Message, and as for you, so you would be Questioned about what you bore from the Book of Allah (azwj) and my (saww) Sunnah’’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصٍ قَالَ سَمِعْتُ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) يَقُولُ لِرَجُلٍ أَ تُحِبُّ الْبَقَاءَ فِي الدُّنْيَا فَقَالَ نَعَمْ فَقَالَ وَ لِمَ قَالَ لِقِرَاءَةِ قُلْ هُوَ اللَّهُ أَحَدٌ فَسَكَتَ عَنْهُ فَقَالَ لَهُ بَعْدَ سَاعَةٍ يَا حَفْصُ مَنْ مَاتَ مِنْ أَوْلِيَائِنَا وَ شِيعَتِنَا وَ لَمْ يُحْسِنِ الْقُرْآنَ عُلِّمَ فِي قَبْرِهِ لِيَرْفَعَ اللَّهُ بِهِ مِنْ دَرَجَتِهِ فَإِنَّ دَرَجَاتِ الْجَنَّةِ عَلَى قَدْرِ آيَاتِ الْقُرْآنِ يُقَالُ لَهُ اقْرَأْ وَ ارْقَ فَيَقْرَأُ ثُمَّ يَرْقَ<br>َالَ حَفْصٌ فَمَا رَأَيْتُ أَحَداً أَشَدَّ خَوْفاً عَلَى نَفْسِهِ مِنْ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) وَ لَا أَرْجَى النَّاسِ مِنْهُ وَ كَانَتْ قِرَاءَتُهُ حُزْناً فَإِذَا قَرَأَ فَكَأَنَّهُ يُخَاطِبُ إِنْسَاناً .",
					"english": "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Hafs who said,<br>‘I heard Musa (asws) Bin Ja’far (asws) saying to a man: ‘Would you love to remain in the world?’ So he said, ‘Yes’. So he (asws) said: ‘And why?’ He said, ‘In order to recite [112:1] Say He Allah is One (Chapter 112)’. So he (asws) was silent from him, and said to him after a while: ‘O Hafs! The one from our (asws) friends and our (asws) Shias who dies and is not good (at reciting) the Quran, would be taught in his grave, in order for Allah (azwj) to Raise his status by it, from his (current) level, for the Levels of the Paradise are upon a measurement of the Verses of the Quran. It would be said to him: ‘Recite and ascend’. So he would recite, then he would ascend’.<br>Hafs said, ‘So I did not see anyone more intensely fearful upon himself than Musa (asws) Bin Ja’far (asws), nor anyone more hopeful of the people than him (asws), and it was so that his (asws) recitation was (full of) grief. So whenever he (asws) recited, it was as if he (asws) was addressing the people’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَمَلَةُ الْقُرْآنِ عُرَفَاءُ أَهْلِ الْجَنَّةِ وَ الْمُجْتَهِدُونَ قُوَّادُ أَهْلِ الْجَنَّةَ وَ الرُّسُلُ سَادَةُ أَهْلِ الْجَنَّةَ .",
					"english": "Ali, from his father, from Al Nowfaly, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘The bearers of the Quran are the understanding ones of the Paradise, and the strivers are the guides of the people of the Paradise, and the Rasools (as) would be the chiefs of the people of the Paradise’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الَّذِي يُعَالِجُ الْقُرْآنَ وَ يَحْفَظُهُ بِمَشَقَّةٍ مِنْهُ وَ قِلَّةِ حِفْظٍ لَهُ أَجْرَانِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad and Sahl Bin Ziyad, altogether, from Ibn Mahboub, from Jameel Bin Salih, from Al Fuzayl Bin Yasaar,<br>(It has been narrated) from Abu Abdullah (asws), said, ‘I heard him (asws) saying: ‘The one who addresses the Quran and memorises it with difficulty from him, and has scarce memorisation, for him would be two Recompenses (double)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنِ الصَّبَّاحِ بْنِ سَيَابَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ شُدِّدَ عَلَيْهِ فِي الْقُرْآنِ كَانَ لَهُ أَجْرَانِ وَ مَنْ يُسِّرَ عَلَيْهِ كَانَ مَعَ الْأَوَّلِينَ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Al Sabbah Bin Sayaba who said,<br>‘I heard Abu Abdullah (asws) saying: ‘The one who has difficulty upon him regarding the Quran would have two Recompenses for him, and the one who has ease upon him, would be with the former ones’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ سُلَيْمٍ الْفَرَّاءِ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يَنْبَغِي لِلْمُؤْمِنِ أَنْ لَا يَمُوتَ حَتَّى يَتَعَلَّمَ الْقُرْآنَ أَوْ يَكُونَ فِي تَعْلِيمِهِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad, from Suleym Al Fara’a, from a man,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘It is befitting for the Momin that he does not die until he learns the Quran, or happens to be in its learning (process)’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي إِسْحَاقَ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي كُنْتُ قَرَأْتُ الْقُرْآنَ فَفَلَتَ مِنِّي فَادْعُ اللَّهَ عَزَّ وَ جَلَّ أَنْ يُعَلِّمَنِيهِ قَالَ فَكَأَنَّهُ فَزِعَ لِذَلِكَ فَقَالَ عَلَّمَكَ اللَّهُ هُوَ وَ إِيَّانَا جَمِيعاً قَالَ وَ نَحْنُ نَحْوٌ مِنْ عَشَرَة<br>ُمَّ قَالَ السُّورَةُ تَكُونُ مَعَ الرَّجُلِ قَدْ قَرَأَهَا ثُمَّ تَرَكَهَا فَتَأْتِيهِ يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ صُورَةٍ وَ تُسَلِّمُ عَلَيْهِ فَيَقُولُ مَنْ أَنْتِ فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا فَلَوْ أَنَّكَ تَمَسَّكْتَ بِي وَ أَخَذْتَ بِي لَأَنْزَلْتُكَ هَذِهِ الدَّرَجَةَ فَعَلَيْكُمْ بِالْقُرْآن<br>ُمَّ قَالَ إِنَّ مِنَ النَّاسِ مَنْ يَقْرَأُ الْقُرْآنَ لِيُقَالَ فُلَانٌ قَارِئٌ وَ مِنْهُمْ مَنْ يَقْرَأُ الْقُرْآنَ لِيَطْلُبَ بِهِ الدُّنْيَا وَ لَا خَيْرَ فِي ذَلِكَ وَ مِنْهُمْ مَنْ يَقْرَأُ الْقُرْآنَ لِيَنْتَفِعَ بِهِ فِي صَلَاتِهِ وَ لَيْلِهِ وَ نَهَارِهِ .",
					"english": "A number of our companbions, from Ahmad Bin Muhammad, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, altogether, from Ibn Fazzal, from Abu Is’haq Sa’alba Bin Maymoun, from Yaqoub Al Ahmar who said,<br>‘I said to Abu Abdullah (asws), ‘May I be sacrificed for you (asws)! I used to recite the Quran, but it has escaped from me, therefore supplicate to Allah (azwj) Mighty and Majestic that He (azwj) Teaches it (to me)’. He (the narrator) said, ‘So it was as if he (asws) was shocked due to that, and he (asws) said: ‘May Allah (azwj) Teach you it, and us altogether’. He (the narrator) said, ‘And we were approximately ten (people)’.<br>Then he (asws) said: ‘The Chapter (of the Holy Quran) which happens to be with the man, having had recited it, then he neglected it, so it would be coming to him on the Day of Judgment in an excellent image and greet upon him. So he would be saying, ‘Who are you?’ So it would be saying: ‘I am Chapter such and such, so had you attached yourself with me, and taken (to the recitation) with me, I would have catapulted you to this level’. Therefore, it is upon you with the (recitation of the) Quran’.<br>Then he (asws) said: ‘From the people is one who recites the Quran in order for it to be said, ‘So and so is a reciter’; and from them is one who recites the Quran in order to seek the world with it, and there is no goodness in that; and from them is one who recites the Quran in order to benefit with it during his Salāt, and his night, and his day’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ نَسِيَ سُورَةً مِنَ الْقُرْآنِ مُثِّلَتْ لَهُ فِي صُورَةٍ حَسَنَةٍ وَ دَرَجَةٍ رَفِيعَةٍ فِي الْجَنَّةِ فَإِذَا رَآهَا قَالَ مَا أَنْتِ مَا أَحْسَنَكِ لَيْتَكِ لِي فَيَقُولُ أَ مَا تَعْرِفُنِي أَنَا سُورَةُ كَذَا وَ كَذَا وَ لَوْ لَمْ تَنْسَنِي رَفَعْتُكَ إِلَى هَذَا .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Al Magra’a, from Abu baser who said,<br>‘Abu Abdullah (asws) said: ‘The one who forgets a Chapter from the Quran, it would be resembled for him in a beautiful image, and be in a lofty level in the Paradise. So when he sees it, he would say, ‘What are you? How beautiful! If only you were for me’. So it would be saying: ‘But, do you not recognise me? I am Chapter such and such, and had you not forgotten me, I would have raised you to this (level)’."
				},
				{
					"arabic": "ابْنُ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ عَلَيَّ دَيْناً كَثِيراً وَ قَدْ دَخَلَنِي مَا كَانَ الْقُرْآنُ يَتَفَلَّتُ مِنِّي فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْقُرْآنَ الْقُرْآنَ إِنَّ الْآيَةَ مِنَ الْقُرْآنِ وَ السُّورَةَ لَتَجِي‏ءُ يَوْمَ الْقِيَامَةِ حَتَّى تَصْعَدَ أَلْفَ دَرَجَةٍ يَعْنِي فِي الْجَنَّةِ فَتَقُولُ لَوْ حَفِظْتَنِي لَبَلَغْتُ بِكَ هَاهُنَا .",
					"english": "Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Yaqoub Al Ahmar who said,<br>‘I said to Abu Abdullah (asws), ‘There are a lot of debts upon me, and what entered me (from the worries). Whatever was of the Quran has escaped from me’. So Abu Abdullah (asws) said: ‘The Quran! The Quran! The Verse from the Quran and the Chapter would be coming on the Day of Judgment until it ascends a thousand Levels, meaning in the Paradise, so it would be saying: ‘Had you memorised me, I would have reached with you to be over here’’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الرَّجُلَ إِذَا كَانَ يَعْلَمُ السُّورَةَ ثُمَّ نَسِيَهَا أَوْ تَرَكَهَا وَ دَخَلَ الْجَنَّةَ أَشْرَفَتْ عَلَيْهِ مِنْ فَوْقٍ فِي أَحْسَنِ صُورَةٍ فَتَقُولُ تَعْرِفُنِي فَيَقُولُ لَا فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا لَمْ تَعْمَلْ بِي وَ تَرَكْتَنِي أَمَا وَ اللَّهِ لَوْ عَمِلْتَ بِي لَبَلَغْتُ بِكَ هَذِهِ الدَّرَجَةَ وَ أَشَارَتْ بِيَدِهَا إِلَى فَوْقِهَا .",
					"english": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at and a number of our companions, from Ahmad Bin Muhammad, altogether from Muhassin Bin Ahmad, from Aban Bin Usman, from Ibn Abu Yafour who said,<br>‘I heard Abu Abdullah (asws) saying: ‘When the man learns the Chapter (of the Holy Quran), then forgets it or neglects it, and enters the Paradise, it would display itself upon him from above in a beautiful image, and it would be saying: ‘Do you recognise me?’ So he would be saying, ‘No’. So it would be saying: ‘I am Chapter such and such. You did not act by me and neglected me. But, by Allah (azwj), had you acted with me, I would have made you reach to this Level’, and it would gesture by its hand to above it’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنِ الْحَجَّاجِ الْخَشَّابِ عَنْ أَبِي كَهْمَسٍ الْهَيْثَمِ بْنِ عُبَيْدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَرَأَ الْقُرْآنَ ثُمَّ نَسِيَهُ فَرَدَدْتُ عَلَيْهِ ثَلَاثاً أَ عَلَيْهِ فِيهِ حَرَجٌ قَالَ لَا .",
					"english": "Abu Ali Al Ashary, from Al Hassan Bin Ali Bin Abdullah, from Al Abbas Bin Aamir, from Al Hajjaj Al Khashhab, from Abu Kahmasy Al Haysam Bin Ubeyd who said,<br>‘I asked Abu Abdullah (asws) about a man who recites the Quran, then forgets it’, and I reiterated it to him (asws) three (times), ‘Is there any blame upon him?’ He (asws) said: ‘No’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّهُ أَصَابَتْنِي هُمُومٌ وَ أَشْيَاءُ لَمْ يَبْقَ شَيْ‏ءٌ مِنَ الْخَيْرِ إِلَّا وَ قَدْ تَفَلَّتَ مِنِّي مِنْهُ طَائِفَةٌ حَتَّى الْقُرْآنِ لَقَدْ تَفَلَّتَ مِنِّي طَائِفَةٌ مِنْه<br>َالَ فَفَزِعَ عِنْدَ ذَلِكَ حِينَ ذَكَرْتُ الْقُرْآنَ ثُمَّ قَالَ إِنَّ الرَّجُلَ لَيَنْسَى السُّورَةَ مِنَ الْقُرْآنِ فَتَأْتِيهِ يَوْمَ الْقِيَامَةِ حَتَّى تُشْرِفَ عَلَيْهِ مِنْ دَرَجَةٍ مِنْ بَعْضِ الدَّرَجَاتِ فَتَقُولُ السَّلَامُ عَلَيْكَ فَيَقُولُ وَ عَلَيْكِ السَّلَامُ مَنْ أَنْتِ فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا ضَيَّعْتَنِي وَ تَرَكْتَنِي أَمَا لَوْ تَمَسَّكْتَ بِي بَلَغْتُ بِكَ هَذِهِ الدَّرَجَةَ ثُمَّ أَشَارَ بِإِصْبَعِه<br>ُمَّ قَالَ عَلَيْكُمْ بِالْقُرْآنِ فَتَعَلَّمُوهُ فَإِنَّ مِنَ النَّاسِ مَنْ يَتَعَلَّمُ الْقُرْآنَ لِيُقَالَ فُلَانٌ قَارِئٌ وَ مِنْهُمْ مَنْ يَتَعَلَّمُهُ فَيَطْلُبُ بِهِ الصَّوْتَ فَيُقَالُ فُلَانٌ حَسَنُ الصَّوْتِ وَ لَيْسَ فِي ذَلِكَ خَيْرٌ وَ مِنْهُمْ مَنْ يَتَعَلَّمُهُ فَيَقُومُ بِهِ فِي لَيْلِهِ وَ نَهَارِهِ لَا يُبَالِي مَنْ عَلِمَ ذَلِكَ وَ مَنْ لَمْ يَعْلَمْهُ .",
					"english": "‏<br>Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid and Al Husayn Bin Saeed, altogether from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abdullah Bin Muskan, from Yaqoub Al Ahmar who said,<br>‘I said to Abu Abdullah (asws), ‘May I be sacrificed for you (asws)! Worries and other things hit me, and there does not remain anything from the goodness except a section from it has escaped from me, even the Quran, a section from it has escaped from me (as well)’. <br>He (the narrator) said, ‘So he (asws) was shocked at that when I mentioned the Quran. Then he (asws) said: ‘The man forgets the Chapter from the Quran, so it would come to him on the Day of Judgment until it displays itself upon him from a Level from some of the Levels, and it would be saying: ‘The greetings be upon you’. So he would be saying, ‘And upon you be the greetings. Who are you?’ So it would be saying: ‘I am Chapter such and such. You wasted me and neglected me. But, had you attached yourself with me, I would have caused you to reach to this Level’. Then it would gesture by its fingers.<br>Then he (asws) said: ‘(It is) upon you with the Quran. From the people is one who learns the Quran in order for it to be said, ‘So and so is a reciter’; and from them is the one who learns it, and he seeks the voice by it, so it is said to him, ‘So and so and an excellent voice’, and there is no goodness in that; and from them is the one who learns it, so he stands by it during his night and his day, not caring who knows of that and who does not know of that’."
				}
			],
			[
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْقُرْآنُ عَهْدُ اللَّهِ إِلَى خَلْقِهِ فَقَدْ يَنْبَغِي لِلْمَرْءِ الْمُسْلِمِ أَنْ يَنْظُرَ فِي عَهْدِهِ وَ أَنْ يَقْرَأَ مِنْهُ فِي كُلِّ يَوْمٍ خَمْسِينَ آيَةً .",
					"english": "Ali, from his father, from Hammad, from Hareyz,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Quran is a Covenant of Allah (azwj) to His (azwj) creatures. Thus, it is befitting for the Muslim person that he looks into his covenant, and that he recites from it, during every day, fifty Verses’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنِ الزُّهْرِيِّ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَقُولُ آيَاتُ الْقُرْآنِ خَزَائِنُ فَكُلَّمَا فُتِحَتْ خِزَانَةٌ يَنْبَغِي لَكَ أَنْ تَنْظُرَ مَا فِيهَا .",
					"english": "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad, altogether from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Hafs Bin Giyas, from Al Zuhry who said,<br>‘I heard Ali (asws) Bin Al-Husayn (asws) saying: ‘The Verse of the Quran are a treasure, so every time you open the vault, it is befitting for you that you look at what is in it’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْفُضَيْلِ بْنِ عُثْمَانَ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ رَفَعَهُ قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) نَوِّرُوا بُيُوتَكُمْ بِتِلَاوَةِ الْقُرْآنِ وَ لَا تَتَّخِذُوهَا قُبُوراً كَمَا فَعَلَتِ الْيَهُودُ وَ النَّصَارَى صَلَّوْا فِي الْكَنَائِسِ وَ الْبِيَعِ وَ عَطَّلُوا بُيُوتَهُمْ فَإِنَّ الْبَيْتَ إِذَا كَثُرَ فِيهِ تِلَاوَةُ الْقُرْآنِ كَثُرَ خَيْرُهُ وَ اتَّسَعَ أَهْلُهُ وَ أَضَاءَ لِأَهْلِ السَّمَاءِ كَمَا تُضِي‏ءُ نُجُومُ السَّمَاءِ لِأَهْلِ الدُّنْيَا .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Fuzayl Bin Usman, from Lays Bin Abu Suleym, raising it,<br>‘He (asws) said: ‘The Prophet (saww) said: ‘Illuminate your houses by the recitation of the Quran and do not be taking it as graves just as the Jews and the Christians did. They pray in their churches and the synagogues, and they left their houses as inactive, for the house, when the recitation of the Quran is frequented in it, would be of abundant goodness, and (sustenance of) its inhabitants would be Expanded, and it would shine for the inhabitants of the sky just as the stars shine for the inhabitants of the earth’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْبَيْتَ إِذَا كَانَ فِيهِ الْمَرْءُ الْمُسْلِمُ يَتْلُو الْقُرْآنَ يَتَرَاءَاهُ أَهْلُ السَّمَاءِ كَمَا يَتَرَاءَى أَهْلُ الدُّنْيَا الْكَوْكَبَ الدُّرِّيَّ فِي السَّمَاءِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, and Al Husayn Bin Saeed, altogether from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Abd Al A’ala, a slave of the family of Saam,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The house in which there was a Muslim person reciting the Quran, the inhabitants of the sky would see it just as the inhabitants of the world seen the shining star in the sky’."
				},
				{
					"arabic": "مُحَمَّدٌ عَنْ أَحْمَدَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) الْبَيْتُ الَّذِي يُقْرَأُ فِيهِ الْقُرْآنُ وَ يُذْكَرُ اللَّهُ عَزَّ وَ جَلَّ فِيهِ تَكْثُرُ بَرَكَتُهُ وَ تَحْضُرُهُ الْمَلَائِكَةُ وَ تَهْجُرُهُ الشَّيَاطِينُ وَ يُضِي‏ءُ لِأَهْلِ السَّمَاءِ كَمَا تُضِي‏ءُ الْكَوَاكِبُ لِأَهْلِ الْأَرْضِ وَ إِنَّ الْبَيْتَ الَّذِي لَا يُقْرَأُ فِيهِ الْقُرْآنُ وَ لَا يُذْكَرُ اللَّهُ عَزَّ وَ جَلَّ فِيهِ تَقِلُّ بَرَكَتُهُ وَ تَهْجُرُهُ الْمَلَائِكَةُ وَ تَحْضُرُهُ الشَّيَاطِينُ .",
					"english": "‏‏.<br>Muhammad Bin Ahmad and a number of our companions, from Sahl Bin Ziyad, altogether, from Ja’far Bin Muhammad Bin Ubeydullah, from Ibn Al Qaddah,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Amir Al-Momineen (asws) said: ‘The house in which the Quran is recited, and wherein Allah (azwj) Mighty and Majestic is Mentioned, would be of abundant Blessings; and the Angels would attend it and the Satans (la) would forsake it, and it would shine for the inhabitants of the sky just as the stars shine for the inhabitants of the earth; and that the house in which neither the Quran is being recited, nor is Allah (azwj) Mighty and Majestic being Mentioned, would be of scarce Blessings, and the Angels would forsake (abandon) it and the Satans (la) would attend it’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ مُعَاذِ بْنِ مُسْلِمٍ عَنْ عَبْدِ اللَّهِ ابْنِ سُلَيْمَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ قَرَأَ الْقُرْآنَ قَائِماً فِي صَلَاتِهِ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ مِائَةَ حَسَنَةٍ وَ مَنْ قَرَأَهُ فِي صَلَاتِهِ جَالِساً كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ خَمْسِينَ حَسَنَةً وَ مَنْ قَرَأَهُ فِي غَيْرِ صَلَاتِهِ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ عَشْرَ حَسَنَاتٍ .<br>قَالَ ابْنُ مَحْبُوبٍ وَ قَدْ سَمِعْتُهُ عَنْ مُعَاذٍ عَلَى نَحْوٍ مِمَّا رَوَاهُ ابْنُ سِنَانٍ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Abdullah Bin Sinan, from Muaz Bin Muslim, from Abdullah Ibn Suleyman,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The one who recites the Quran standing during his Salāt, Allah (azwj) would Write for him, with every letter, one hundred good deeds; and the one who recites during his Salāt, seated, Allah (azwj) would Write for him with every letter, fifty good deeds; and the one who recites during other than his Salāt, Allah (azwj) would Write for him, with every letter, ten good deeds’.<br>Ibn Mahboub (the fourth narrator) said, ‘And I had heard it from Muaz (the second reporter) upon an approximation from what Ibn Sinan (the third reporter) had reported it’."
				},
				{
					"arabic": "ابْنُ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا يَمْنَعُ التَّاجِرَ مِنْكُمُ الْمَشْغُولَ فِي سُوقِهِ إِذَا رَجَعَ إِلَى مَنْزِلِهِ أَنْ لَا يَنَامَ حَتَّى يَقْرَأَ سُورَةً مِنَ الْقُرْآنِ فَتُكْتَبَ لَهُ مَكَانَ كُلِّ آيَةٍ يَقْرَؤُهَا عَشْرُ حَسَنَاتٍ وَ يُمْحَى عَنْهُ عَشْرُ سَيِّئَاتٍ .",
					"english": "Ibn Mahboub, from Jameel Bin Salih, from Al Fuzayl Bin Yasaar,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘What prevents the trader from you, the one busy in his market, when he returns to his house that he does not sleep until he recites a Chapter from the Quran, so that it would be Written for him for every Verse he recites, ten good deeds, and ten evil deeds would be Deleted from him?’"
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ أَوْ غَيْرِهِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ رَجُلٍ عَنْ جَابِرٍ عَنْ مُسَافِرٍ عَنْ بِشْرِ بْنِ غَالِبٍ الْأَسَدِيِّ عَنِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ مَنْ قَرَأَ آيَةً مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فِي صَلَاتِهِ قَائِماً يُكْتَبُ لَهُ بِكُلِّ حَرْفٍ مِائَةُ حَسَنَةٍ فَإِذَا قَرَأَهَا فِي غَيْرِ صَلَاةٍ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ عَشْرَ حَسَنَاتٍ وَ إِنِ اسْتَمَعَ الْقُرْآنَ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ حَسَنَةً وَ إِنْ خَتَمَ الْقُرْآنَ لَيْلًا صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُصْبِحَ وَ إِنْ خَتَمَهُ نَهَاراً صَلَّتْ عَلَيْهِ الْحَفَظَةُ حَتَّى يُمْسِيَ وَ كَانَتْ لَهُ دَعْوَةٌ مُجَابَةٌ وَ كَانَ خَيْراً لَهُ مِمَّا بَيْنَ السَّمَاءِ إِلَى الْأَرْض<br>ُلْتُ هَذَا لِمَنْ قَرَأَ الْقُرْآنَ فَمَنْ لَمْ يَقْرَأْ قَالَ يَا أَخَا بَنِي أَسَدٍ إِنَّ اللَّهَ جَوَادٌ مَاجِدٌ كَرِيمٌ إِذَا قَرَأَ مَا مَعَهُ أَعْطَاهُ اللَّهُ ذَلِكَ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, or someone else, from Sayf Bin Ameyra, from a man, from Jabir, from Musafir, from Bishr Bin Ghalib Al Asady,<br>(It has been narrated) from Al-Husayn (asws) Bin Ali (asws) having said: ‘The one who recites a Verse from the Book of Allah (azwj) Mighty and Majestic during his Salāt, standing, there would be Written for him, for every letter, one hundred good deeds. So when he recites it during other than his Salāt, Allah (azwj) would Write for him, with every letter, ten good deeds; and that the intent listener of the Quran, Allah (azwj) would Write for him, with every letter, one good deed; and that the completer of the Quran at night, the Angels would arrive upon him until the morning; and that the one who completes it at daytime, the recorders (Angels) would arrive upon him until evening; and there would be an Answered supplication for him, and it would be better for him than what is between the sky to the earth’.<br>I said, ‘This is for the one who recites the Quran. So (what about) the one who does not recite?’ He (asws) said: ‘O brother of the Clan of Asad! Allah (azwj) is Generous, Glorious, Benevolent. When he reads whatever is with him (from the Holy Quran), Allah (azwj) would Give him that’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ خَالِدِ بْنِ مَادٍّ الْقَلَانِسِيِّ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ خَتَمَ الْقُرْآنَ بِمَكَّةَ مِنْ جُمُعَةٍ إِلَى جُمُعَةٍ أَوْ أَقَلَّ مِنْ ذَلِكَ أَوْ أَكْثَرَ وَ خَتَمَهُ فِي يَوْمِ جُمُعَةٍ كُتِبَ لَهُ مِنَ الْأَجْرِ وَ الْحَسَنَاتِ مِنْ أَوَّلِ جُمُعَةٍ كَانَتْ فِي الدُّنْيَا إِلَى آخِرِ جُمُعَةٍ تَكُونُ فِيهَا وَ إِنْ خَتَمَهُ فِي سَائِرِ الْأَيَّامِ فَكَذَلِكَ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Al Nazar Bin Suweyd, from Khalid Bin Maad Al Qalanasy, from Abu Hamza Al Sumaly,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The one who completes the Quran at Makkah from a Friday to a Friday, or less than that, or more, and completes it during the day of Friday, Allah (azwj) would Write for him the Recompense and the Rewards from the first Friday he was in the world to the last Friday which he would happen to be in it; and if he were to complete it during the rest of the days, so it would be like that’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَرَأَ عَشْرَ آيَاتٍ فِي لَيْلَةٍ لَمْ يُكْتَبْ مِنَ الْغَافِلِينَ وَ مَنْ قَرَأَ خَمْسِينَ آيَةً كُتِبَ مِنَ الذَّاكِرِينَ وَ مَنْ قَرَأَ مِائَةَ آيَةٍ كُتِبَ مِنَ الْقَانِتِينَ وَ مَنْ قَرَأَ مِائَتَيْ آيَةٍ كُتِبَ مِنَ الْخَاشِعِينَ وَ مَنْ قَرَأَ ثَلَاثَ مِائَةِ آيَةٍ كُتِبَ مِنَ الْفَائِزِينَ وَ مَنْ قَرَأَ خَمْسَمِائَةِ آيَةٍ كُتِبَ مِنَ الْمُجْتَهِدِين<br>َ مَنْ قَرَأَ أَلْفَ آيَةٍ كُتِبَ لَهُ قِنْطَارٌ مِنْ تِبْرٍ الْقِنْطَارُ خَمْسَةَ عَشَرَ أَلْفَ مِثْقَالٍ مِنْ ذَهَبٍ وَ الْمِثْقَالُ أَرْبَعَةٌ وَ عِشْرُونَ قِيرَاطاً أَصْغَرُهَا مِثْلُ جَبَلِ أُحُدٍ وَ أَكْبَرُهَا مَا بَيْنَ السَّمَاءِ إِلَى الْأَرْضِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid and Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Muhammad Bin Marwan, from Sa’ad Bin Tareyf,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Rasool-Allah (saww) said: ‘The one who recites ten Verse during a night would not be Written as being from the neglectful ones; and the one who recites fifty Verses would be Written as being from the Zakireen (Oft-Mentioners of Allah (azwj)); and the one who recites one hundred Verses would be Written as being from the contented ones; and the one who recites two hundred Verse would be Written as being from the fearful ones; and the one who recites three hundred Verses would be Written as being from the successful ones; and the one who recites five hundred Verses would be Written as being from the strivers.<br>And the one who recites a thousand Verses, there would be Written for him a Qintar of gold nuggets. The Qintar is fifteen thousand Misqaal of gold, and the Misqaal is twenty four Qiraat, the smallest of it being like the mountain of Ohad, and the largest of it being what is between the sky to the earth’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مَنْصُورٍ عَنْ مُحَمَّدِ بْنِ بَشِيرٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ وَ قَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنِ اسْتَمَعَ حَرْفاً مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ مِنْ غَيْرِ قِرَاءَةٍ كَتَبَ اللَّهُ لَهُ حَسَنَةً وَ مَحَا عَنْهُ سَيِّئَةً وَ رَفَعَ لَهُ دَرَجَة<br>َ مَنْ قَرَأَ نَظَراً مِنْ غَيْرِ صَوْتٍ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ حَسَنَةً وَ مَحَا عَنْهُ سَيِّئَةً وَ رَفَعَ لَهُ دَرَجَةً وَ مَنْ تَعَلَّمَ مِنْهُ حَرْفاً ظَاهِراً كَتَبَ اللَّهُ لَهُ عَشْرَ حَسَنَاتٍ وَ مَحَا عَنْهُ عَشْرَ سَيِّئَاتٍ وَ رَفَعَ لَهُ عَشْرَ دَرَجَات<br>َالَ لَا أَقُولُ بِكُلِّ آيَةٍ وَ لَكِنْ بِكُلِّ حَرْفٍ بَاءٍ أَوْ تَاءٍ أَوْ شِبْهِهِمَ<br>َالَ وَ مَنْ قَرَأَ حَرْفاً ظَاهِراً وَ هُوَ جَالِسٌ فِي صَلَاتِهِ كَتَبَ اللَّهُ لَهُ بِهِ خَمْسِينَ حَسَنَةً وَ مَحَا عَنْهُ خَمْسِينَ سَيِّئَةً وَ رَفَعَ لَهُ خَمْسِينَ دَرَجَةً وَ مَنْ قَرَأَ حَرْفاً وَ هُوَ قَائِمٌ فِي صَلَاتِهِ كَتَبَ اللَّهُ لَهُ بِكُلِّ حَرْفٍ مِائَةَ حَسَنَةٍ وَ مَحَا عَنْهُ مِائَةَ سَيِّئَةٍ وَ رَفَعَ لَهُ مِائَةَ دَرَجَة<br>َ مَنْ خَتَمَهُ كَانَتْ لَهُ دَعْوَةٌ مُسْتَجَابَةٌ مُؤَخَّرَةً أَوْ مُعَجَّلَةً قَالَ قُلْتُ جُعِلْتُ فِدَاكَ خَتَمَهُ كُلَّهُ قَالَ خَتَمَهُ كُلَّهُ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ali Bin Hadeed, from Mansour, from Muhammad Bin Bashir,<br>(It has been narrated) from Ali (asws) Bin Al-Husayn (asws), said, ‘And this Hadeeth has been reported from Abu Abdullah (asws) having said: ‘The one who listens intently to a letter from the Book of Allah (azwj) Mighty and Majestic from without a recitation, Allah (azwj) would Write for him a good deed and Delete an evil deed from him, and Raise a Level for him.<br>And the one who recites looking from without a voice, Allah (azwj) would Write for him, for every letter, a good deed and Delete from him an evil deed, and Raise a Level for him; and the one who learns a letter from it apparently, Allah (azwj) would Write for him ten good deeds and Deleted ten evil deeds from him, and Raise ten Levels for him’.<br>He (asws) said: ‘I am not saying, for every Verse, but I am saying, for every letter, ‘B’, or ‘T’, or the likes of these two’.<br>He (asws) said: ‘And the one who recites a Letter apparently while he is seated during his Salāt, Allah (azwj) would Write for him, due to it, fifty good deeds, and Delete fifty evil deeds from him, and Raise fifty Levels for him; and the one who recites a letter while he is standing during his Salāt, Allah (azwj) would Write for him, for every letter, one hundred good deeds, and Delete one hundred evil deeds from him, and Rasie one hundred Levels for him.<br>And the one who completes it, would be an Answered supplication for him, whether delared or hastened’. I said, ‘May I be sacrificed for you (asws)! Completing all of it?’ He (asws) said: ‘Completing all of it’."
				},
				{
					"arabic": "مَنْصُورٌ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُ أَبِي ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَتْمُ الْقُرْآنِ إِلَى حَيْثُ تَعْلَمُ .",
					"english": "Mansour,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘I (asws) heard my (asws) father (asws) saying: ‘Rasool-Allah (saww) said: ‘Completion of the Quran is up to where you know’’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَرَأَ الْقُرْآنَ فِي الْمُصْحَفِ مُتِّعَ بِبَصَرِهِ وَ خُفِّفَ عَنْ وَالِدَيْهِ وَ إِنْ كَانَا كَافِرَيْنِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Yaqoub Bin Yazeed,<br>(It has been narrated) raising it to Abu Abdullah (asws) having said: ‘The one who recites the Quran in the Parchment would have pleasure in his eyes, and (Punishment) would be lightened from his parents and even if they were disbelievers’."
				},
				{
					"arabic": "عَنْهُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ الْحَسَنِ الضَّرِيرِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّهُ لَيُعْجِبُنِي أَنْ يَكُونَ فِي الْبَيْتِ مُصْحَفٌ يَطْرُدُ اللَّهُ عَزَّ وَ جَلَّ بِهِ الشَّيَاطِينَ .",
					"english": "From him, from Ali Bin Al Husayn Bin Al Hassan Al Zareyr, from Hammad Bin Isa,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘I (asws) would love it if there happens to be a Parchment in the House by which Allah (azwj) Mighty and Majestic Repels the Satans (la)’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ثَلَاثَةٌ يَشْكُونَ إِلَى اللَّهِ عَزَّ وَ جَلَّ مَسْجِدٌ خَرَابٌ لَا يُصَلِّي فِيهِ أَهْلُهُ وَ عَالِمٌ بَيْنَ جُهَّالٍ وَ مُصْحَفٌ مُعَلَّقٌ قَدْ وَقَعَ عَلَيْهِ الْغُبَارُ لَا يُقْرَأُ فِيهِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Ibn Fazzal, from the one who mentioned it,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Three (things) would complain to Allah (azwj) Mighty and Majestic – a ruined Masjid, it people not praying Salāt in it, and a scholar among the ignorant ones, and a Parchment hanging (somewhere), the dust having occurred upon it, not been recited’."
				},
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ ابْنِ جُمْهُورٍ عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ مَسْعَدَةَ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ جَدِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِرَاءَةُ الْقُرْآنِ فِي الْمُصْحَفِ تُخَفِّفُ الْعَذَابَ عَنِ الْوَالِدَيْنِ وَ لَوْ كَانَا كَافِرَيْنِ .",
					"english": "Ali Bin Muhammad, from Ibn Jamhour, from Muhammad Bin Umar Bin Mas’ada, from Al Hassan Bin Rashid, from his grandfather,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Recitation of the Quran in the Parchment would lighten the Punishment from the parents, and even if they were both disbelievers’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنِّي أَحْفَظُ الْقُرْآنَ عَلَى ظَهْرِ قَلْبِي فَأَقْرَؤُهُ عَلَى ظَهْرِ قَلْبِي أَفْضَلُ أَوْ أَنْظُرُ فِي الْمُصْحَفِ قَالَ فَقَالَ لِي بَلِ اقْرَأْهُ وَ انْظُرْ فِي الْمُصْحَفِ فَهُوَ أَفْضَلُ أَ مَا عَلِمْتَ أَنَّ النَّظَرَ فِي الْمُصْحَفِ عِبَادَةٌ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Muawiya Bin Wahab, from Is’haq Bin Ammar,<br>(It has been narrated) from Abu Abdullah (asws), said, ‘I said to him (asws), ‘May I be sacrificed for you (asws)! I have memorised the Quran by heart, reading it from memory so is it superior or looking into the Parchment (while reciting)?’ So he (asws) said to me: ‘But, recite and while looking into the Parchment, for it is superior. Do you not know that the looking into the Parchment is an act of worship?’"
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ وَاصِلِ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ رَتِّلِ الْقُرْآنَ تَرْتِيلًا قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  بَيِّنْهُ تِبْيَاناً وَ لَا تَهُذَّهُ هَذَّ الشِّعْرِ وَ لَا تَنْثُرْهُ نَثْرَ الرَّمْلِ وَ لَكِنْ أَفْزِعُوا قُلُوبَكُمُ الْقَاسِيَةَ وَ لَا يَكُنْ هَمُّ أَحَدِكُمْ آخِرَ السُّورَةِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Wasil Bin Suleyman, from Abdullah Bin Suleyman who said,<br>‘I asked Abu Abdullah (asws) about the Words of Allah (azwj) Mighty and Majestic [73:4] and recite the Quran as it ought to be recited. He (asws) said: ‘Amir Al-Momineen (asws) said: ‘Pronounce it with clarity and do not bunch it like the bunching of the poem, nor scatter it like the scattering of the grains of sand, but shake-up your hard hearts. Not one of you should be concerned of (reaching to) the end of the Chapter (rushing it)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْقُرْآنَ نَزَلَ بِالْحُزْنِ فَاقْرَءُوهُ بِالْحُزْنِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from the one who mentioned it,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Quran came down with the grief, therefore recite it with the grief’."
				},
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اقْرَءُوا الْقُرْآنَ بِأَلْحَانِ الْعَرَبِ وَ أَصْوَاتِهَا وَ إِيَّاكُمْ وَ لُحُونَ أَهْلِ الْفِسْقِ وَ أَهْلِ الْكَبَائِرِ فَإِنَّهُ سَيَجِي‏ءُ مِنْ بَعْدِي أَقْوَامٌ يُرَجِّعُونَ الْقُرْآنَ تَرْجِيعَ الْغِنَاءِ وَ النَّوْحِ وَ الرَّهْبَانِيَّةِ لَا يَجُوزُ تَرَاقِيَهُمْ قُلُوبُهُمْ مَقْلُوبَةٌ وَ قُلُوبُ مَنْ يُعْجِبُهُ شَأْنُهُمْ .",
					"english": "Ali Bin Muhammad, from Ibrahim Al Ahmad, from Abdullah Bin Hammad, from Abdulla Bin Sinan,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘Recite the Quran with the tone of the Arabs and their voices; and beware of the immoral people and the people (committing) major sins, for there would be coming a group of people after me (saww), they would be repeating (Verses) of the Quran like the repetition of the songs, and the lamentations, and the monks, not exceeding their throats. Their hearts would be inverted along with the hearts of the ones amazed by their affair’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ حَسَنِ بْنِ شَمُّونٍ قَالَ حَدَّثَنِي عَلِيُّ بْنُ مُحَمَّدٍ النَّوْفَلِيُّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ ذَكَرْتُ الصَّوْتَ عِنْدَهُ فَقَالَ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) كَانَ يَقْرَأُ فَرُبَّمَا مَرَّ بِهِ الْمَارُّ فَصَعِقَ مِنْ حُسْنِ صَوْتِهِ وَ إِنَّ الْإِمَامَ لَوْ أَظْهَرَ مِنْ ذَلِكَ شَيْئاً لَمَا احْتَمَلَهُ النَّاسُ مِنْ حُسْنِه<br>ُلْتُ وَ لَمْ يَكُنْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُصَلِّي بِالنَّاسِ وَ يَرْفَعُ صَوْتَهُ بِالْقُرْآنِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يُحَمِّلُ النَّاسَ مِنْ خَلْفِهِ مَا يُطِيقُونَ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Hasan Bin Shamoun who said, ‘Ali Bin Muhammad Al Nowfaly narrated to me,<br>(It has been narrated) from Abu Al-Hassan (asws), said: ‘The (good) voice was mentioned in his (asws) presence. So he (asws) said: ‘Ali (asws) Bin Al-Husayn (asws) used to recite. So sometimes a passer-by would pause (in order to listen), and he would shriek from the beauty of his (asws) voice, and that the Imam (asws), if he (as) were to manifest anything from that, the people would not be able to bear the beauty of his (asws) voice’.<br>  .<br>I said, ‘And why didn’t Rasool-Allah (saww) raise his (saww) voice with the Quran (recitation) when he (saww) prayed Salāt with (leading) the people?’ So he (asws) said: ‘Rasool-Allah (saww) used to only load upon the people – following him (saww) what they could endure’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمٍ الْفَرَّاءِ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَعْرِبِ الْقُرْآنَ فَإِنَّهُ عَرَبِيٌّ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleym Al Fara’a, from the one who informed him,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Arabise (articulate in Arabic) the Quran, for it is in Arabic’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَى مُوسَى بْنِ عِمْرَانَ ( عليه السلام ) إِذَا وَقَفْتَ بَيْنَ يَدَيَّ فَقِفْ مَوْقِفَ الذَّلِيلِ الْفَقِيرِ وَ إِذَا قَرَأْتَ التَّوْرَاةَ فَأَسْمِعْنِيهَا بِصَوْتٍ حَزِينٍ .",
					"english": "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Abdullah Bin Sinan,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Allah (azwj) Mighty and Majestic Revealed unto Musa (as) Bin Imran (as): “Whenever you (as) stand in front of Me (azwj), so stand the standing of the disgraced one, the poor; and whenever you (as) recite the Torah, so make it to be heard in a grief-laden voice’."
				},
				{
					"arabic": "عَنْهُ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَمْ يُعْطَ أُمَّتِي أَقَلَّ مِنْ ثَلَاثٍ الْجَمَالِ وَ الصَّوْتِ الْحَسَنِ وَ الْحِفْظِ .",
					"english": "From him, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Abdullah Bin Sinan,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘My (saww) community has not been Given anything more scarcely than three (things) – the beauty, and the beautiful voice, and the memorisation (of the Holy Quran)’."
				},
				{
					"arabic": "عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ مِنْ أَجْمَلِ الْجَمَالِ الشَّعْرَ الْحَسَنَ وَ نَغْمَةَ الصَّوْتِ الْحَسَنِ .",
					"english": "From him, from his father, from Ali Bin Ma’bad, from Yunus, from Abdullah Bin Muskan, from Abu Baseer,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Prophet (saww) said: ‘The most beautiful of the beauties is the beautiful hair and the tone of the beautiful voice’."
				},
				{
					"arabic": "عَنْهُ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) لِكُلِّ شَيْ‏ءٍ حِلْيَةٌ وَ حِلْيَةُ الْقُرْآنِ الصَّوْتُ الْحَسَنُ .",
					"english": "From him, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Abdullah Bin Sinan,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Prophet (saww) said: ‘For everything is an ornament, and an ornament of the Quran is the beautiful voice’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ عُمَرَ الصَّيْقَلِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنِ السَّكُونِيِّ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ الْمِيثَمِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا بَعَثَ اللَّهُ عَزَّ وَ جَلَّ نَبِيّاً إِلَّا حَسَنَ الصَّوْتِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Musa Bin Umar Al Sayqal, from Muhammad Bin Isa, from Al Sakuny, from Ali Bin Ismail Al Maysami, from a man,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Allah (azwj) Mighty and Majestic did not Send a Prophet (saww) except with the beautiful voice’."
				},
				{
					"arabic": "سَهْلُ بْنُ زِيَادٍ عَنِ الْحَجَّالِ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه )  أَحْسَنَ النَّاسِ صَوْتاً بِالْقُرْآنِ وَ كَانَ السَّقَّاءُونَ يَمُرُّونَ فَيَقِفُونَ بِبَابِهِ يَسْمَعُونَ قِرَاءَتَهُ وَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) أَحْسَنَ النَّاسِ صَوْتاً .",
					"english": "Sahl Bin Ziyad, from Al Hajjal, from Ali Bin Uqba, from a man,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Ali (asws) Bin Al-Husayn (asws) was of the most beautiful of voices of the people with the (recitation of the) Quran, and the water carriers used to pass by his (asws) door, and they would be pausing at his (asws) door listening to his (asws) recitation, and it was so that Abu Ja’far (asws) was of the most beautiful of voices of the people’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْأَسَدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يُكْرَهُ أَنْ يُقْرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ بِنَفَسٍ وَاحِدٍ .",
					"english": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Al Asady, from Ahmad Bin Al Hassan Al Maysami, from Aban Bin Usman, from Muhammad Bin Al Fuzayl who said,<br>‘Abu Abdullah (asws) said: ‘It is disliked to recite [112:1] Say He Allah is One (Chapter 112), in one breath’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِذَا قَرَأْتُ الْقُرْآنَ فَرَفَعْتُ بِهِ صَوْتِي جَاءَنِي الشَّيْطَانُ فَقَالَ إِنَّمَا تُرَائِي بِهَذَا أَهْلَكَ وَ النَّاسَ قَالَ يَا أَبَا مُحَمَّدٍ اقْرَأْ قِرَاءَةً مَا بَيْنَ الْقِرَاءَتَيْنِ تُسْمِعُ أَهْلَكَ وَ رَجِّعْ بِالْقُرْآنِ صَوْتَكَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يُحِبُّ الصَّوْتَ الْحَسَنَ يُرَجَّعُ فِيهِ تَرْجِيعاً .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer who said,<br>‘I said to Abu Ja’far (asws), ‘Whenever I recite the Quran, so I raise my voice with it, the Satan (la) come to me and says, ‘But rather, you are showing-off with this to your family and the people’. He (asws) said: ‘O Abu Muhammad! Recite a recitation what is in-between the two recitations, to cause your family to hear, and repeat with the (Verses of the) Quran in your voice, for Allah (azwj) Mighty and Majestic Loves the beautiful voice repeating in it (with a) repeating’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ إِسْحَاقَ الضَّبِّيِّ عَنْ أَبِي عِمْرَانَ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ إِنَّ قَوْماً إِذَا ذَكَرُوا شَيْئاً مِنَ الْقُرْآنِ أَوْ حُدِّثُوا بِهِ صَعِقَ أَحَدُهُمْ حَتَّى يُرَى أَنَّ أَحَدَهُمْ لَوْ قُطِعَتْ يَدَاهُ أَوْ رِجْلَاهُ لَمْ يَشْعُرْ بِذَلِكَ فَقَالَ سُبْحَانَ اللَّهِ ذَاكَ مِنَ الشَّيْطَانِ مَا بِهَذَا نُعِتُوا إِنَّمَا هُوَ اللِّينُ وَ الرِّقَّةُ وَ الدَّمْعَةُ وَ الْوَجَلُ .<br>أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ أَبِي عِمْرَانَ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Yaqoub Bin Is’haq Al Sabiy, from Abu Imran Al Armany, from Abdullah Bin Al Hakam, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws), said, ‘I said, ‘There is a group of people, when something is mentioned from the Quran or narrated with it, one of them would shriek (scream) to the extent that one of them would view that if his hand or his leg were to be cut off, he would not be aware of that’. So he (asws) said: ‘Glory be to Allah (azwj)! That is from the Satan (la), what is attributed with this. But rather, it is the softness and the tenderness, and the tears, and the scruples’.<br>Abu Ali Al Ashary, from Muhammad Bin Hassan, from Abu Imran Al Armany, from Abdullah Bin Al Hakam, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws) – similar to it."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ قَالَ لَا يُعْجِبُنِي أَنْ تَقْرَأَهُ فِي أَقَلَّ مِنْ شَهْرٍ .",
					"english": "Ali Bin Ibrahim, from his father, from Hammad, from Al Husayn Bin Al Mukhtar, from Muhammad Bin Abdullah who said,<br>‘I said to Abu Abdullah (asws), ‘Can I recite the (whole) Quran in a night?’ He (asws) said: ‘I (asws) do not like it if you were to recite it in less than a month’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي شَهْرِ رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا قَالَ فَفِي لَيْلَتَيْنِ قَالَ لَا قَالَ فَفِي ثَلَاثٍ قَالَ هَا وَ أَشَارَ بِيَدِه<br>ُمَّ قَالَ يَا أَبَا مُحَمَّدٍ إِنَّ لِرَمَضَانَ حَقّاً وَ حُرْمَةً لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ وَ كَانَ أَصْحَابُ مُحَمَّدٍ ( صلى الله عليه وآله ) يَقْرَأُ أَحَدُهُمُ الْقُرْآنَ فِي شَهْرٍ أَوْ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلً<br>َإِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ الْجَنَّةِ فَقِفْ عِنْدَهَا وَ سَلِ اللَّهَ عَزَّ وَ جَلَّ الْجَنَّةَ وَ إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ فَقِفْ عِنْدَهَا وَ تَعَوَّذْ بِاللَّهِ مِنَ النَّارِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from one of his companions, from Ali Bin Abu Hamza who said,<br>‘I went over to Abu Abdullah (asws), and Abu Baseer said to him (asws), ‘May I be sacrificed for you (asws)! Should I recite the (whole) Quran in a Month of Ramazan in a night?’ So he (asws) said: ‘No’. He said, ‘So in two nights?’ He (asws) said: ‘No’. He said, ‘So in three?’ He (asws) said: ‘Ha!’, and gestured by his (asws) hand.<br>‏ <br>Then he (asws) said: ‘O Abu Muhammad! For (the Month of) Ramazan there is a right and a sanctity. Nothing resembles it from the (other) months; and it was so that the companions of Muhammad (saww), one of them would recite the (whole) Quran during a month, or less. The Quran is not to be recited jabbering, but it is to be recited slowly and with clarity (as it ought to be recited).<br>So whenever you pass by a Verse wherein is a Mention of the Paradise, so pause at it and ask Allah (azwj) Mighty and Majestic for the Paradise; and whenever you pass by a Verse wherein is Mention of the Fire, so pause at it and seek Refuge with Allah (azwj) from the Fire’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ حُسَيْنِ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ فِي كَمْ أَقْرَأُ الْقُرْآنَ فَقَالَ اقْرَأْهُ أَخْمَاساً اقْرَأْهُ أَسْبَاعاً أَمَا إِنَّ عِنْدِي مُصْحَفاً مُجَزًّى أَرْبَعَةَ عَشَرَ جُزْءاً .",
					"english": "Muhammad Bin Yahya, from Muhamad Bin Al Husayn, from Ali Bin Al Nu’man, from Yaqoub Bin Shuayb, from Husayn Bin Khalid,<br>(It has been narrated) from Abu Abdullah (asws), said, ‘I said to him (asws), ‘In how much (time) should I recite the (whole) Quran?’ So he (asws) said: ‘Recite it in fifths or sevenths. But, with me (asws) there is a Parchment sectioned upon fourteen parts’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ أَبِي سَأَلَ جَدَّكَ عَنْ خَتْمِ الْقُرْآنِ فِي كُلِّ لَيْلَةٍ فَقَالَ لَهُ جَدُّكَ كُلَّ لَيْلَةٍ فَقَالَ لَهُ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ جَدُّكَ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ أَبِي نَعَمْ مَا اسْتَطَعْت<br>َكَانَ أَبِي يَخْتِمُهُ أَرْبَعِينَ خَتْمَةً فِي شَهْرِ رَمَضَانَ ثُمَّ خَتَمْتُهُ بَعْدَ أَبِي فَرُبَّمَا زِدْتُ وَ رُبَّمَا نَقَصْتُ عَلَى قَدْرِ فَرَاغِي وَ شُغُلِي وَ نَشَاطِي وَ كَسَلِي فَإِذَا كَانَ فِي يَوْمِ الْفِطْرِ جَعَلْتُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَتْمَةً وَ لِعَلِيٍّ ( عليه السلام ) أُخْرَى وَ لِفَاطِمَةَ ( عليها السلام ) أُخْرَى ثُمَّ لِلْأَئِمَّةِ ( عليهم السلام ) حَتَّى انْتَهَيْتُ إِلَيْكَ فَصَيَّرْتُ لَكَ وَاحِدَةً مُنْذُ صِرْتُ فِي هَذَا الْحَالِ فَأَيُّ شَيْ‏ءٍ لِي بِذَلِك<br>َالَ لَكَ بِذَلِكَ أَنْ تَكُونَ مَعَهُمْ يَوْمَ الْقِيَامَةِ قُلْتُ اللَّهُ أَكْبَرُ فَلِي بِذَلِكَ قَالَ نَعَمْ ثَلَاثَ مَرَّاتٍ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yahya Bin Ibrahim Bin Abu Al Balad, from his father, from Ali Bin Al Mugheira,<br>(It has been narrated) from Abu Al-Hassan (asws), said, ‘I said to him (asws), ‘My father asked your (asws) grandfather (asws) about completing the (whole) Quran during every night. So your (asws) grandfather (asws) said to him: ‘Every night?’ So he said to him (asws), ‘In a Month of Ramazan’. So your (asws) grandfather (asws) said to him: ‘In a Month of Ramazan?’ So my father said to him (asws), ‘Yes, whatever capacity (I have)’.<br>    ‏<br>It was so that my father used to complete it, forty completions in a Month of Ramazan. Then I was completing it after my father. So sometimes I would exceed and sometimes I would be deficient, based upon a measurement of my free time, and my occupation, and my activity and my laziness. So whenever it was the day of (Eid) Al-Fitr, I would make one completion to be for Rasool-Allah (saww), and another one for Ali (asws), and another for Syeda Fatima (asws), then another for the Imams (asws) until I would end up with you (asws). Thus, I have rendered one (completion) to be for you (asws) since I came to be in this state. So which thing would be for me due to that?’<br>He (asws) said: ‘For you, due to that, is that you would happen to be with them (asws) on the Day of Judgment’. I said, ‘Allah (azwj) is the Greatest! So, for me would be that?’ He (asws) said: ‘Yes’, three times’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلَ أَبُو بَصِيرٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا حَتَّى بَلَغَ سِتَّ لَيَالٍ فَأَشَارَ بِيَدِهِ فَقَالَ هَ<br>ُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَصْحَابِ مُحَمَّدٍ ( صلى الله عليه وآله ) كَانَ يَقْرَأُ الْقُرْآنَ فِي شَهْرٍ وَ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلًا إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ وَقَفْتَ عِنْدَهَا وَ تَعَوَّذْتَ بِاللَّهِ مِنَ النَّار<br>َقَالَ أَبُو بَصِيرٍ أَقْرَأُ الْقُرْآنَ فِي رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا فَقَالَ فِي ثَلَاثٍ فَقَالَ هَا وَ أَوْمَأَ بِيَدِهِ نَعَمْ شَهْرُ رَمَضَانَ لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ لَهُ حَقٌّ وَ حُرْمَةٌ أَكْثِرْ مِنَ الصَّلَاةِ مَا اسْتَطَعْتَ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said,<br>‘Abu Baseer asked Abu Abdullah (asws), and I was present. So he said to him (asws), ‘May I be sacrificed for you (asws)! Should I recite (the whole) Quran in a night?’ so he (asws) said: ‘No’. So he said, ‘In two nights?’ So he (asws) said: ‘No’. Until it reached six nights. So he (asws) gestured by his (asws) hand, and he (asws) said: ‘Ha!’<br>  <br>Then Abu Abdullah (asws) said: ‘O Abu Muhammad! The ones who were before you from the companions of Muhammad (saww) used to recite the (whole) Quran in a month, and less. The Quran is such that it should not be recited by jabbering, but slowly and with clarity (as it ought to be recited). Whenever you pass by a Verse wherein is a Mention of the Fire, pause at it and seek Refuge with Allah (azwj) from the Fire’.<br>‏.<br>So Abu Baseer said, ‘Should I recite (the whole) Quran in one night of the Month of Ramazan?’ So he (asws) said: ‘No’. So he said, ‘In two nights?’ So he (asws) said: ‘No’. So he said, ‘In three?’ So he (asws) said: ‘Ha!’, and gestured by his (asws) hand, ‘Yes, the Month of Ramazan is such that nothing resembles it from the (other) months. For it is a right and a sanctity. Frequent from the Salāt, whatever your capacity may be’."
				}
			],
			[
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ الرَّجُلَ الْأَعْجَمِيَّ مِنْ أُمَّتِي لَيَقْرَأُ الْقُرْآنَ بِعَجَمِيَّةٍ فَتَرْفَعُهُ الْمَلَائِكَةُ عَلَى عَرَبِيَّةٍ .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Prophet (saww) said: ‘The non-Arab man from my (saww) community, let him recite the Quran in non-Arab (recitation), and the Angels would Raise it upon Arabic’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّا نَسْمَعُ الْآيَاتِ فِي الْقُرْآنِ لَيْسَ هِيَ عِنْدَنَا كَمَا نَسْمَعُهَا وَ لَا نُحْسِنُ أَنْ نَقْرَأَهَا كَمَا بَلَغَنَا عَنْكُمْ فَهَلْ نَأْثَمُ فَقَالَ لَا اقْرَءُوا كَمَا تَعَلَّمْتُمْ فَسَيَجِيئُكُمْ مَنْ يُعَلِّمُكُمْ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from one of his companions,<br>(It has been narrated) from Abu Al-Hassan (asws), said, ‘I said to him (asws), ‘May I be sacrificed for you (asws)! We tend to hear the Verses in the Quran which are not with us just as we are hearing these to be, nor are we good in reciting it just as it reached us from you (asws). So are we sinning?’ So he (asws) said: ‘No. Recite it just as you have learned it, so there would be coming, one (Al-Qaim (asws)) who would be teaching you all’."
				}
			],
			[
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ بَدْرٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ مَرَّةً بُورِكَ عَلَيْهِ وَ مَنْ قَرَأَهَا مَرَّتَيْنِ بُورِكَ عَلَيْهِ وَ عَلَى أَهْلِهِ وَ مَنْ قَرَأَهَا ثَلَاثَ مَرَّاتٍ بُورِكَ عَلَيْهِ وَ عَلَى أَهْلِهِ وَ عَلَى جِيرَانِه<br>َ مَنْ قَرَأَهَا اثْنَيْ عَشَرَ مَرَّةً بَنَى اللَّهُ لَهُ اثْنَيْ عَشَرَ قَصْراً فِي الْجَنَّةِ فَيَقُولُ الْحَفَظَةُ اذْهَبُوا بِنَا إِلَى قُصُورِ أَخِينَا فُلَانٍ فَنَنْظُرَ إِلَيْهَ<br>َ مَنْ قَرَأَهَا مِائَةَ مَرَّةٍ غُفِرَتْ لَهُ ذُنُوبُ خَمْسَةٍ وَ عِشْرِينَ سَنَةً مَا خَلَا الدِّمَاءَ وَ الْأَمْوَالَ وَ مَنْ قَرَأَهَا أَرْبَعَمِائَةِ مَرَّةٍ كَانَ لَهُ أَجْرُ أَرْبَعِمِائَةِ شَهِيدٍ كُلُّهُمْ قَدْ عُقِرَ جَوَادُهُ وَ أُرِيقَ دَمُهُ وَ مَنْ قَرَأَهَا أَلْفَ مَرَّةٍ فِي يَوْمٍ وَ لَيْلَةٍ لَمْ يَمُتْ حَتَّى يَرَى مَقْعَدَهُ فِي الْجَنَّةِ أَوْ يُرَى لَهُ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Badr, from Muhammad Bin Marwan,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The one who recites [112:1] Say He Allah is One (Chapter 112) once, would have Blessings upon him; and the one who recites it twice would have Blessings upon him and upon his family. And the one who recites it three times would have Blessings upon him, and upon his family, and upon his neighbours.<br>And the one who recites it twelve times, Allah would Build for him twelve castles in the Paradise. So the preservers (Angels) would be saying: ‘Come with us to the castle of our brother so and so, to look at it’.<br>And the one who recites it one hundred times, his sins of twenty five years would be Forgiven for him, apart from the (shedding of unlawful) blood, and the wealth. And the one who recites it four hundred times, would have for him the Recompense of four hundred martyrs having had hamstrung their horses (not to let it fall into enemy hands) and shed its blood. And the one who recites it a thousand times in a day and night, would not die until he sees his seat in the Paradise, or it is shown to him’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ هَذِهِ الْآيَاتِ أَنْ يَهْبِطْنَ إِلَى الْأَرْضِ تَعَلَّقْنَ بِالْعَرْشِ وَ قُلْنَ أَيْ رَبِّ إِلَى أَيْنَ تُهْبِطُنَا إِلَى أَهْلِ الْخَطَايَا وَ الذُّنُوب<br>َأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِنَّ أَنِ اهْبِطْنَ فَوَ عِزَّتِي وَ جَلَالِي لَا يَتْلُوكُنَّ أَحَدٌ مِنْ آلِ مُحَمَّدٍ وَ شِيعَتِهِمْ فِي دُبُرِ مَا افْتَرَضْتُ عَلَيْهِ مِنَ الْمَكْتُوبَةِ فِي كُلِّ يَوْمٍ إِلَّا نَظَرْتُ إِلَيْهِ بِعَيْنِيَ الْمَكْنُونَةِ فِي كُلِّ يَوْمٍ سَبْعِينَ نَظْرَةً أَقْضِي لَهُ فِي كُلِّ نَظْرَةٍ سَبْعِينَ حَاجَةً وَ قَبِلْتُهُ عَلَى مَا فِيهِ مِنَ الْمَعَاصِ<br>َ هِيَ أُمُّ الْكِتَابِ وَ شَهِدَ اللَّهُ أَنَّهُ لا إِلهَ إِلَّا هُوَ وَ الْمَلائِكَةُ وَ أُولُوا الْعِلْمِ وَ آيَةُ الْكُرْسِيِّ وَ آيَةُ الْمُلْكِ .",
					"english": "Humeyd Bin Ziyad, from Al Husayn Bin Muhammad, from Ahmad Bin Al Hassan Al Maysami, from Yaqoub Bin Shuayb,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘When Allah (azwj) Mighty and Majestic Commanded these Verses that they should descend to the earth, they attached themselves to the Throne and they said: ‘Yes Lord (azwj)! To where are You (azwj) Causing us to descend to? The people of the errors and sins?’<br>So Allah (azwj) Mighty and Majestic Revealed unto them to descend: “By My (azwj) Might and My (azwj) Majesty! You will not be recited by anyone from the Progeny (asws) of Muhammad (saww) and their (asws) Shias at the end of what I (azwj) have Imposed upon him from the Prescribed (Salāt) during every day, except that I (azwj) would Look at him with My (azwj) Hidden Eyes during every day with seventy Glances, Fulfilling for him during every Glance, seventy needs, and Accept him upon whatever he would be in, from disobeying Me (azwj).<br>And these are – the Mother of the Book (Surah Al-Fatiha – Chapter 1), [3:18] Allah bears witness that there is no god but He, and (so do) the Angels and those possessed of knowledge, and the Ayat Al-Kursy (2:255)’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ مُحَمَّدِ بْنِ سُكَيْنٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مَنْ قَرَأَ الْمُسَبِّحَاتِ كُلَّهَا قَبْلَ أَنْ يَنَامَ لَمْ يَمُتْ حَتَّى يُدْرِكَ الْقَائِمَ وَ إِنْ مَاتَ كَانَ فِي جِوَارِ مُحَمَّدٍ النَّبِيِّ ( صلى الله عليه وآله ) .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Hassan, from Ismail Bin Mihran, from Al Hassan Bin Ali Bin Abu Hamza, from Muhammad Bin Sukeyn, from Amro Bin Shimr, from Jabir who said,<br>‘I heard Abu Ja’far (asws) saying: ‘The one who recites the Musabbihaat (Chapters 17, 57, 59, 61, 62, 64 & 87), all of them, before he sleeps, would not die until he sees Al-Qaim (asws); and when he does die, he would be in the vicinity of Muhammad (as), the Prophet (saww)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ طَلْحَةَ عَنْ جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ مِائَةَ مَرَّةٍ حِينَ يَأْخُذُ مَضْجَعَهُ غَفَرَ اللَّهُ لَهُ ذُنُوبَ خَمْسِينَ سَنَةً .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Al Nu’man, from Abdullah Bin Talha,<br>(It has been narrated) from Ja’far (asws) having said: ‘Rasool-Allah (saww) said: ‘The one who recites [112:1] Say He Allah is One (Chapter 112) one hundred times when he takes to his bed, Allah (azwj) would Forgive his sins of fifty years’."
				},
				{
					"arabic": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْخَشَّابِ عَنِ ابْنِ بَقَّاحٍ عَنْ مُعَاذٍ عَنْ عَمْرِو بْنِ جُمَيْعٍ رَفَعَهُ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَرَأَ أَرْبَعَ آيَاتٍ مِنْ أَوَّلِ الْبَقَرَةِ وَ آيَةَ الْكُرْسِيِّ وَ آيَتَيْنِ بَعْدَهَا وَ ثَلَاثَ آيَاتٍ مِنْ آخِرِهَا لَمْ يَرَ فِي نَفْسِهِ وَ مَالِهِ شَيْئاً يَكْرَهُهُ وَ لَا يَقْرَبُهُ شَيْطَانٌ وَ لَا يَنْسَى الْقُرْآنَ .",
					"english": "Humeyd Bin Ziyad, from Al Khashhab, from Ibn Baqah, from Muaz, from Amro Bin Humeyd,<br>(It has been narrated) raising it to Ali (asws) Bin Al-Husayn (asws) having said: ‘Rasool-Allah (saww) said: ‘The one who recites four Verses from the beginning of (Surah) Al-Baqarah, and Ayat Al-Kursy (2:255), and two Verses after it, and three Verses from its end, would not see anything in himself and his wealth, anything which he dislikes, nor will Satan (la) come near him, nor would he forget the Quran’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ قَرَأَ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ يَجْهَرُ بِهَا صَوْتَهُ كَانَ كَالشَّاهِرِ سَيْفَهُ فِي سَبِيلِ اللَّهِ وَ مَنْ قَرَأَهَا سِرّاً كَانَ كَالْمُتَشَحِّطِ بِدَمِهِ فِي سَبِيلِ اللَّهِ وَ مَنْ قَرَأَهَا عَشْرَ مَرَّاتٍ غُفِرَتْ لَهُ عَلَى نَحْوِ أَلْفِ ذَنْبٍ مِنْ ذُنُوبِهِ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Sayf Bin Ameyra, from a man,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The one who recites [97:1] We have indeed revealed this in the Night of Predestination, being loud with it by his voice, would be like the brandisher of his sword in the Way of Allah (azwj); and the one who recites it privately would be like the one rolling in his blood in the Way of Allah (azwj); and the one who recites it ten times, Allah (azwj) would Forgive (his sins) for him upon an approximation of a thousand sins from his sins’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَبِي ( صلوات الله عليه )  يَقُولُ قُلْ هُوَ اللَّهُ أَحَدٌ ثُلُثُ الْقُرْآنِ وَ قُلْ يَا أَيُّهَا الْكَافِرُونَ رُبُعُ الْقُرْآنِ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Yaqoub Bin Shuayb,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘My (asws) father (asws) was saying [112:1] Say He Allah is One Chapter 112) is a third of the Quran, and [109:1] (Say: O unbelievers) Chapter 109) is a quarter of the Quran’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ رَجُلٍ سَمِعَ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ مَنْ قَرَأَ آيَةَ الْكُرْسِيِّ عِنْدَ مَنَامِهِ لَمْ يَخَفِ الْفَالِجَ إِنْ شَاءَ اللَّهُ وَ مَنْ قَرَأَهَا فِي دُبُرِ كُلِّ فَرِيضَةٍ لَمْ يَضُرَّهُ ذُو حُمَة<br>َ قَالَ مَنْ قَدَّمَ قُلْ هُوَ اللَّهُ أَحَدٌ بَيْنَهُ وَ بَيْنَ جَبَّارٍ مَنَعَهُ اللَّهُ عَزَّ وَ جَلَّ مِنْهُ يَقْرَأُهَا مِنْ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ فَإِذَا فَعَلَ ذَلِكَ رَزَقَهُ اللَّهُ عَزَّ وَ جَلَّ خَيْرَهُ وَ مَنَعَهُ مِنْ شَرِّه<br>َ قَالَ إِذَا خِفْتَ أَمْراً فَاقْرَأْ مِائَةَ آيَةٍ مِنَ الْقُرْآنِ مِنْ حَيْثُ شِئْتَ ثُمَّ قُلِ.<br>اللَّهُمَّ اكْشِفْ عَنِّي الْبَلَاءَ ثَلَاثَ مَرَّات<br>",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Al Hassan Bin Al Jahm, from Ibrahim Bin Mihzam,<br>(It has been narrated) from a man who heard Abu Al-Hassan (asws) saying: ‘The one who recites Ayat Al-Kursy (2:255) at his sleep time would not be fearful of the paralysis, Allah (azwj) Willing; and the one who recites I at the end of every Obligatory (Salāt) who will not be harmed by (a creature with) the sting (e.g. scorpion etc.)’.<br>And he (asws) said: ‘The one precedes (by the recitation of) [112:1] Say He Allah is One (Chapter 112) between him and a tyrant, Allah (azwj) Mighty and Majestic would Defend him due to his recitation of it, from in front of him, and from behind him, and from his right, and from his left. So when he does that, Allah (azwj) Mighty and Majestic would Grace him his goodness and Defend him from his (tyrant’s) evil’.<br>And he (asws) said: ‘Whenever you fear a matter, so recite one hundred Verses from the Quran from wherever you so desire to, then say,<br>‘O Allah (azwj)! Remove the affliction from me’ – three times’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ قَرَأَ مِائَةَ آيَةٍ يُصَلِّي بِهَا فِي لَيْلَةٍ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ بِهَا قُنُوتَ لَيْلَةٍ وَ مَنْ قَرَأَ مِائَتَيْ آيَةٍ فِي غَيْرِ صَلَاةٍ لَمْ يُحَاجَّهُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ وَ مَنْ قَرَأَ خَمْسَمِائَةِ آيَةٍ فِي يَوْمٍ وَ لَيْلَةٍ فِي صَلَاةِ النَّهَارِ وَ اللَّيْلِ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ فِي اللَّوْحِ الْمَحْفُوظِ قِنْطَاراً مِنَ الْحَسَنَاتِ وَ الْقِنْطَارُ أَلْفٌ وَ مِائَتَا أُوقِيَّةٍ وَ الْأُوقِيَّةُ أَعْظَمُ مِنْ جَبَلِ أُحُدٍ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Is’haq Bin Ammar,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The one who recites one hundred Verses, praying Salāt with these during a night, Allah (azwj) Mighty and Majestic would Write for him, due to it, the Qunoot (supplication during Salāt) for a night; and the one who recites two hundred Verses during other than a Salāt, the Quran would not argue against him on the Day of Judgment; and the one who recites five hundred Verses during a day and a night during a Salāt of a day and a night, Allah (azwj) Mighty and Majestic would Write for him in the Guarded Tablet, a Qintar of good deeds, and the Qintar is one thousand two hundred Owqiya, and the Owqiya is greater than the mountain of Ohad’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ مَضَى بِهِ يَوْمٌ وَاحِدٌ فَصَلَّى فِيهِ بِخَمْسِ صَلَوَاتٍ وَ لَمْ يَقْرَأْ فِيهَا بِقُلْ هُوَ اللَّهُ أَحَدٌ قِيلَ لَهُ يَا عَبْدَ اللَّهِ لَسْتَ مِنَ الْمُصَلِّينَ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Hasan, from Ismail Bin Mihran, from Al Hassan Bin Ali Bin Abu Hamza, from Mansour Bin Hazim,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The one for whom a day passes by and he prays five Salāt during it and does not recite in these [112:1] Say He Allah is One (Chapter 112), it would be said to him: ‘O servant of Allah (azwj)! You are not from the praying ones’."
				},
				{
					"arabic": "وَ بِهَذَا الْإِسْنَادِ عَنِ الْحَسَنِ بْنِ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يَدَعْ أَنْ يَقْرَأَ فِي دُبُرِ الْفَرِيضَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ فَإِنَّهُ مَنْ قَرَأَهَا جَمَعَ اللَّهُ لَهُ خَيْرَ الدُّنْيَا وَ الْآخِرَةِ وَ غَفَرَ لَهُ وَ لِوَالِدَيْهِ وَ مَا وَلَدَا .",
					"english": "And by this chain, from Al Hassan Bin Sayf Bin Ameyra, from Abu Bakr Al Hazramy,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The one who was a believer in Allah (azwj) and the Last Day, so he should not leave the recitation at the end of the Obligatory (Salāt) with [112:1] Say He Allah is One (Chapter 112), for the one who recites it, Allah (azwj) would Gather for him the goodness of the world and the Hereafter, and would Forgive (his sins) for him, and for his parents, and whatever he begets’."
				},
				{
					"arabic": "عَنْهُ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ سُورَةَ الْأَنْعَامِ نَزَلَتْ جُمْلَةً شَيَّعَهَا سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى أُنْزِلَتْ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَعَظَّمُوهَا وَ بَجَّلُوهَا فَإِنَّ اسْمَ اللَّهِ عَزَّ وَ جَلَّ فِيهَا فِي سَبْعِينَ مَوْضِعاً وَ لَوْ يَعْلَمُ النَّاسُ مَا فِي قِرَاءَتِهَا مَا تَرَكُوهَا .",
					"english": "From him, from Al Hassan Bin Ali Bin Abu Hamza, raising it, said,<br>‘Abu Abdullah (asws) said: ‘Surah Al-Anam (Chapter 6) was Revealed in its totality. Seventy thousand Angels escorted it until it was Revealed unto Muhammad (saww). Therefore, you should magnify it and revere it, for the Name of Allah (azwj) Mighty and Majestic is in it in seventy places, and had the people known what is in its recitation, they would not be neglecting it’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) صَلَّى عَلَى سَعْدِ بْنِ مُعَاذٍ فَقَالَ لَقَدْ وَافَى مِنَ الْمَلَائِكَةِ سَبْعُونَ أَلْفاً وَ فِيهِمْ جَبْرَئِيلُ ( عليه السلام ) يُصَلُّونَ عَلَيْهِ فَقُلْتُ لَهُ يَا جَبْرَئِيلُ بِمَا يَسْتَحِقُّ صَلَاتَكُمْ عَلَيْهِ فَقَالَ بِقِرَاءَتِهِ قُلْ هُوَ اللَّهُ أَحَدٌ قَائِماً وَ قَاعِداً وَ رَاكِباً وَ مَاشِياً وَ ذَاهِباً وَ جَائِياً .",
					"english": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny,<br>(It has been narrated) from Abu Abdullah (asws), that the Prophet (saww) prayed (the funeral) Salāt upon Sa’ad Bin Mu’az and he (saww) said: ‘There has been a delegation of seventy thousand from the Angels, and among them was Jibraeel (as), praying (the funeral Salāt) upon him. So I (saww) said to him (as): ‘O Jibraeel (as)! Due to what is he deserving of your (as) Salāt upon him?’ So he (as) said: ‘Due to his recitation of [112:1] Say He Allah is One (Chapter 112), standing, and sitting, and riding, and walking, and going and coming’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ بَشِيرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ الدِّهْقَانِ عَنْ دُرُسْتَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَرَأَ أَلْهَيكُمُ التَّكَاثُرُ عِنْدَ النَّوْمِ وُقِيَ فِتْنَةَ الْقَبْرِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Ja.far Bin Muhammad Bin Bashir, from Ubeydullah Bin Al Dihqan, from Dorost,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Rasool-Allah (saww) said: ‘The one who recites [102:1] (Abundance diverts you) at sleep-time would be saved from the strife of the grave’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ النَّوْفَلِيِّ رَفَعَهُ قَالَ مَا قُرِئَتِ الْحَمْدُ عَلَى وَجَعٍ سَبْعِينَ مَرَّةً إِلَّا سَكَنَ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail Bin Bazi’e, from Abdullah Bin Al Fazl Al Nowfaly, raising it,<br>‘He (asws) said: ‘(Surah) Al-Hamd (Chapter 1) would not be recited upon a pain seventy times, except that it would settle’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَوْ قُرِئَتِ الْحَمْدُ عَلَى مَيِّتٍ سَبْعِينَ مَرَّةً ثُمَّ رُدَّتْ فِيهِ الرُّوحُ مَا كَانَ ذَلِكَ عَجَباً .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘If (Surah) Al-Hamd (Chapter 1) was to be recited upon a deceased seventy times, then the soul were to return back in him, that would not be a cause for astonishment’."
				},
				{
					"arabic": "عَنْهُ عَنْ أَحْمَدَ بْنِ بَكْرٍ عَنْ صَالِحٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا مِنْ أَحَدٍ فِي حَدِّ الصِّبَا يَتَعَهَّدُ فِي كُلِّ لَيْلَةٍ قِرَاءَةَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ كُلَّ وَاحِدَةٍ ثَلَاثَ مَرَّاتٍ وَ قُلْ هُوَ اللَّهُ أَحَدٌ مِائَةَ مَرَّةٍ فَإِنْ لَمْ يَقْدِرْ فَخَمْسِينَ إِلَّا صَرَفَ اللَّهُ عَزَّ وَ جَلَّ عَنْهُ كُلَّ لَمَمٍ أَوْ عَرَضٍ مِنْ أَعْرَاضِ الصِّبْيَانِ وَ الْعُطَاشَ وَ فَسَادَ الْمَعِدَةِ وَ بُدُورَ الدَّمِ أَبَداً مَا تُعُوهِدَ بِهَذَا حَتَّى يَبْلُغَهُ الشَّيْبُ فَإِنْ تَعَهَّدَ نَفْسَهُ بِذَلِكَ أَوْ تُعُوهِدَ كَانَ مَحْفُوظاً إِلَى يَوْمِ يَقْبِضُ اللَّهُ عَزَّ وَ جَلَّ نَفْسَهُ .",
					"english": "From him, from Ahmad Bin Bakr, from Salih, from Suleyman Al Ja’fary,<br>(It has been narrated) from Abu Al-Hassan (asws), said, ‘I heard him (asws) saying: ‘There is no one (still) in the limit of childhood who vows for the recitation during every night with [113:1] Say: I seek Refuge with the Lord of Al Falaq (Chapter 113) and [114:1] Say: I seek Refuge with the Lord of the people (Chapter 114), each one three times, and [112:1] Say: He Allah is One one-hundred times, but if he is not able, then fifty times, except that Allah (azwj) Mighty and Majestic would Exchange from him, every mental problem, or an illness from the illnesses of the children, and the dangerous thirst (dehydration), and the spoiling of the stomach, and the blood circulation (disorder), ever, for as long as he vows by this until he reaches the old age. So if he were to vow himself with that, or keeps on vowing, would be protected up to the Day Allah (azwj) Mighty and Majestic Captures his soul’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ أَحْمَدَ الْمِنْقَرِيِّ قَالَ سَمِعْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) يَقُولُ مَنِ اسْتَكْفَى بِآيَةٍ مِنَ الْقُرْآنِ مِنَ الشَّرْقِ إِلَى الْغَرْبِ كُفِيَ إِذَا كَانَ بِيَقِينٍ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Ahmad Al Minqary who said,<br>‘I heard Abu Ibrahim (asws) (7th Imam (asws)) saying: ‘The one who suffices with one Verse from the Quran from the east to the west, that would suffice him, when that was with conviction’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْعُوذَةِ قَالَ تَأْخُذُ قُلَّةً جَدِيدَةً فَتَجْعَلُ فِيهَا مَاءً ثُمَّ تَقْرَأُ عَلَيْهَا إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ ثَلَاثِينَ مَرَّةً ثُمَّ تُعَلِّقُ وَ تَشْرَبُ مِنْهَا وَ تَتَوَضَّأُ وَ يُزْدَادُ فِيهَا مَاءٌ إِنْ شَاءَ اللَّهُ .",
					"english": "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq and Ali Bin Ibrahim, from his father, Altogether from Bakr Bin Muhammad Al Azdy, from a man,<br>(It has been narrated) from Abu Abdullah (asws) regarding the amulet. He (asws) said: ‘Take a new jar and make water to be in it. Then recite upon it [97:1] We have indeed revealed this in the Night of Predestination (Chapter 97), thirty times, then hang it (somewhere), and drink from it, and perform ablution (from it), and increase the water in it, Allah (azwj) Willing’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِدْرِيسَ الْحَارِثِيِّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مُفَضَّلُ احْتَجِزْ مِنَ النَّاسِ كُلِّهِمْ بِ بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ وَ بِقُلْ هُوَ اللَّهُ أَحَدٌ اقْرَأْهَا عَنْ يَمِينِكَ وَ عَنْ شِمَالِكَ وَ مِنْ بَيْنِ يَدَيْكَ وَ مِنْ خَلْفِكَ وَ مِنْ فَوْقِكَ وَ مِنْ تَحْتِكَ فَإِذَا دَخَلْتَ عَلَى سُلْطَانٍ جَائِرٍ فَاقْرَأْهَا حِينَ تَنْظُرُ إِلَيْهِ ثَلَاثَ مَرَّاتٍ وَ اعْقِدْ بِيَدِكَ الْيُسْرَى ثُمَّ لَا تُفَارِقْهَا حَتَّى تَخْرُجَ مِنْ عِنْدِهِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Idrees Al Harsy, from Muhammad Bin Sinan, from Mufazzal Bin Umra who said,<br>‘Abu Abdullah (asws) said: ‘O Mufazzal! Protect yourself from the people, all of them by [1:1] In the Name of Allah the Beneficent, the Merciful, and by [112:1] Say: He Allah is One (Chapter 112), reciting it on your right, and on your left, and in front of you, and from behind you, and from above you, and from beneath you. So whenever you go over to a tyrannous ruling authority, then recite it when you look at him, three times, and close your left hand, nor releasing it until you come out from his presence’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنِ السَّيَّارِيِّ عَنْ مُحَمَّدِ بْنِ بَكْرٍ عَنْ أَبِي الْجَارُودِ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه )  أَنَّهُ قَالَ وَ الَّذِي بَعَثَ مُحَمَّداً ( صلى الله عليه وآله ) بِالْحَقِّ وَ أَكْرَمَ أَهْلَ بَيْتِهِ مَا مِنْ شَيْ‏ءٍ تَطْلُبُونَهُ مِنْ حِرْزٍ مِنْ حَرَقٍ أَوْ غَرَقٍ أَوْ سَرَقٍ أَوْ إِفْلَاتِ دَابَّةٍ مِنْ صَاحِبِهَا أَوْ ضَالَّةٍ أَوْ آبِقٍ إِلَّا وَ هُوَ فِي الْقُرْآنِ فَمَنْ أَرَادَ ذَلِكَ فَلْيَسْأَلْنِي عَنْه<br>َالَ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنِي عَمَّا يُؤَمِّنُ مِنَ الْحَرَقِ وَ الْغَرَقِ فَقَالَ اقْرَأْ هَذِهِ الْآيَاتِ اللَّهُ الَّذِي نَزَّلَ الْكِتابَ وَ هُوَ يَتَوَلَّى الصَّالِحِينَ وَ ما قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ إِلَى قَوْلِهِ سُبْحانَهُ وَ تَعالى عَمَّا يُشْرِكُونَ فَمَنْ قَرَأَهَا فَقَدْ أَمِنَ الْحَرَقَ وَ الْغَرَق<br>َالَ فَقَرَأَهَا رَجُلٌ وَ اضْطَرَمَتِ النَّارُ فِي بُيُوتِ جِيرَانِهِ وَ بَيْتُهُ وَسَطَهَا فَلَمْ يُصِبْهُ شَيْ‏ء<br>ُمَّ قَامَ إِلَيْهِ رَجُلٌ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ دَابَّتِيَ اسْتَصْعَبَتْ عَلَيَّ وَ أَنَا مِنْهَا عَلَى وَجَلٍ فَقَالَ اقْرَأْ فِي أُذُنِهَا الْيُمْنَى وَ لَهُ أَسْلَمَ مَنْ فِي السَّماواتِ وَ الْأَرْضِ طَوْعاً وَ كَرْهاً وَ إِلَيْهِ يُرْجَعُونَ فَقَرَأَهَا فَذَلَّتْ لَهُ دَابَّتُه<br>َ قَامَ إِلَيْهِ رَجُلٌ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ أَرْضِي أَرْضٌ مَسْبَعَةٌ وَ إِنَّ السِّبَاعَ تَغْشَى مَنْزِلِي وَ لَا تَجُوزُ حَتَّى تَأْخُذَ فَرِيسَتَهَا فَقَالَ اقْرَأْ لَقَدْ جاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لا إِلهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ فَقَرَأَهُمَا الرَّجُلُ فَاجْتَنَبَتْهُ السِّبَاع<br>ُمَّ قَامَ إِلَيْهِ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ فِي بَطْنِي مَاءً أَصْفَرَ فَهَلْ مِنْ شِفَاءٍ فَقَالَ نَعَمْ بِلَا دِرْهَمٍ وَ لَا دِينَارٍ وَ لَكِنِ اكْتُبْ عَلَى بَطْنِكَ آيَةَ الْكُرْسِيِّ وَ تَغْسِلُهَا وَ تَشْرَبُهَا وَ تَجْعَلُهَا ذَخِيرَةً فِي بَطْنِكَ فَتَبْرَأُ بِإِذْنِ اللَّهِ عَزَّ وَ جَلَّ فَفَعَلَ الرَّجُلُ فَبَرَأَ بِإِذْنِ اللَّه<br>ُمَّ قَامَ إِلَيْهِ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنِي عَنِ الضَّالَّةِ فَقَالَ اقْرَأْ يس فِي رَكْعَتَيْنِ وَ قُلْ يَا هَادِيَ الضَّالَّةِ رُدَّ عَلَيَّ ضَالَّتِي فَفَعَلَ فَرَدَّ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ ضَالَّتَه<br>ُمَّ قَامَ إِلَيْهِ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنِي عَنِ الْآبِقِ فَقَالَ اقْرَأْ أَوْ كَظُلُماتٍ فِي بَحْرٍ لُجِّيٍّ يَغْشاهُ مَوْجٌ مِنْ فَوْقِهِ مَوْجٌ إِلَى قَوْلِهِ وَ مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ نُوراً فَما لَهُ مِنْ نُورٍ فَقَالَهَا الرَّجُلُ فَرَجَعَ إِلَيْهِ الْآبِق<br>ُمَّ قَامَ إِلَيْهِ آخَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنِي عَنِ السَّرَقِ فَإِنَّهُ لَا يَزَالُ قَدْ يُسْرَقُ لِيَ الشَّيْ‏ءُ بَعْدَ الشَّيْ‏ءِ لَيْلًا فَقَالَ لَهُ اقْرَأْ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا إِلَى قَوْلِهِ وَ كَبِّرْهُ تَكْبِيرا<br>َالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ بَاتَ بِأَرْضٍ قَفْرٍ فَقَرَأَ هَذِهِ الْآيَةَ إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّماواتِ وَ الْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوى عَلَى الْعَرْشِ إِلَى قَوْلِهِ تَبارَكَ اللَّهُ رَبُّ الْعالَمِينَ حَرَسَتْهُ الْمَلَائِكَةُ وَ تَبَاعَدَتْ عَنْهُ الشَّيَاطِين<br>ُمَّ قَالَ فَمَضَى الرَّجُلُ فَإِذَا هُوَ بِقَرْيَةٍ خَرَابٍ فَبَاتَ فِيهَا وَ لَمْ يَقْرَأْ هَذِهِ الْآيَةَ فَتَغَشَّاهُ الشَّيْطَانُ وَ إِذَا هُوَ آخِذٌ بِخَطْمِهِ فَقَالَ لَهُ صَاحِبُهُ أَنْظِرْهُ وَ اسْتَيْقَظَ الرَّجُلُ فَقَرَأَ الْآيَةَ فَقَالَ الشَّيْطَانُ لِصَاحِبِهِ أَرْغَمَ اللَّهُ أَنْفَكَ احْرُسْهُ الْآنَ حَتَّى يُصْبِحَ فَلَمَّا أَصْبَحَ رَجَعَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَخْبَرَهُ وَ قَالَ لَهُ رَأَيْتُ فِي كَلَامِكَ الشِّفَاءَ وَ الصِّدْقَ وَ مَضَى بَعْدَ طُلُوعِ الشَّمْسِ فَإِذَا هُوَ بِأَثَرِ شَعْرِ الشَّيْطَانِ مُجْتَمِعاً فِي الْأَرْضِ .",
					"english": "‏<br>Muhammad Bin Yahya, from Abdullah Bin Ja’far, from Al Sayyari, from Muhammad Bin Bakr, from Abu Al Jaroud, from Al Asbagh Bin Nubata,<br>(It has been narrated) from Amir Al-Momineen (asws) having said: ‘By the One (azwj) Who Sent Muhammad (saww) with the Truth, and Honoured the People (asws) of his (saww) Household, there is nothing you would be seeking from a protective charm (amulet), from burning, or drowning, or theft, or fleeing of an animal from its owner, or straying, or an absconding one (slave), except that it is in the Quran. Therefore, the one who wants that, so let him ask me (asws) about it’.<br>He (the narrator) said, ‘So a man stood up to him (asws) and said, ‘O Amir Al-Momineen (asws)! Inform me about what can secure from the burning, and the drowning?’ So he (asws) said: ‘Recite these Verses - [7:196] Surely, my guardian is Allah, Who Revealed the Book, and He Befriends the righteous; [39:67] And they did not appreciate Allah with the appreciation that is due to Him  - up to His (azwj) Words Glory be to Him, and Exalted is He, above what they are associating. So the one who recites these, so he would be safe from the burning and the drowning.<br>‏<br>He (the narrator) said, ‘So the man recited these, and fire erupted in the houses of his neighbourhood, and his house was in the middle of it, but nothing affected him’.<br>Then another man stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! My animal has become difficult upon me and I am apprehensive from it’. So he (asws) said: ‘Recite in its right ear [3:83] and to Him submits whoever is in the skies and the earth, willingly or unwillingly, and to Him shall they be returning’. So he recited it, and his animal became submissive to him.<br>And another man stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! My land is a land (full of) wild animals, and the animals tend to overwhelm my house and they do not go away until they seize their prey’. So he (asws) said: ‘Recite [9:128] Certainly a Rasool has come to you from among yourselves; It is grievous to him that you should be overburdened, being full of concern for you; to the believers (he is) kind, merciful [9:129] But if they turn back, say: Allah is Sufficient for me, there is no god but He; on Him do I rely, and He is the Lord of the Magnificent Throne’. So the man recited them both, and the predatory wild animals kept away from him’.<br>Then another man stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! In my belly there is yellow water, so is there a cure from it?’ So he (asws) said: ‘Yes, without a Dirham nor a Dinar. But write upon your belly Ayat Al-Kursy (2:255), and wash it, and drink it, and make it to be a hoard inside your belly, and you would be cured by the Permission of Allah (azwj) Mighty and Majestic’. So the man did so and he was cured by the Permission of Allah (azwj)’.<br>Then another one stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! Inform me about the strayed (animal)’. So he (asws) said: ‘Recite Ya Seen (Chapter 36) during the two Rukous (in the Salāt), and say, ‘O Guide of the straying one! Return my straying (animal)’. So he did so and Allah (azwj) Mighty and Majestic Returned his straying (animal) back to him.<br>Then another one stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! Inform me about the absconding one (slave)’. So he (asws) said: ‘Recite [24:40] Or like utter darkness in the sea – up to His (azwj) Words and to whomsoever Allah does not give Light, he has no Light. So the man said these, and he absconding (slave) returned to him’.<br>‏‏<br>Then another stood up to him (asws) and he said, ‘O Amir Al-Momineen (asws)! Inform me about the theft, for I have not ceased to be stolen from, something after something, at nights’. So he (asws) said to him: ‘Recite whenever you go to your bed  [17:110] Say: Call upon Allah or call upon the Beneficent; whichever (Name) you call upon – up to His (azwj) Words [17:111] and exclaim His Greateness with Exclamations’.<br> <br>Then Amir Al-Momineen (asws) said: ‘The one who spends the night in a land of wilderness, so he should recite these Verses [7:54] Surely, your Lord is Allah, Who Created the skies and the earth in six days, then Established upon the Throne – up to His (azwj) Words Blessed is Allah, the Lord of the Worlds, the Angels would fortify him and the Satans (la) would distance themselves from him’.<br>Then (the narrator) said, ‘The man went, and he was in a ruined town, So he spent the night in it and did not recite these Verses. So the Satan (la) overcame him and seized him by his face. So his (la) companion said to him (la), ‘Look at this’, and the man woke up. So he recited the Verse. So the Satan (la) said to his (la) companion, ‘May Allah (azwj) Rub your nose (Humiliate you). Protect him now, until the morning’. So when it was morning, he returned to Amir Al-Momineen (asws) and informed him (asws), and said, to him (asws), ‘I saw the healing and the truthfulness in your (asws) speech’. And he went after the emergence of the sun, and there were traces of the hair of the Satan (la), gathered in the ground’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ سَلَمَةَ بْنِ مُحْرِزٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ مَنْ لَمْ يُبْرِئْهُ الْحَمْدُ لَمْ يُبْرِئْهُ شَيْ‏ءٌ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bn Muhammad, from Muhammad Bin Sinan, from Salma Bin Muhriz who said,<br>‘I heard Abu Ja’far (asws) saying: ‘The one whom (Surah) Al-Hamd (Chapter 1) does not cure, nothing would cure him’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ مَنْ قَرَأَ إِذَا أَوَى إِلَى فِرَاشِهِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ بَرَاءَةً مِنَ الشِّرْكِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Safwan Bin Yahya, from Abdullah Bin Sinan,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The one who recites when he retires to his bed [109:1] (Say: O unbelievers) Chapter 109) and [112:1] Say He Allah is One (Chapter 112), Allah (azwj) Mighty and Majestic would Write for him an immunity from the Shirk (association with Allah (azwj))’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لَا تَمَلُّوا مِنْ قِرَاءَةِ إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا فَإِنَّهُ مَنْ كَانَتْ قِرَاءَتُهُ بِهَا فِي نَوَافِلِهِ لَمْ يُصِبْهُ اللَّهُ عَزَّ وَ جَلَّ بِزَلْزَلَةٍ أَبَداً وَ لَمْ يَمُتْ بِهَا وَ لَا بِصَاعِقَةٍ وَ لَا بِآفَةٍ مِنْ آفَاتِ الدُّنْيَا حَتَّى يَمُوتَ وَ إِذَا مَاتَ نَزَلَ عَلَيْهِ مَلَكٌ كَرِيمٌ مِنْ عِنْدِ رَبِّهِ فَيَقْعُدُ عِنْدَ رَأْسِهِ فَيَقُولُ يَا مَلَكَ الْمَوْتِ ارْفُقْ بِوَلِيِّ اللَّهِ فَإِنَّهُ كَانَ كَثِيراً مَا يَذْكُرُنِي وَ يَذْكُرُ تِلَاوَةَ هَذِهِ السُّورَة<br>َ تَقُولُ لَهُ السُّورَةُ مِثْلَ ذَلِكَ وَ يَقُولُ مَلَكُ الْمَوْتِ قَدْ أَمَرَنِي رَبِّي أَنْ أَسْمَعَ لَهُ وَ أُطِيعَ وَ لَا أُخْرِجَ رُوحَهُ حَتَّى يَأْمُرَنِي بِذَلِكَ فَإِذَا أَمَرَنِي أَخْرَجْتُ رُوحَه<br>َ لَا يَزَالُ مَلَكُ الْمَوْتِ عِنْدَهُ حَتَّى يَأْمُرَهُ بِقَبْضِ رُوحِهِ وَ إِذَا كُشِفَ لَهُ الْغِطَاءُ فَيَرَى مَنَازِلَهُ فِي الْجَنَّةِ فَيُخْرِجُ رُوحَهُ مِنْ أَلْيَنِ مَا يَكُونُ مِنَ الْعِلَاجِ ثُمَّ يُشَيِّعُ رُوحَهُ إِلَى الْجَنَّةِ سَبْعُونَ أَلْفَ مَلَكٍ يَبْتَدِرُونَ بِهَا إِلَى الْجَنَّةِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from his father, from the one who mentioned it,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Do not be frustrated from the recitation of [99:1] When the earth is shaken with its (violent) shaking Chapter 99), for the one who was reciting with it in his Optional (Salāt), Allah (azwj) Mighty and Majestic would not Hit him by an earthquake, ever, and he would not die due to it, nor by a thunderbolt, nor by a calamity from the calamities of the world until he dies. And when he does die, a benevolent Angel would descend upon him from the Presence of his Lord (azwj) and sit by his head, and he would be saying: ‘O Angel of death! Be kind with a friend of Allah (azwj), for it was frequent what he used to mentioned me and mention the recitation of this Chapter.<br>And the Chapter (99) would say to him similar to that, and the Angel of death would be saying: ‘My Lord (azwj) has already Commanded me that I should listen to him and obey, and not extract his soul until he instructs me with that. So when he does instruct me, I shall extract his soul’.<br>And the Angel of death would not cease to be in his presence until he instruct him with the extraction of his own soul; and when the covers are removed for him, so he sees his house in the Paradise, so he (the Angel of death) would extract his soul from the gentlest of what can happen to be from the treatment. Then his soul would be escorted to the Paradise by seventy thousand Angels, encircling him to the Paradise’."
				}
			],
			[
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُرَّاءُ الْقُرْآنِ ثَلَاثَةٌ رَجُلٌ قَرَأَ الْقُرْآنَ فَاتَّخَذَهُ بِضَاعَةً وَ اسْتَدَرَّ بِهِ الْمُلُوكَ وَ اسْتَطَالَ بِهِ عَلَى النَّاسِ وَ رَجُلٌ قَرَأَ الْقُرْآنَ فَحَفِظَ حُرُوفَهُ وَ ضَيَّعَ حُدُودَهُ وَ أَقَامَهُ إِقَامَةَ الْقِدْحِ فَلَا كَثَّرَ اللَّهُ هَؤُلَاءِ مِنْ حَمَلَةِ الْقُرْآن<br>َ رَجُلٌ قَرَأَ الْقُرْآنَ فَوَضَعَ دَوَاءَ الْقُرْآنِ عَلَى دَاءِ قَلْبِهِ فَأَسْهَرَ بِهِ لَيْلَهُ وَ أَظْمَأَ بِهِ نَهَارَهُ وَ قَامَ بِهِ فِي مَسَاجِدِهِ وَ تَجَافَى بِهِ عَنْ فِرَاشِهِ فَبِأُولَئِكَ يَدْفَعُ اللَّهُ الْعَزِيزُ الْجَبَّارُ الْبَلَاءَ وَ بِأُولَئِكَ يُدِيلُ اللَّهُ عَزَّ وَ جَلَّ مِنَ الْأَعْدَاءِ وَ بِأُولَئِكَ يُنَزِّلُ اللَّهُ عَزَّ وَ جَلَّ الْغَيْثَ مِنَ السَّمَاءِ فَوَ اللَّهِ لَهَؤُلَاءِ فِي قُرَّاءِ الْقُرْآنِ أَعَزُّ مِنَ الْكِبْرِيتِ الْأَحْمَرِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Ubeys Bin Hisham, from the one who mentioned it,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The reciters of the Quran are three (types) – A man who recites the Quran, so he takes it as a commodity and attracts the attention of the kings with it, and extend (his control) by it upon the people. And a man who recites the Quran, so he memorises its letters and wastes its limits, and his standing is (like) the standing of the arrow. May Allah (azwj) not Cause a lot of these ones to be from the bearers of the Quran.<br>And a man who recites the Quran, so he places the medicine of the Quran upon the illness of his heart. So he holds a vigil with it during his nights and remains thirsty due to it by his day, and he stands by it in his Masjid, and ignores his bed due to it. So it is due to them that Allah (azwj) the Mighty, the Compeller Repels the affliction, and it is due to them Allah (azwj) Defends from the enemies, and it is due to them that Allah (azwj) Mighty and Majestic Sends down the rain from the sky. Thus, by Allah (azwj), these ones among the reciters of the Quran, they are more rarer than the red ruby’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي يَحْيَى عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ نَزَلَ الْقُرْآنُ أَثْلَاثاً ثُلُثٌ فِينَا وَ فِي عَدُوِّنَا وَ ثُلُثٌ سُنَنٌ وَ أَمْثَالٌ وَ ثُلُثٌ فَرَائِضُ وَ أَحْكَامٌ .",
					"english": "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Abu Hamza, from Abu Yahya,<br>(It has been narrated) from Al-Asbagh Bin Nubata who said, ‘I heard Amir Al-Momineen (asws) saying: ‘The Quran was Revealed in three (parts) – one-third is regarding us (asws) and our (asws) enemies, and one-third is about the Sunnah and examples, and one-third is about Impositions and the regulations’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْقُرْآنَ نَزَلَ أَرْبَعَةَ أَرْبَاعٍ رُبُعٌ حَلَالٌ وَ رُبُعٌ حَرَامٌ وَ رُبُعٌ سُنَنٌ وَ أَحْكَامٌ وَ رُبُعٌ خَبَرُ مَا كَانَ قَبْلَكُمْ وَ نَبَأُ مَا يَكُونُ بَعْدَكُمْ وَ فَصْلُ مَا بَيْنِكُمْ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Al Hajjal, from Ali Bin Uqba, from Dawood Bin Farqad, from the one who mentioned it,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Quran is Revealed in four (parts) – a quarter is Permissible, and a quarter is Prohibitions, and a quarter is Sunnah and regulations, and a quarter is information of what was before you and a news (foretelling) of what is to happen after you, and decisions of what (disputes there are) between you’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَزَلَ الْقُرْآنُ أَرْبَعَةَ أَرْبَاعٍ رُبُعٌ فِينَا وَ رُبُعٌ فِي عَدُوِّنَا وَ رُبُعٌ سُنَنٌ وَ أَمْثَالٌ وَ رُبُعٌ فَرَائِضُ وَ أَحْكَامٌ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, from Abu Baseer,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The Quran is Revealed in four (parts) – a quarter is regarding us (asws), and a quarter is regarding our (asws) enemies, and a quarter is a Sunnah and examples, and a quarter is Obligations and regulations’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ السَّرِيِّ عَنْ عَمِّهِ عَلِيِّ بْنِ السَّرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَوَّلُ مَا نَزَلَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ اقْرَأْ بِاسْمِ رَبِّكَ وَ آخِرُهُ إِذَا جَاءَ نَصْرُ اللَّهِ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, from Mansour Bin Al Abbas, from Muhammad Bin Al Hassan Al Sarriy, from his uncle Ali Bin Al Sariy,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The first of what was Revealed upon Rasool-Allah (saww) was In the Name of Allah (azwj) the Beneficent, the Merciful, [96:1] Read in the name of your Lord Who Created and the last  of it (Chapter Revealed) was [110:1] When there comes the help of Allah and the victory’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدِ بْنِ الْقَاسِمِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ دَاوُدَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ شَهْرُ رَمَضانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ وَ إِنَّمَا أُنْزِلَ فِي عِشْرِينَ سَنَةً بَيْنَ أَوَّلِهِ وَ آخِرِه<br>َقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) نَزَلَ الْقُرْآنُ جُمْلَةً وَاحِدَةً فِي شَهْرِ رَمَضَانَ إِلَى الْبَيْتِ الْمَعْمُورِ ثُمَّ نَزَلَ فِي طُولِ عِشْرِينَ سَنَة<br>ُمَّ قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) نَزَلَتْ صُحُفُ إِبْرَاهِيمَ فِي أَوَّلِ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ وَ أُنْزِلَتِ التَّوْرَاةُ لِسِتٍّ مَضَيْنَ مِنْ شَهْرِ رَمَضَانَ وَ أُنْزِلَ الْإِنْجِيلُ لِثَلَاثَ عَشْرَةَ لَيْلَةً خَلَتْ مِنْ شَهْرِ رَمَضَانَ وَ أُنْزِلَ الزَّبُورُ لِثَمَانَ عَشَرَ خَلَوْنَ مِنْ شَهْرِ رَمَضَانَ وَ أُنْزِلَ الْقُرْآنُ فِي ثَلَاثٍ وَ عِشْرِينَ مِنْ شَهْرِ رَمَضَانَ .",
					"english": "Ali Bin Ibrahim, from his father, and Muhammad Bin Al Qasim, from Muhammad Bin Suleyman, from Dawood, from Hafs Bin Giyas,<br>(It has been narrated) from Abu Abdullah (asws), said, ‘I asked him (asws) about the Words of Allah (azwj) Mighty and Majestic [2:185] The Month of Ramazan is that in which the Quran was Revealed, but rather it was Revealed during twenty years between its first and its last’.<br> <br>So Abu Abdullah (asws) said: ‘The Quran was Revealed as a whole in one go during the Month of Ramazan to the Frequented House , and then it was Revealed in length over twenty years’.<br>Then he (asws) said: ‘The Prophet (saww) said: ‘The Parchment of Ibrahim (as) was Revealed during the first night from the Month of Ramazan, and the Torah was Revealed when two (days) had not lapsed from the Month of Ramazan, and the Evangel, when thirteen nights from the Month of Ramazan, and the Psalms was Revealed on the eighteenth from the Month of Ramazan, and the Quran was Revealed during the twenty-third from the Month of Ramazan’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تَتَفَأَّلْ بِالْقُرْآنِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Isa, from one of his men,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘You must not (derive) omens (prophecies) from the Quran (Fa’al)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ الْوَرَّاقِ قَالَ عَرَضْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) كِتَاباً فِيهِ قُرْآنٌ مُخَتَّمٌ مُعَشَّرٌ بِالذَّهَبِ وَ كُتِبَ فِي آخِرِهِ سُورَةٌ بِالذَّهَبِ فَأَرَيْتُهُ إِيَّاهُ فَلَمْ يَعِبْ فِيهِ شَيْئاً إِلَّا كِتَابَةَ الْقُرْآنِ بِالذَّهَبِ وَ قَالَ لَا يُعْجِبُنِي أَنْ يُكْتَبَ الْقُرْآنُ إِلَّا بِالسَّوَادِ كَمَا كُتِبَ أَوَّلَ مَرَّةٍ .",
					"english": "Ali Bin Ibrahim, from his father, from Safwan, from Ibn Muskan, from Muhammad Bin Al Warraq who said,<br>‘There was displayed to Abu Abdullah (asws) a Book in wherein was Quran (Verses) sealed by decorations with the gold, and at the end of it was a Chapter written in gold. So he (asws) saw it but did not fault anything in it except for the writing of the Quran with gold, and said: ‘I (asws) do not like it if the Quran is written except with the black (ink) just as it was written the first time’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يَاسِينَ الضَّرِيرِ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ تَأْخُذُ الْمُصْحَفَ فِي الثُّلُثِ الثَّانِي مِنْ شَهْرِ رَمَضَانَ فَتَنْشُرُهُ وَ تَضَعُهُ بَيْنَ يَدَيْكَ وَ تَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِكِتَابِكَ الْمُنْزَلِ وَ مَا فِيهِ وَ فِيهِ اسْمُكَ الْأَعْظَمُ الْأَكْبَرُ وَ أَسْمَاؤُكَ الْحُسْنَى وَ مَا يُخَافُ وَ يُرْجَى أَنْ تَجْعَلَنِي مِنْ عُتَقَائِكَ مِنَ النَّارِ وَ تَدْعُو بِمَا بَدَا لَكَ مِنْ حَاجَةٍ .",
					"english": "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Yaseen Al Zareyr, from Hareyz, from Zurara,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Take the Parchment (Quran) during the second third (11th to 20th) from a Month of Ramazan, so display it and place it in front of you and you should be saying, ‘O Allah (azwj)! I ask You (azwj) by Your (azwj) Revealed Book and what is in it, and in it is Your (azwj) Magnificent Name, the Greatest, and Your (azwj) Good Names, and what one would fear and hope for, that You (azwj) should Make me to be from the ones Emancipated from the Fire’, and you can supplicate with whatever comes to you’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لِكُلِّ شَيْ‏ءٍ رَبِيعٌ وَ رَبِيعُ الْقُرْآنِ شَهْرُ رَمَضَانَ .",
					"english": "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘For everything there is a spring, and the spring of the Quran is a Month of Ramazan’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ سِنَانٍ أَوْ عَنْ غَيْرِهِ عَمَّنْ ذَكَرَهُ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقُرْآنِ وَ الْفُرْقَانِ أَ هُمَا شَيْئَانِ أَوْ شَيْ‏ءٌ وَاحِدٌ فَقَالَ ( عليه السلام ) الْقُرْآنُ جُمْلَةُ الْكِتَابِ وَ الْفُرْقَانُ الْمُحْكَمُ الْوَاجِبُ الْعَمَلِ بِهِ .",
					"english": "‏ .<br>Ali Bin Ibrahim, from his father, from Ibn Sinan, or from someone else, from the one who mentioned it who said,<br>‘I asked Abu Abdullah (asws) about the Quran and the Furqan, are these two different things or one thing?’ So he (asws) said: ‘The Quran is the total Book, and the Furqan is the Decisive, the Obligatory to be acted with’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْقُرْآنَ وَاحِدٌ نَزَلَ مِنْ عِنْدِ وَاحِدٍ وَ لَكِنَّ الِاخْتِلَافَ يَجِي‏ءُ مِنْ قِبَلِ الرُّوَاةِ .",
					"english": "Al Husayn Bin Muhammad, from Ali Bin Muhammad, from Al Washa, from Jameel Bin Darraj, from Muhammad Bin Muslim, from Zurara,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘The Quran is one, Revealed from the Presence of One (azwj), but the differing come from the direction of the reporters’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ النَّاسَ يَقُولُونَ إِنَّ الْقُرْآنَ نَزَلَ عَلَى سَبْعَةِ أَحْرُفٍ فَقَالَ كَذَبُوا أَعْدَاءُ اللَّهِ وَ لَكِنَّهُ نَزَلَ عَلَى حَرْفٍ وَاحِدٍ مِنْ عِنْدِ الْوَاحِدِ .",
					"english": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl Bin Yasar who said,<br>‘I said to Abu Abdullah (asws), ‘The people are saying that the Quran was Revealed upon seven Letters (Phrases)’. So he (asws) said: ‘They are lying, enemies of Allah (azwj)! But, it was Revealed upon one Letter (Phrase) from the Presence of the One (azwj)’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَزَلَ الْقُرْآنُ بِإِيَّاكِ أَعْنِي وَ اسْمَعِي يَا جَارَةُ .<br>وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَعْنَاهُ مَا عَاتَبَ اللَّهُ عَزَّ وَ جَلَّ بِهِ عَلَى نَبِيِّهِ ( صلى الله عليه وآله ) فَهُوَ يَعْنِي بِهِ مَا قَدْ مَضَى فِي الْقُرْآنِ مِثْلُ قَوْلِهِ وَ لَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا عَنَى بِذَلِكَ غَيْرَهُ .",
					"english": "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Quran was Revealed Meaning you (as the second person) and Making the neighbours (third person) hear it’.<br>  .<br>And in another report,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘Its Meaning what Allah (azwj) Mighty and Majestic Reproached with upon His (azwj) Prophet (as), so its Meaning is what has continued in the Quran, for example His (azwj) Words [17:74] And had We not Affirmed you, you would have almost inclined towards them a little, Meaning by that others than him (saww)’. (i.e., the word ‘you’ is not addressed to Rasool-Allah (saww), but to the general Muslims)."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ سُفْيَانَ بْنِ السِّمْطِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ تَنْزِيلِ الْقُرْآنِ قَالَ اقْرَءُوا كَمَا عُلِّمْتُمْ .",
					"english": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Al Hakam, from Abdullah Bin Jundab, from Sufyan Bin Al Simt who said,<br>‘I asked Abu Abdullah (asws) about the Revelation of the Quran. He (asws) said: ‘Recite it just as you learnt it’. (i.e. – ignore the alterations in the meantime before the rising of Al-Qaim (asws))."
				},
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ دَفَعَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) مُصْحَفاً وَ قَالَ لَا تَنْظُرْ فِيهِ فَفَتَحْتُهُ وَ قَرَأْتُ فِيهِ لَمْ يَكُنِ الَّذِينَ كَفَرُوا فَوَجَدْتُ فِيهَا اسْمَ سَبْعِينَ رَجُلًا مِنْ قُرَيْشٍ بِأَسْمَائِهِمْ وَ أَسْمَاءِ آبَائِهِمْ قَالَ فَبَعَثَ إِلَيَّ ابْعَثْ إِلَيَّ بِالْمُصْحَفِ .",
					"english": "Ali Bin Muhammad, from one of his companions, from Ahmad Bin Muhammad Bin Abu Nasr who said,<br>‘Abu Al-Hassan (asws) handed over a Parchment to me and said: ‘Do not look into it’. But I opened it and read in it [98:1] Those who disbelieved, so I found therein names of seventy men from Qureysh, by their names and the names of their fathers. So he (asws) sent a message to me: ‘Send someone to (return to) me with the Parchment’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبِي ( عليه السلام ) مَا ضَرَبَ رَجُلٌ الْقُرْآنَ بَعْضَهُ بِبَعْضٍ إِلَّا كَفَرَ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bi Suleyman,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘My (asws) father (asws) said: ‘No man would strike the Quranic parts with each other (explain one Verse with another), except that he would disbelieve’."
				},
				{
					"arabic": "عَنْهُ عَنِ الْحُسَيْنِ بْنِ النَّضْرِ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ وَقَعَ مُصْحَفٌ فِي الْبَحْرِ فَوَجَدُوهُ وَ قَدْ ذَهَبَ مَا فِيهِ إِلَّا هَذِهِ الْآيَةَ أَلا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ .",
					"english": "From him, from Al Husayn Bin Al Nazar, from Al Qasim Bin Suleyman, from Abu Maryam Al Ansary, from Jabir,<br>(It has been narrated) from Abu Ja’far (asws), said, ‘I heard him (asws) saying: ‘A Parchment had fallen into the sea, so I (asws) found it, and there had gone (obliterated) whatever was (written) in it except for this Verse [42:53] Indeed, to Allah do all affairs eventually come’."
				},
				{
					"arabic": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ مَيْمُونٍ الْقَدَّاحِ قَالَ قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) اقْرَأْ قُلْتُ مِنْ أَيِّ شَيْ‏ءٍ أَقْرَأُ قَالَ مِنَ السُّورَةِ التَّاسِعَةِ قَالَ فَجَعَلْتُ أَلْتَمِسُهَا فَقَالَ اقْرَأْ مِنْ سُورَةِ يُونُسَ قَالَ فَقَرَأْتُ لِلَّذِينَ أَحْسَنُوا الْحُسْنى وَ زِيادَةٌ وَ لا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ وَ لا ذِلَّةٌ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنِّي لَأَعْجَبُ كَيْفَ لَا أَشِيبُ إِذَا قَرَأْتُ الْقُرْآنَ .",
					"english": "‏ .<br>Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Aban, from Maymoun Al Qaddah who said,<br>‘Abu Ja’far (asws) said to me: ‘Read!’. I said, ‘From which thing?’ He (asws) said: ‘From the ninth Chapter’. So I went on to seek it. So he (asws) said: ‘Read from Surah Yunus (Chapter 10). So I recited [10:26] For those who do good is good and more; neither darkness nor disgrace shall cover their faces. He (asws) said: ‘Rasool-Allah (saww) said: ‘I (saww) am astonished how I (saww) do not age when I (saww) recite the Quran’."
				},
				{
					"arabic": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحَجَّالِ عَمَّنْ ذَكَرَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ بِلِسانٍ عَرَبِيٍّ مُبِينٍ قَالَ يُبِينُ الْأَلْسُنَ وَ لَا تُبِينُهُ الْأَلْسُنُ .",
					"english": "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Hajjal, from the one who mentioned it,<br>(It has been narrated) from one of the two (5th or 6th Imam (asws)), said, ‘I asked him (asws) about the Words of Allah (azwj) Mighty and Majestic [26:195] In clear Arabic language. He (asws) said: ‘It (Quran) explains the languages, and the languages do not explain it’."
				},
				{
					"arabic": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ أَبَانٍ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ جُذَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ عَبْدٍ يَقْرَأُ آخِرَ الْكَهْفِ إِلَّا تَيَقَّظَ فِي السَّاعَةِ الَّتِي يُرِيدُ .",
					"english": "Ahmad Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Muhammad Bin Al Waleed, from Aban, from Aamir Bin Abdullah Bin Juza’at,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘There is none from a servant who recites the end of (Surah) Al-Kahf except he will wake up in the time which he intended to’."
				},
				{
					"arabic": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ وَ غَيْرُهُ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) سُلَيْمٌ مَوْلَاكَ ذَكَرَ أَنَّهُ لَيْسَ مَعَهُ مِنَ الْقُرْآنِ إِلَّا سُورَةُ يس فَيَقُومُ مِنَ اللَّيْلِ فَيَنْفَدُ مَا مَعَهُ مِنَ الْقُرْآنِ أَ يُعِيدُ مَا قَرَأَ قَالَ نَعَمْ لَا بَأْسَ .",
					"english": "Abu Ali Al Ashary and someone else, from Al Hassan Bin Ali Al Kufy, from Usman Bin Isa, from Saeed Bin Yasaar who said,<br>‘I said to Abu Abdullah (asws), ‘Suleym, your (asws) slave mentioned that there is nothing with him from the Quran except for Surah Yaseen (Chapter 36). So he arises during the night and he runs out of what is with him from the Quran. Should he repeat what he recited?’ He (asws) said: ‘Yes, there is no problem’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ سَالِمِ بْنِ سَلَمَةَ قَالَ قَرَأَ رَجُلٌ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا أَسْتَمِعُ حُرُوفاً مِنَ الْقُرْآنِ لَيْسَ عَلَى مَا يَقْرَأُهَا النَّاسُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كُفَّ عَنْ هَذِهِ الْقِرَاءَةِ اقْرَأْ كَمَا يَقْرَأُ النَّاسُ حَتَّى يَقُومَ الْقَائِمُ ( عليه السلام ) فَإِذَا قَامَ الْقَائِمُ ( عليه السلام ) قَرَأَ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ عَلَى حَدِّهِ وَ أَخْرَجَ الْمُصْحَفَ الَّذِي كَتَبَهُ عَلِيٌّ ( عليه السلام )<br>وَ قَالَ أَخْرَجَهُ عَلِيٌّ ( عليه السلام ) إِلَى النَّاسِ حِينَ فَرَغَ مِنْهُ وَ كَتَبَهُ فَقَالَ لَهُمْ هَذَا كِتَابُ اللَّهِ عَزَّ وَ جَلَّ كَمَا أَنْزَلَهُ اللَّهُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ قَدْ جَمَعْتُهُ مِنَ اللَّوْحَيْنِ فَقَالُوا هُوَ ذَا عِنْدَنَا مُصْحَفٌ جَامِعٌ فِيهِ الْقُرْآنُ لَا حَاجَةَ لَنَا فِيهِ فَقَالَ أَمَا وَ اللَّهِ مَا تَرَوْنَهُ بَعْدَ يَوْمِكُمْ هَذَا أَبَداً إِنَّمَا كَانَ عَلَيَّ أَنْ أُخْبِرَكُمْ حِينَ جَمَعْتُهُ لِتَقْرَءُوهُ .",
					"english": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Abu Hashim, from Salim Bin Salama who said,<br>‘A man recited to Abu Abdullah (asws) and I was listening, certain phrases from the Quran, not being upon what the people are reading it. So Abu Abdullah (asws) said: ‘Stop from this recitation! Recite it just as the people are reciting it as until the rising of Al-Qaim (asws). So when the Qaim (asws) does arise, he (asws) would recite the Book of Allah (azwj) Mighty and Majestic upon its limits, and he (asws) would bring out the Parchment which Ali (asws) had written’.<br>  .<br>And he (asws) said: ‘Ali (asws) had brought it out when he (asws) was free from (compiling) it, and writing it. So he (asws) had said: ‘This is the Book of Allah (azwj) Mighty and Majesty just as Allah (azwj) had Revealed it upon Muhammad (saww)’; and he (asws) had gathered it from two Tablets. So they said, ‘It is that which is with us, a comprehensive Parchment, in which is the Quran. There is no need for us with regards to it’. So he (asws) said: ‘But, by Allah (azwj)! You will not be seeing it after this day of yours, ever! But rather, it was upon me (asws) that I should inform you all when I (asws) had gathered it, in order for you to be reciting it’."
				},
				{
					"arabic": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ الْأَعْرَجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَقْرَأُ الْقُرْآنَ ثُمَّ يَنْسَاهُ ثُمَّ يَقْرَأُهُ ثُمَّ يَنْسَاهُ أَ عَلَيْهِ فِيهِ حَرَجٌ فَقَالَ لَا .",
					"english": "Ali Bin Ibrahim, from his father, from Safwan, from Saeed Bin Abdullah Al A’araj who said,<br>‘I asked Abu Abdullah (asws) about the man who recites the Quran, then forgets it. Then he recites it, then he forgets it. Would there be a blame upon him?’ He (asws) said: ‘No’."
				},
				{
					"arabic": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبِي ( عليه السلام ) مَا ضَرَبَ رَجُلٌ الْقُرْآنَ بَعْضَهُ بِبَعْضٍ إِلَّا كَفَرَ .",
					"english": "Ali, from his father, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘My (asws) father (asws) said: ‘No man would strike the Quran, part of it with the other (explain one Verse with the other), except that he would disbelieve’."
				},
				{
					"arabic": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلٍ عَنْ سَدِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سُورَةُ الْمُلْكِ هِيَ الْمَانِعَةُ تَمْنَعُ مِنْ عَذَابِ الْقَبْرِ وَ هِيَ مَكْتُوبَةٌ فِي التَّوْرَاةِ سُورَةَ الْمُلْكِ وَ مَنْ قَرَأَهَا فِي لَيْلَتِهِ فَقَدْ أَكْثَرَ وَ أَطَابَ وَ لَمْ يُكْتَبْ بِهَا مِنَ الْغَافِلِين<br>َ إِنِّي لَأَرْكَعُ بِهَا بَعْدَ عِشَاءِ الْآخِرَةِ وَ أَنَا جَالِسٌ وَ إِنَّ وَالِدِي ( عليه السلام ) كَانَ يَقْرَأُهَا فِي يَوْمِهِ وَ لَيْلَتِهِ وَ مَنْ قَرَأَهَا إِذَا دَخَلَ عَلَيْهِ فِي قَبْرِهِ نَاكِرٌ وَ نَكِيرٌ مِنْ قِبَلِ رِجْلَيْهِ قَالَتْ رِجْلَاهُ لَهُمَا لَيْسَ لَكُمَا إِلَى مَا قِبَلِي سَبِيلٌ قَدْ كَانَ هَذَا الْعَبْدُ يَقُومُ عَلَيَّ فَيَقْرَأُ سُورَةَ الْمُلْكِ فِي كُلِّ يَوْمٍ وَ لَيْلَتِه<br>َ إِذَا أَتَيَاهُ مِنْ قِبَلِ جَوْفِهِ قَالَ لَهُمَا لَيْسَ لَكُمَا إِلَى مَا قِبَلِي سَبِيلٌ قَدْ كَانَ هَذَا الْعَبْدُ أَوْعَانِي سُورَةَ الْمُلْكِ وَ إِذَا أَتَيَاهُ مِنْ قِبَلِ لِسَانِهِ قَالَ لَهُمَا لَيْسَ لَكُمَا إِلَى مَا قِبَلِي سَبِيلٌ قَدْ كَانَ هَذَا الْعَبْدُ يَقْرَأُ بِي فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ سُورَةَ الْمُلْكِ .",
					"english": "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Ibn Mahboub, from Jameel, from Sadeyr,<br>(It has been narrated) from Abu Ja’far (asws) having said: ‘Surah Al-Mulk (Chapter 67), it is the defender. It defends from the Punishment of the grave. Surah Al-Mulk is Written in the Torah (as well), and the one who recites it during his night, so he would have the abundance, and pleasance, and he would not be Written as being from the neglectful ones due to it.<br> <br>And I (asws) tend to bow with it after the last Isha (Salāt) while I (asws) am seated, and my (asws) father (asws) used to recite it during his (asws) day and his (asws) night; and the one who recites it, when the Nakir and Nakeer (two Questioning Angels) come over to him in his grave from the direction of his left, his leg would say to both of them, ‘There is no way for the two of you from my direction, for it was so that this servant used to stand upon me and he was reciting Surah Al-Mulk during every day and night of his.<br>And when they come over to him from the direction of his middle, it would say to the to both of them, ‘There is no way for the two of you from my direction, as it was so that this servant had sheltered Surah Al-Mulk inside me’. And when they come over from the direction of his tongue, it would say to them both, ‘There is no way for the two of you from my direction, as it was so that this servant used to recite by me, during every day and night, Surah Al-Mulk’."
				},
				{
					"arabic": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ فَرْقَدٍ وَ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَا كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعَنَا رَبِيعَةُ الرَّأْيِ فَذَكَرْنَا فَضْلَ الْقُرْآنِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنْ كَانَ ابْنُ مَسْعُودٍ لَا يَقْرَأُ عَلَى قِرَاءَتِنَا فَهُوَ ضَالٌّ فَقَالَ رَبِيعَةُ ضَالٌّ فَقَالَ نَعَمْ ضَالّ<br>ُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَّا نَحْنُ فَنَقْرَأُ عَلَى قِرَاءَةِ أُبَيٍّ .",
					"english": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Farqad and Al Moalla Bin Khunays who both said,<br>‘We were both in the presence of Abu Abdullah (asws) and with us was Rabi’e Al-Ra’iy, and we mentioned the merits of the Quran. So Abu Abdullah (asws) said: ‘If it was so that Ibn Masoud is not reciting upon our (asws) recitation, so he has strayed’. So Rabi’e said, ‘Strayed?’ So he (asws) said: ‘Yes, strayed’.<br>Then Abu Abdullah (asws) said: ‘As for us (asws), so we (asws) are reciting it upon the recitation of my (asws) father (asws)’."
				},
				{
					"arabic": "عَلِيُّ بْنُ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْقُرْآنَ الَّذِي جَاءَ بِهِ جَبْرَئِيلُ ( عليه السلام ) إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) سَبْعَةَ عَشَرَ أَلْفَ آيَةٍ .",
					"english": "Ali Bin Al Hakam, from Hisham Bin Salim,<br>(It has been narrated) from Abu Abdullah (asws) having said: ‘The Quran which Jibraeel (as) came with unto Muhammad (saww) was of seventeen thousand Verses’."
				}
			]
		]
	]
}